{
  "abandonware": {
    "en": {
      "term": "abandonware",
      "def": "Software that is no longer being maintained.\n"
    },
    "es": {
      "term": "abandonware",
      "def": "Software cuyo mantenimiento ha sido abandonado.\n"
    }
  },
  "absolute_error": {
    "en": {
      "term": "absolute error",
      "def": "The absolute value of the difference between the observed and the correct value. Absolute error is usually less useful than [relative error](#relative_error).\n"
    },
    "es": {
      "term": "error absoluto",
      "def": "El valor absoluto de la diferencia entre el valor observado y el valor correcto. El error absoluto suele ser menos útil que el [error relativo](#relative_error).\n"
    }
  },
  "absolute_path": {
    "en": {
      "term": "absolute path",
      "def": "A path that points to the same location in the [filesystem](#filesystem) regardless of where it is evaluated. An absolute path is the equivalent of latitude and longitude in geography.\n"
    },
    "es": {
      "term": "ruta absoluta",
      "def": "Una ruta que dirige a la misma ubicación en el sistema de archivos independientemente del contexto donde sea evaluada. Una ruta absoluta es el equivalente a la latitud y longitud en geografía.\n"
    }
  },
  "absolute_row_number": {
    "en": {
      "term": "absolute row number",
      "def": "The sequential index of a row in a table, regardless of what sections of the table is being displayed.\n"
    },
    "es": {
      "term": "número de fila absoluto",
      "def": "El índice secuencial que indentifica una fila en un tablero, sin importar qué secciones se estén mostrando.\n"
    }
  },
  "abstract_method": {
    "en": {
      "term": "abstract method",
      "def": "In [object-oriented programming](#oop), a [method](#method) that is defined but not implemented. Programmers will define an abstract method in a [parent class](#parent_class) to specify operations that [child classes](#child_class) must provide.\n"
    },
    "es": {
      "term": "método abstracto",
      "def": "En la [programación orientada a objetos](#oop), un [método](#method) que está definido pero no implementado. Los programadores definen un método abstracto en una [clase padre](#parent_class) para especificar operaciones que las [clases hijas](#child_class) deben proporcionar.\n"
    }
  },
  "abstract_syntax_tree": {
    "en": {
      "term": "abstract syntax tree",
      "acronym": "AST",
      "def": "A deeply nested data structure, or [tree](#tree), that represents the structure of a program. For example, the AST might have a [node](#node) representing a [`while` loop](#while_loop) with one [child](#child_tree) representing the loop condition and another representing the [loop body](#loop_body).\n"
    },
    "es": {
      "term": "árbol de sintaxis abstracta",
      "acronym": "AST",
      "def": "Una estructura de datos profundamente anidada, o [árbol](#tree), que representa la estructura de un programa. Por ejemplo, el AST podría tener un [nodo](#node) que represente un [`bucle while`](#while_loop) con un [hijo](#child_tree) que represente la condición del bucle y otro que represente el [cuerpo del bucle](#loop_body).\n"
    }
  },
  "actual_result": {
    "en": {
      "term": "actual result (of test)",
      "def": "The value generated by running code in a test. If this matches the [expected result](#expected_result), the test [passes](#pass_test); if the two are different, the test [fails](#fail_test).\n"
    },
    "es": {
      "term": "resultado real (de una prueba)",
      "def": "El valor generado al ejecutar el código en una prueba. Si este coincide con el [resultado esperado](#expected_result), la prueba [pasa](#pass_test); si son diferentes, la prueba [falla](#fail_test).\n"
    }
  },
  "affordance": {
    "en": {
      "term": "affordance",
      "def": "A property of something that suggests how it can be used, such as a handle or button.\n"
    },
    "es": {
      "term": "sugestión de uso",
      "def": "Una propiedad de algo que sugiere cómo puede ser usado, como una manija o un botón.\n"
    }
  },
  "aggregation": {
    "en": {
      "term": "aggregation",
      "def": "To combine many values into one, e.g., by summing a set of numbers or concatenating a set of strings.\n"
    },
    "es": {
      "term": "agregación",
      "def": "Combinar muchos valores en uno, por ejemplo, sumando una serie de números o concatenando un conjunto de cadenas de caracteres.\n"
    }
  },
  "aggregation_function": {
    "en": {
      "term": "aggregation function",
      "def": "A function that combines many values into one, such as `sum` or `max`.\n"
    },
    "es": {
      "term": "función de agregación",
      "def": "Una función que combina varios valores en uno, como `sum` o `max`.\n"
    }
  },
  "agile": {
    "en": {
      "term": "agile development",
      "def": "A software development methodology that emphasizes lots of small steps and continuous feedback instead of up-front planning and long-term scheduling. [Exploratory programming](#exploratory_programming) is often agile.\n"
    },
    "es": {
      "term": "desarrollo ágil",
      "def": "Una metodología de desarrollo de software que enfatiza muchos pasos pequeños y feedback continuo en vez de planificación por adelantado y a largo plazo. [Programación exploratoria](#exploratory_programming) suele ser ágil.\n"
    }
  },
  "algorithm": {
    "en": {
      "term": "algorithm",
      "def": "An algorithm is a set of steps, intructions, or rules to be followed to accomplish a specific task. In computer science, an algorithm is a set of instructions in a computer program that solves a computational problem.\n"
    },
    "es": {
      "term": "algoritmo",
      "def": "Un algortimo es un conjunto de pasos, instrucciones o reglas que se han de seguir para llevar a cabo una tarea específica. En informática, un algoritmo es un conjunto de instrucciones en un programa informático que resuelve un problema computacional.\n"
    }
  },
  "aliasing": {
    "en": {
      "term": "aliasing",
      "def": "To have two or more references to the same thing, such as a data structure in memory or a file on disk.\n"
    },
    "es": {
      "term": "aliasing",
      "def": "Tener dos o más referencias a la misma cosa, como una estructura de datos en memoria o un archivo en el disco.\n"
    }
  },
  "anchor": {
    "en": {
      "term": "anchor",
      "def": "In a [regular expression](#regular_expression), a symbol that fixes a position without matching characters. `^` matches the start of the line, while `$` matches the end of the line and `\\b` matches a break between word and non-word characters.\n"
    },
    "es": {
      "term": "ancla",
      "def": "En una [expresión regular](#regular_expression), el símbolo que fija una posición sin coincidir con caracteres. `^` coincide con un inicio de línea, `$` con el final y `\\b` con un límite de palabra.\n"
    }
  },
  "anonymous_function": {
    "en": {
      "term": "anonymous function",
      "def": "A function that has not been assigned a name. Anonymous functions are usually quite short, and are usually defined where they are used, e.g., as callbacks. In [Python](#python), these are called lambda functions and are created through use of the lambda reserved word.\n"
    },
    "es": {
      "term": "Función anónima",
      "def": "Es una función que no tiene asignado un nombre. Las funciones anónimas son usualmente cortas, y se definen en el mismo lugar donde son utilizadas, por ejemplo: en callbacks. En [Python](#python), estas funciones se conocen como funciones lambda y son creadas con el uso de la palabra reservada lambda.\n"
    }
  },
  "anti_join": {
    "en": {
      "term": "anti join",
      "def": "A [join](#join) that keeps rows from table A whose keys do *not* match keys in table B.\n"
    },
    "es": {
      "term": "anti join",
      "def": "Una [unión](#join) que conserva las filas de la tabla A cuyas claves *no* coinciden con las de la tabla B.\n"
    }
  },
  "api": {
    "en": {
      "term": "Application Programming Interface",
      "acronym": "API",
      "def": "A set of functions and procedures provided by one software library or web service through which another application can communicate with it. An API is not the code, the database, or the server: it's the access point.\n"
    },
    "es": {
      "term": "Interfaz de Programación de Aplicaciones",
      "def": "Un conjunto de funciones y procedimientos proporcionados por una libreria de software o servicio web atraves del cual otra aplicación se puede comunicar. Una API no es el código, la base de datos o el servidor; es el punto de acceso.\n"
    }
  },
  "append_mode": {
    "en": {
      "term": "append mode",
      "def": "To add data to the end of an existing file instead of overwriting the previous contents of that file. Overwriting is the default, so most programming languages require programs to be explicit about wanting to append instead.\n"
    },
    "es": {
      "term": "modo de adición",
      "def": "Agregar datos al final de un archivo existente en lugar de sobrescribir su contenido anterior. Sobrescribir es lo predeterminado, por lo que la mayoría de los lenguajes de programación requieren que los programas sean explícitos al querer añadir en su lugar.\n"
    }
  },
  "argument": {
    "en": {
      "term": "argument",
      "def": "The term should not be confused with, and is not a synonym for, [parameter](#parameter). An argument is one of possibly several expressions that are passed to a function. It is the actual value that is passed. Parameters and arguments are distinct, but related concepts. Parameters are variables and arguments are the values assigned to those variables.\n"
    },
    "es": {
      "term": "argumento",
      "def": "Un valor pasado a una función. Algunos autores usan el término como sinónimo de [parámetro](#parameter) y algunos no; Todo es muy confuso.\n"
    }
  },
  "arithmetic_mean": {
    "en": {
      "term": "arithmetic mean",
      "def": "See [mean](#mean). Calculated from a set of n numbers by summing those  numbers, and dividing the result by n. See [mean](#mean).\n"
    },
    "es": {
      "term": "media aritmética",
      "def": "Ver [media](#mean).\n"
    }
  },
  "ascii": {
    "en": {
      "term": "ASCII",
      "def": "A standard way to represent the characters commonly used in the Western European languages as 7- or 8-[bit](#bit) integers, now superseded by [Unicode](#unicode).\n"
    },
    "es": {
      "term": "ASCII",
      "def": "Manera estándar de representar los caracteres comúnmente usados en lenguajes de Europa Occidental como enteros de 7- u 8-[bits](#bit), ahora reemplazado por [Unicode](#unicode).\n"
    }
  },
  "assertion": {
    "en": {
      "term": "assertion",
      "def": "A [Boolean](#boolean) expression that must be [true](#true) at a certain point in a program. Assertions may be built into the language (e.g., [Python](#python)'s `assert` statement) or provided as functions (e.g., [R](#r_language)'s `stopifnot`). They are often used in testing, but are also put in [production code](#production_code) to check that it is behaving correctly. In many languages, assertions should not be used to perform data validation as they may be silently dropped by compilers and interpreters under optimization conditions. Using assertions for data validation can therefore introduce security risks. Unlike many languages, R does not have an `assert` statement which can be disabled, and so use of a [package](#package) such as `assertr` for data validation does not create security holes.\n"
    },
    "es": {
      "term": "afirmación",
      "def": "Una expresión [booleana](#boolean) que debe ser [verdadera](#true) en un cierto punto de un programa. Las afirmaciones pueden estar integradas en el lenguaje (por ejemplo, la instrucción `assert` en [Python](#python)) o proporcionadas como funciones (por ejemplo, `stopifnot` en [R](#r_language)). Se usan a menudo en pruebas, pero también se colocan en [código de producción](#production_code) para verificar que se comporta correctamente. En muchos lenguajes, las afirmaciones no deben usarse para validar datos, ya que pueden ser eliminadas silenciosamente por compiladores e intérpretes durante la optimización. Usar afirmaciones para validar datos puede introducir riesgos de seguridad. A diferencia de muchos lenguajes, R no tiene una instrucción `assert` que pueda ser deshabilitada, por lo que el uso de un [paquete](#package) como `assertr` para validación de datos no crea vulnerabilidades.\n"
    }
  },
  "associative_array": {
    "en": {
      "term": "associative array",
      "def": "See [dictionary](#dictionary).\n"
    },
    "es": {
      "term": "arreglo asociativo",
      "def": "Ver [diccionario](#dictionary).\n"
    }
  },
  "asynchronous": {
    "en": {
      "term": "asynchronous",
      "def": "Not happening at the same time. In programming, an asynchronous operation is one that runs independently of another, or that starts at one time and ends at another.\n"
    },
    "es": {
      "term": "asincrónico",
      "def": "No sucediendo al mismo tiempo. En programación, una operación asincrónica es una que corre independientemente de otra, o que comienza en un tiempo y termina en otro.\n"
    }
  },
  "attribute": {
    "en": {
      "term": "attribute",
      "def": "A name-value pair associated with an object, used to store metadata about the object such as an array's dimensions.\n"
    },
    "es": {
      "term": "atributo",
      "def": "Un par nombre-valor asociado con un objeto, utilizado para almacenar metadatos sobre el objeto, como las dimensiones de un arreglo.\n"
    }
  },
  "auto_completion": {
    "en": {
      "term": "auto-completion",
      "def": "A feature that allows the user to finish a word or code quickly by pressing the TAB key to list possible words or code from which the user can select.\n"
    },
    "es": {
      "term": "autocompletado",
      "def": "Una función que permite al usuario completar rápidamente una palabra o código presionando la tecla TAB para listar posibles opciones entre las cuales puede seleccionar.\n"
    }
  },
  "automatic_variable": {
    "en": {
      "term": "automatic variable",
      "def": "A variable that is automatically given a value in a [build rule](#build_rule). For example, Make automatically assigns the name of a rule's [target](#build_target) to the automatic variable `$@`. Automatic variables are frequently used when writing [pattern rules](#pattern_rule).\n"
    },
    "es": {
      "term": "variable automática",
      "def": "Una variable a la que se le asigna automáticamente un valor en una [regla de compilación](#build_rule). Por ejemplo, Make asigna automáticamente el nombre de un [objetivo](#build_target) a la variable automática `$@`. Las variables automáticas se utilizan frecuentemente al escribir [reglas de patrón](#pattern_rule).\n"
    }
  },
  "backpropagation": {
    "en": {
      "term": "backpropagation",
      "def": "An algorithm that iteratively adjusts the weights used in a [neural network](#neural_network). Backpropagation is often used to implement [gradient descent](#gradient_descent).\n"
    },
    "es": {
      "term": "retropropagación",
      "def": "Un algoritmo que ajusta iterativamente los pesos utilizados en una [red neuronal](#neural_network). La retropropagación se usa comúnmente para implementar el [descenso de gradiente](#gradient_descent).\n"
    }
  },
  "backward_compatible": {
    "en": {
      "term": "backward-compatible",
      "def": "A property of a system, hardware or software, that allows for interoperability with an older legacy system, or with input designed for such a system. For example a [function](#function) written in [Python](#python) 3 that can be run successfully with Python version 2 is backward-compatible.\n"
    },
    "es": {
      "term": "compatible hacia atrás",
      "def": "Una propiedad de un sistema, hardware o software, que permite la interoperabilidad con un sistema anterior o con entradas diseñadas para dicho sistema. Por ejemplo, una [función](#function) escrita en [Python](#python) 3 que puede ejecutarse correctamente en Python versión 2 es compatible hacia atrás.\n"
    }
  },
  "base_r": {
    "en": {
      "term": "base R",
      "def": "The basic functions making up the [R](#r_language) language. The base packages can be found in `src/library` and are not updated outside of R; their version numbers follow R version numbering. Base packages are installed and loaded with R, while priority packages are installed with base R but must be loaded prior to use.\n"
    },
    "es": {
      "term": "R base",
      "def": "Funciones básicas que conforman el lenguaje de programación [R](#r_language). Los paquetes base pueden encontrarse en `src/library` y no son actualizados fuera de R; su número de versión coincide con el de R. Los paquetes de R base se instalan y cargan junto con R, mientras que los paquetes prioritarios se instalan con R, pero deben ser cargados antes de utilizarse.\n"
    }
  },
  "bayes_rule": {
    "en": {
      "term": "Bayes' Rule",
      "def": "See [Bayes' Theorem](#bayes_theorem).\n"
    },
    "es": {
      "term": "Regla de Bayes",
      "def": "Ver [Teorema de Bayes](#bayes_theorem).\n"
    }
  },
  "bayes_theorem": {
    "en": {
      "term": "Bayes' Theorem",
      "def": "An equation for calculating the probability that something is [true](#true) if something related to it is true. If P(X) is the probability that X is true and P(X|Y) is the probability that X is true given Y is true, then P(X|Y) = P(Y|X) * P(X) / P(Y).\n"
    },
    "es": {
      "term": "Teorema de Bayes",
      "def": "Una ecuación para calcular la probabilidad de que algo sea [verdadero](#true) si algo     relacionado con ello es verdadero. Si P(X) es la probabilidad de que X is verdadero y P(X|Y) es     la probabilidad de que X es verdadero dado que Y sea verdadero, entonces P(X|Y) = P(Y|X) * P(X) / P(Y).\n"
    }
  },
  "bayesian_network": {
    "en": {
      "term": "Bayesian network",
      "def": "A graph that represents the relationships between random variables for a given problem.\n"
    },
    "es": {
      "term": "Red Bayesiana",
      "def": "Un grafo que representa la relacion entre las variables aleatorias para un determinado problema.\n"
    }
  },
  "bias": {
    "en": {
      "term": "bias",
      "def": "A statistic is biased if it is systematically or consistently different from the parameter it is supposed to estimate.\n"
    },
    "es": {
      "term": "sesgo",
      "def": "Un estadístico está sesgado si es sistemática o consistentemente diferente del parámetro que se supone que debe estimar.\n"
    }
  },
  "big_data": {
    "en": {
      "term": "big data",
      "def": "Any data that until recently was too big for most people to work with on a single computer.\n"
    },
    "es": {
      "term": "big data",
      "def": "Cualquier conjunto de datos que hasta hace poco era demasiado grande para que la mayoría de las personas lo procesaran en una sola computadora.\n"
    }
  },
  "binary": {
    "en": {
      "term": "binary",
      "def": "A system which can have one of two possible states. In computing often represented as being in the state 0 or 1. Represented in [Boolean](#boolean) logic as [false](#false) (0) or [true](#true) (1). Computers are built upon systems which store 0s and 1s as [bits](#bit).\n"
    },
    "es": {
      "term": "sistema binario",
      "def": "Un sistema donde puede haber dos posibilidades de estado. En la computación, el sistema binario se representa con el estado de 0 ó 1. En el sistema lógico [Booleano](#boolean), [falso](#false) se representa con (0) y [verdadero](#true) con (1). Las computadoras operan en sistemas  binarios donde almacenan [bits](#bit).\n"
    }
  },
  "binary_expression": {
    "en": {
      "term": "binary expression",
      "def": "An expression which has two parameters and takes two arguments, such as `1 + 2`.\n"
    },
    "es": {
      "term": "expresión binaria",
      "def": "Una expresión que tiene dos parámetros y toma dos argumentos, como 1 + 2.\n"
    }
  },
  "binomial_distribution": {
    "en": {
      "term": "binomial distribution",
      "def": "A [probability distribution](#probability_distribution) that arises when there are a fixed number of trials, each of which can produce one of two outcomes, and the probability of those outcomes does not change. As the number of trials increases, the binomial distribution approximates a [normal distribution](#normal_distribution).\n"
    },
    "es": {
      "term": "distribución binomial",
      "def": "Una [distribución de probabilidad](#probability_distribution) que ocurre cuando hay un número fijo de ensayos, cada uno con dos posibles resultados, y la probabilidad de esos resultados no cambia. A medida que aumenta el número de ensayos, la distribución binomial se aproxima a una [distribución normal](#normal_distribution).\n"
    }
  },
  "bit": {
    "en": {
      "term": "bit",
      "def": "A unit of information representing alternatives, yes/no, [true](#true)/[false](#false). In computing a state of either 0 or 1.\n"
    },
    "es": {
      "term": "bit",
      "def": "Unidad de información representando alternativas si/no, [verdadero](#true)/[falso](#false). En computación, un estado de ser 0 ó 1.\n"
    }
  },
  "blob": {
    "en": {
      "term": "binary large object",
      "acronym": "BLOB",
      "def": "Data that is stored in a database without being interpreted in any way, such as an audio file. The term is also now used to refer to data transferred over a network or stored in a [version control](#version_control_system) [repository](#repository) as uninterpreted bits.\n"
    },
    "es": {
      "term": "objeto binario grande",
      "acronym": "BLOB",
      "def": "Datos almacenados en una base de datos sin ser interpretados, como un archivo de audio. El término también se usa para referirse a datos transferidos por una red o almacenados en un [sistema de control de versiones](#version_control_system) como bits no interpretados.\n"
    }
  },
  "block_comment": {
    "en": {
      "term": "block comment",
      "def": "A [comment](#comment) that spans multiple lines. Block comments may be marked with special start and end symbols, like /* and */ in C and its descendents, or each line may be prefixed with a marker like #.\n"
    },
    "es": {
      "term": "comentario en bloque",
      "def": "Un [comentario](#comment) que abarca múltiples líneas. Los comentarios en bloque pueden estar marcados con símbolos especiales de inicio y fin, como /* y */ en C y sus derivados, o cada línea puede comenzar con un marcador como #.\n"
    }
  },
  "boilerplate": {
    "en": {
      "term": "boilerplate",
      "def": "Standard text that is included in legal contracts, licenses, and so on. Also parts of the source code that have to be repeated very often to get basic functionality. In [object-oriented programs](#oop) these segments are used to encapsulate variables of objects. Some languages require a lot of these statements and are termed boilerplate languages, e.g. Java, which means that they are frequently generated automatically or by using [auto-completion](#auto_completion).\n"
    },
    "es": {
      "term": "boilerplate",
      "def": "Texto estándar que se incluye en contratos legales, licencias, etc. También se refiere a partes del código fuente que deben repetirse frecuentemente para obtener funcionalidad básica. En [programas orientados a objetos](#oop), estos segmentos encapsulan variables de objetos. Algunos lenguajes como Java requieren muchas de estas declaraciones, por lo que suelen generarse automáticamente o mediante [autocompletado](#auto_completion).\n"
    }
  },
  "boolean": {
    "en": {
      "term": "Boolean",
      "def": "Relating to a variable or data type that can have either a logical value of [true](#true) or [false](#false). Named for George Boole, a 19th century mathematician. Binary systems, like all computers, are built on this foundation of systems of logical evaluations between states of true and false, 1 or 0.\n"
    },
    "es": {
      "term": "Booleano",
      "def": "Relacionado a una variable o tipo de dato que puede tomar un valor lógico. Un valor lógico puede ser [verdadero](#true) o [falso](#false). El termino \"booleano\" viene en honor a George Boole, un matematico del siglo XIX. El concepto del computador esta fundamentado en el sistema binario, en el qual se evalua entre estados de verdedero o falso.\n"
    }
  },
  "branch": {
    "en": {
      "term": "branch",
      "def": "See [Git branch](#git_branch).\n"
    },
    "es": {
      "term": "rama",
      "def": "Ver [rama de Git](#git_branch).\n"
    }
  },
  "branch_per_feature_workflow": {
    "en": {
      "term": "branch-per-feature workflow",
      "def": "A common strategy for managing work with [Git](#git) and other [version control systems](#version_control_system) in which a separate [branch](#git_branch) is created for work on each new feature or each [bug](#bug) fix and merged when that work is completed. This isolates changes from one another until they are completed.\n"
    },
    "es": {
      "term": "flujo de trabajo de rama por característica",
      "def": "Una estrategia común para gestionar el trabajo con [Git](#git) y otros [sistemas de control de versiones](#version_control_system), en la que se crea una [rama](#git_branch) separada para cada nueva funcionalidad o [error](#bug), y se fusiona cuando ese trabajo se completa. Esto aísla los cambios entre sí hasta que estén listos.\n"
    }
  },
  "breadcrumbs": {
    "en": {
      "term": "breadcrumbs",
      "def": "A set of supplementary navigational links included in many websites, usually placed at the top of the page. Breadcrumbs show the users where the current page lies in the website; the term comes from a fairy tale in which children left a trail of breadcrumbs behind themselves so that they could find their way home.\n"
    },
    "es": {
      "term": "guías de navegación",
      "def": "Literalmente: “migas,” “migas de pan,” “migaja;” en esto contexto: “árbol de navegación,” “guías de navegación,” “navegación de migas,“ o “rastro de navegación.” Un grupo de enlaces de navegación incluidos en muchos sitios web, generalmente ubicados en la parte superior de una página. “Breadcrumbs” muestran a los usuarios dónde se encuentra la página en el sitio web; la palabra proviene de un cuento de hadas en que unos niños habían dejado atrás un rastro de migas de pan para que pudieran encontrar su camino a casa.\n"
    }
  },
  "breadth_first": {
    "en": {
      "term": "breadth first",
      "def": "To go through a nested data structure such as a [tree](#tree) by exploring all of one level, then going on to the next level and so on, or to explore a problem by examining the first step of each possible solution, and then trying the next step for each.\n"
    },
    "es": {
      "term": "recorrido en anchura",
      "def": "Recorrer una estructura de datos anidada como un [árbol](#tree) explorando primero todos los elementos de un nivel, luego pasando al siguiente nivel, y así sucesivamente. También se refiere a explorar un problema examinando el primer paso de cada posible solución, y luego intentando el siguiente paso para cada una.\n"
    }
  },
  "browser_cache": {
    "en": {
      "term": "browser cache",
      "def": "A place where web browsers keep copies of previously retrieved files (web pages, data files) in order to save time when they're requested again. Sometimes, issues may arise if there is a newer version of the file online, but the browser doesn't notice it.\n"
    },
    "es": {
      "term": "caché del navegador",
      "def": "Un lugar donde los navegadores web guardan copias de archivos previamente obtenidos (páginas web, archivos de datos) para ahorrar tiempo cuando se solicitan nuevamente. A veces pueden surgir problemas si hay una versión más reciente del archivo en línea, pero el navegador no la detecta.\n"
    }
  },
  "bug": {
    "en": {
      "term": "bug",
      "def": "A missing or undesirable [feature](#feature_software) of a piece of software; the digital equivalent of a weed.\n"
    },
    "es": {
      "term": "error",
      "def": "Una [función](#feature_software) faltante o no deseada en un software; el equivalente digital de una maleza.\n"
    }
  },
  "bug_report": {
    "en": {
      "term": "bug report",
      "def": "A collection of files, [logs](#log), or related information that describes either an unexpected output of some code or program, or an unexpected error or warning. This information is used to help find and fix a [bug](#bug) in the program or code.\n"
    },
    "es": {
      "term": "reporte de error",
      "def": "Una colección de archivos, [registros](#log) u otra información relacionada que describe una salida inesperada de un programa o código, o un error o advertencia inesperada. Esta información se utiliza para ayudar a encontrar y corregir un [error](#bug).\n"
    }
  },
  "bug_tracker": {
    "en": {
      "term": "bug tracker",
      "def": "A system that tracks and manages [reported bugs](#bug_report) for a software program, to make it easier to address and fix the [bugs](#bug).\n"
    },
    "es": {
      "term": "rastreador de errores",
      "def": "Un sistema que rastrea y gestiona los [errores reportados](#bug_report) en un programa de software, para facilitar su seguimiento y corrección de los [errores](#bug).\n"
    }
  },
  "build_manager": {
    "en": {
      "term": "build manager",
      "def": "A program that keeps track of how files depend on one another and runs commands to update any files that are out-of-date. Build managers were invented to [compile](#compile) only those parts of programs that had changed, but are now often used to implement workflows in which plots depend on results files, which in turn depend on raw data files or configuration files.\n"
    },
    "es": {
      "term": "gestor de compilación",
      "def": "Un programa que rastrea cómo los archivos dependen unos de otros y ejecuta comandos para actualizar cualquier archivo que esté desactualizado. Los gestores de compilación fueron creados para [compilar](#compile) solo las partes de un programa que hayan cambiado, pero hoy en día también se usan para implementar flujos de trabajo donde los gráficos dependen de archivos de resultados, que a su vez dependen de archivos de datos en bruto o archivos de configuración.\n"
    }
  },
  "build_recipe": {
    "en": {
      "term": "build recipe",
      "def": "The part of a [build rule](#build_rule) that describes how to update something that has fallen out-of-date.\n"
    },
    "es": {
      "term": "receta de compilación",
      "def": "La parte de una [regla de compilación](#build_rule) que describe cómo actualizar algo que está desactualizado.\n"
    }
  },
  "build_rule": {
    "en": {
      "term": "build rule",
      "def": "A specification for a [build manager](#build_manager) that describes how some files depend on others and what to do if those files are out-of-date.\n"
    },
    "es": {
      "term": "regla de compilación",
      "def": "Una especificación para un [gestor de compilación](#build_manager) que describe cómo algunos archivos dependen de otros y qué hacer si esos archivos están desactualizados.\n"
    }
  },
  "build_stale": {
    "en": {
      "term": "stale (in build)",
      "def": "To be out-of-date compared to a [prerequisite](#prerequisite). A [build manager](#build_manager)'s job is to find and update things that are stale.\n"
    },
    "es": {
      "term": "desactualizado (en compilación)",
      "def": "Estar desactualizado en comparación con un [requisito previo](#prerequisite). El trabajo de un [gestor de compilación](#build_manager) es encontrar y actualizar los elementos que están desactualizados.\n"
    }
  },
  "build_target": {
    "en": {
      "term": "build target",
      "def": "The file(s) that a [build rule](#build_rule) will update if they are out-of-date compared to their [dependencies](#dependency).\n"
    },
    "es": {
      "term": "objetivo de compilación",
      "def": "El(los) archivo(s) que una [regla de compilación](#build_rule) actualizará si están desactualizados en comparación con sus [dependencias](#dependency).\n"
    }
  },
  "byte_code": {
    "en": {
      "term": "byte code",
      "def": "A set of instructions designed to be executed efficiently by an [interpreter](#interpreter).\n"
    },
    "es": {
      "term": "código de bytes",
      "def": "Un conjunto de instrucciones diseñadas para ser ejecutadas eficientemente por un [intérprete](#interpreter).\n"
    }
  },
  "cache": {
    "en": {
      "term": "cache",
      "def": "Something that stores copies of data so that future requests for it can be satisfied more quickly. The CPU in a computer uses a hardware cache to hold recently-accessed values; many programs rely on a software cache to reduce network traffic and latency. Figuring out when something in a cache is out-of-date and should be replaced is one of the [two hard problems in computer science](#two_hard_problems).\n"
    },
    "es": {
      "term": "caché",
      "def": "Algo que almacena copias de datos para que futuras solicitudes puedan satisfacerse más rápidamente. El CPU de una computadora usa una caché de hardware para mantener valores accedidos recientemente; muchos programas dependen de una caché de software para reducir el tráfico de red y la latencia. Determinar cuándo algo en la caché está desactualizado y debe ser reemplazado es uno de los [dos problemas difíciles en la informática](#two_hard_problems).\n"
    }
  },
  "caching": {
    "en": {
      "term": "caching",
      "def": "To save a copy of some data in a local [cache](#cache) to make future access faster.\n"
    },
    "es": {
      "term": "caching",
      "def": "Guardar una copia de algún dato en el [caché](#cache) local para hacer su acceso futuro más rápido.\n"
    }
  },
  "call_stack": {
    "en": {
      "term": "call stack",
      "def": "A data structure that stores information about the active subroutines executed.\n"
    },
    "es": {
      "term": "pila de llamadas",
      "def": "Una estructura de datos que almacena información sobre las subrutinas activas que se están ejecutando.\n"
    }
  },
  "callback": {
    "en": {
      "term": "callback function",
      "def": "A function A that is passed to another function B so that B can call it at some later point. Callbacks can be used [synchronously](#synchronous), as in generic functions like `map` that invoke a callback function once for each element in a collection, or [asynchronously](#asynchronous), as in a [client](#client) that runs a callback when a [response](#http_response) is received in answer to a [request](#http_request).\n"
    },
    "es": {
      "term": "función de devolución (callback)",
      "def": "Una función A que se pasa a otra función B para que B pueda llamarla posteriormente. Las funciones de devolución pueden utilizarse de forma [sincrónica](#synchronous), como en funciones genéricas como `map`, que invoca una función callback una vez por cada elemento de una colección, o de forma [asincrónica](#asynchronous), como en un [cliente](#client) que ejecuta una callback cuando se recibe una [respuesta](#http_response) a una [solicitud](#http_request).\n"
    }
  },
  "camel_case": {
    "en": {
      "term": "camel case",
      "def": "A style of writing code that involves naming variables and objects with no space, underscore (`_`), dot (`.`), or dash (`-`) characters, with each word being capitalized. Examples include `CalculateSum` and `findPattern`.\n"
    },
    "es": {
      "term": "notación camel case",
      "def": "Un estilo de escritura de código que consiste en nombrar variables y objetos sin espacios, guiones bajos (`_`), puntos (`.`) ni guiones (`-`), y donde cada palabra comienza con mayúscula. Ejemplos incluyen `CalculateSum` y `findPattern`.\n"
    }
  },
  "catch_exception": {
    "en": {
      "term": "catch (an exception)",
      "def": "To accept responsibility for handling an error or other unexpected event. [R](#r_language) prefers \"handling a condition\" to \"catching an exception.\" [Python](#python), on the other hand, encourages raising and catching exceptions, and in some situations, requires it.\n"
    },
    "es": {
      "term": "capturar (una excepción)",
      "def": "Aceptar la responsabilidad de manejar un error u otro evento inesperado. [R](#r_language) prefiere el término \"manejar una condición\" en lugar de \"capturar una excepción\". Por otro lado, [Python](#python) fomenta lanzar y capturar excepciones, y en algunas situaciones lo requiere.\n"
    }
  },
  "causation": {
    "en": {
      "term": "causation",
      "def": "A relationship between distinct events, where it is asserted that one event is responsible for producing or affecting change in the other.\n"
    },
    "es": {
      "term": "causalidad",
      "def": "Una relación entre eventos distintos, donde se afirma que uno de ellos es responsable de producir o afectar un cambio en el otro.\n"
    }
  },
  "cc_0": {
    "en": {
      "term": "CC-0",
      "def": "A [Creative Commons](#cc_license) [license](#license) that imposes no restrictions whatsover, thereby putting a work in the public domain.\n"
    },
    "es": {
      "term": "CC-0",
      "def": "Una [licencia](#license) de [Creative Commons](#cc_license) que no impone ninguna restricción, por lo que pone a la obra en dominio público.\n"
    }
  },
  "cc_by": {
    "en": {
      "term": "CC-BY",
      "def": "The [Creative Commons](#cc_license) - Attribution [license](#license) that requires people to give credit to the author of a work, but imposes no other restrictions.\n"
    },
    "es": {
      "term": "CC-BY",
      "def": "La [licencia](#license) de [Creative Commons](#cc_license) - Atribución que requiere que las personas den crédito al autor de una obra, pero no impone otras restricciones.\n"
    }
  },
  "cc_license": {
    "en": {
      "term": "Creative Commons license",
      "def": "A set of [licenses](#license) that can be applied to published work. Each license is formed by concatenating one or more of `-BY` (Attribution): users must cite the original source; `-SA` (ShareAlike): users must share their own work under a similar license; `-NC` (NonCommercial): work may not be used for commercial purposes without the creator's permission; `-ND` (NoDerivatives): no derivative works (e.g., translations) can be created without the creator's permission. Thus, `CC-BY-NC` means \"users must give attribution and cannot use commercially without permission.\" The term `CC-0` (zero, not letter 'O') is sometimes used to mean \"no restrictions,\" i.e., the work is in the public domain.\n"
    },
    "es": {
      "term": "licencia Creative Commons",
      "def": "Un conjunto de [licencias](#license) que se pueden aplicar a obras publicadas. Cada licencia se forma concatenando uno o más de los siguientes elementos: `-BY` (Atribución): los usuarios deben citar la fuente original; `-SA` (CompartirIgual): los usuarios deben compartir su trabajo bajo una licencia similar; `-NC` (NoComercial): la obra no puede utilizarse con fines comerciales sin el permiso del creador; `-ND` (SinObrasDerivadas): no se pueden crear obras derivadas (por ejemplo, traducciones) sin el permiso del creador. Por lo tanto, `CC-BY-NC` significa \"los usuarios deben dar atribución y no pueden usar con fines comerciales sin permiso.\" El término `CC-0` (cero, no la letra 'O') se usa a veces para significar \"sin restricciones,\" es decir, que la obra está en el dominio público.\n"
    }
  },
  "centroid": {
    "en": {
      "term": "centroid",
      "def": "The center or anchor of a group created by a [clustering](#clustering) algorithm.\n"
    },
    "es": {
      "term": "centroide",
      "def": "El centro o punto de referencia de un grupo creado por un algoritmo de [agrupamiento](#clustering).\n"
    }
  },
  "character_encoding": {
    "en": {
      "term": "character encoding",
      "def": "A specification of how characters are stored as bytes. The most commonly-used encoding today is [UTF-8](#utf_8).\n"
    },
    "es": {
      "term": "codificación de caracteres",
      "def": "Especificación sobre cómo los caracteres están guardados como bytes. En la actualidad, la codificación más utilizada es [UTF-8](#utf_8).\n"
    }
  },
  "chi_square_test": {
    "en": {
      "term": "chi-square test",
      "def": "A statistical method for estimating whether two variables in a cross tabulation are [correlated](#correlation). A chi-square distribution varies from a [normal distribution](#normal_distribution) based on the [degrees of freedom](#degrees_of_freedom) used to calculate it.\n"
    },
    "es": {
      "term": "prueba chi-cuadrado",
      "def": "Un método estadístico para estimar si dos variables en una tabla cruzada están [correlacionadas](#correlation). Una distribución chi-cuadrado varía de una [distribución normal](#normal_distribution) según los [grados de libertad](#degrees_of_freedom) utilizados para calcularla.\n"
    }
  },
  "child_class": {
    "en": {
      "term": "child class",
      "def": "In [object-oriented programming](#oop), a [class](#class) derived from another class (called the [parent class](#parent_class)).\n"
    },
    "es": {
      "term": "subclase",
      "def": "En [programación orientada a objetos](#oop), es la extensión de otra clase (denominada [superclase](#parent_class)).\n"
    }
  },
  "child_tree": {
    "en": {
      "term": "child (in a tree)",
      "def": "A [node](#node) in a [tree](#node) that is below another node (call the [parent](#parent_tree)).\n"
    },
    "es": {
      "term": "hijo (en un árbol)",
      "def": "Un [nodo](#node) en un [árbol](#node) que está por debajo de otro nodo (llamado el [padre](#parent_tree)).\n"
    }
  },
  "class": {
    "en": {
      "term": "class",
      "def": "In [object-oriented programming](#oop), a structure that combines data and operations (called [methods](#method)). The program then uses a [constructor](#constructor) to create an [object](#object) with those properties and methods. Programmers generally put generic or reusable behavior in [parent classes](#parent_class), and more detailed or specific behavior in [child classes](#child_class).\n"
    },
    "es": {
      "term": "clase",
      "def": "En [programación orientada a objetos](#oop), es una estructura que combina datos y operaciones (denominadas [métodos](#method)). El programa emplea un [constructor](#constructor) para crear un [objeto](#object) con esas propiedades y métodos. Los programadores generalmente definen comportamientos genéricos o reutilizables en [superclases](#parent_class) y comportamientos más específicos o detallados en [subclases](#child_class).\n"
    }
  },
  "classification": {
    "en": {
      "term": "classification",
      "def": "The process of identifying which predefined category an item belongs to, such as deciding whether an email message is spam or not. Many [machine learning](#machine_learning) algorithms perform classification.\n"
    },
    "es": {
      "term": "clasificación",
      "def": "El proceso de identificar a qué categoría predefinida pertenece un elemento, como decidir si un mensaje de correo electrónico es spam o no. Muchos algoritmos de [aprendizaje automático](#machine_learning) realizan tareas de clasificación.\n"
    }
  },
  "cli": {
    "en": {
      "term": "command-line interface",
      "def": "A user interface that relies solely on text for commands and output, typically running in a [shell](#shell).\n"
    },
    "es": {
      "term": "interfaz de línea de comandos",
      "def": "Una interfaz de usuario que se basa únicamente en texto para los comandos y la salida, normalmente ejecutándose en una [terminal](#shell).\n"
    }
  },
  "client": {
    "en": {
      "term": "client",
      "def": "Typically, a program such as a web browser that gets data from a [server](#server) and displays it to, or interacts with, users. The term is used more generally to refer to any program A that makes requests of another program B. A single program can be both a client and a server.\n"
    },
    "es": {
      "term": "cliente",
      "def": "Típicamente, un programa como un navegador web que obtiene datos de un [servidor](#server) y los muestra o interactúa con los usuarios. El término también se usa de forma más general para referirse a cualquier programa A que hace solicitudes a otro programa B. Un solo programa puede ser tanto cliente como servidor.\n"
    }
  },
  "closure": {
    "en": {
      "term": "closure",
      "def": "A set of variables defined in the same [scope](#scope) whose existence has been preserved after that scope has ended.\n"
    },
    "es": {
      "term": "clausura",
      "def": "Un conjunto de variables definidas en el mismo [ámbito](#scope) cuya existencia se ha preservado después de que ese ámbito haya terminado.\n"
    }
  },
  "clustering": {
    "en": {
      "term": "clustering",
      "def": "The process of dividing data into groups when the groups themselves are not known in advance.\n"
    },
    "es": {
      "term": "agrupamiento",
      "def": "El proceso de dividir datos en grupos cuando los grupos no se conocen de antemano.\n"
    }
  },
  "code_coverage": {
    "en": {
      "term": "code coverage (in testing)",
      "def": "How much of a [library](#library) or program is executed when tests run. This is normally reported as a percentage of lines of code: for example, if 40 out of 50 lines in a file are run during testing, those tests have 80% code coverage.\n"
    },
    "es": {
      "term": "cobertura de código (en pruebas)",
      "def": "Qué parte de una [librería](#library) o programa se ejecuta cuando se corren pruebas. Normalmente se reporta como un porcentaje de líneas de código: por ejemplo, si se ejecutan 40 de 50 líneas durante una prueba, esas pruebas tienen una cobertura del 80%.\n"
    }
  },
  "code_review": {
    "en": {
      "term": "code review",
      "def": "To check a program or a change to a program by inspecting its source code.\n"
    },
    "es": {
      "term": "revisión de código",
      "def": "Revisar un programa o un cambio a un programa inspeccionando su código fuente.\n"
    }
  },
  "coercion": {
    "en": {
      "term": "coercion",
      "def": "See [type coercion](#type_coercion).\n"
    },
    "es": {
      "term": "coerción",
      "def": "Ver [coerción de tipo](#type_coercion).\n"
    }
  },
  "cognitive_load": {
    "en": {
      "term": "cognitive load",
      "def": "The amount of working memory needed to accomplish a set of simultaneous tasks.\n"
    },
    "es": {
      "term": "carga cognitiva",
      "def": "La cantidad de memoria de trabajo necesaria para llevar a cabo un conjunto de tareas simultáneamente.\n"
    }
  },
  "command": {
    "en": {
      "term": "command",
      "def": "An instruction telling a computer program to perform a specific task.\n"
    },
    "es": {
      "term": "comando",
      "def": "Una instrucción que le indica a un programa de computadora realizar una tarea específica.\n"
    }
  },
  "command_history": {
    "en": {
      "term": "command history",
      "def": "An automatically created list of previously executed commands. Most read-eval-print loops ([REPLs](#repl)), including the [Unix shell](#shell), record history and allow users to play back recent commands.\n"
    },
    "es": {
      "term": "historial de comandos",
      "def": "Una lista creada automáticamente con los comandos ejecutados anteriormente. La mayoría de los [REPLs](#repl), incluyendo el [shell de Unix](#shell), registran este historial y permiten volver a ejecutar comandos recientes.\n"
    }
  },
  "command_line_argument": {
    "en": {
      "term": "command-line argument",
      "def": "A filename or control flag given to a command-line program when it is run.\n"
    },
    "es": {
      "term": "argumento de línea de comandos",
      "def": "Un nombre de archivo o indicador de control que se le pasa a un programa de línea de comandos al ejecutarlo.\n"
    }
  },
  "comment": {
    "en": {
      "term": "comment",
      "def": "Text written in a script that is not treated as code to be run, but rather as text that describes what the code is doing. These are usually short notes, often beginning with a `#` (in many programming languages).\n"
    },
    "es": {
      "term": "comentario",
      "def": "Texto escrito en un script que no se trata como código a ejecutar, sino como texto que describe lo que hace el código. Suelen ser notas cortas que comienzan con `#` (en muchos lenguajes de programación).\n"
    }
  },
  "commit": {
    "en": {
      "term": "commit",
      "def": "As a verb, the act of saving a set of changes to a database or [version control](#version_control_system) [repository](#repository). As a noun, the changes saved.\n"
    },
    "es": {
      "term": "commit",
      "def": "Como verbo, el acto de guardar un conjunto de cambios en una base de datos o [repositorio](#repository) de [control de versiones](#version_control_system). Como sustantivo, los cambios guardados.\n"
    }
  },
  "commit_message": {
    "en": {
      "term": "commit message",
      "def": "A comment attached to a [commit](#commit) that explains what was done and why.\n"
    },
    "es": {
      "term": "mensaje de commit",
      "def": "Un comentario adjunto a un [commit](#commit) que explica qué se hizo y por qué.\n"
    }
  },
  "compile": {
    "en": {
      "term": "compile",
      "def": "To translate textual source into another form. Programs in [compiled languages](#compiled_language) are translated into machine instructions for a computer to run, and [Markdown](#markdown) is usually translated into [HTML](#html) for display.\n"
    },
    "es": {
      "term": "compilar",
      "def": "Traducir código fuente en texto a otra forma. Los programas en [lenguajes compilados](#compiled_language) se traducen a instrucciones de máquina para que la computadora los ejecute, y [Markdown](#markdown) usualmente se traduce a [HTML](#html) para su visualización.\n"
    }
  },
  "compiled_language": {
    "en": {
      "term": "compiled language",
      "def": "Originally, a language such as C or Fortran that is translated into machine instructions for execution. Languages such as Java are also compiled before execution, but into [byte code](#byte_code) instead of machine instructions, while [interpreted languages](#interpreted_language) like [Python](#python) are compiled to byte code on the fly.\n"
    },
    "es": {
      "term": "lenguaje compilado",
      "def": "Originalmente, un lenguaje como C o Fortran que se traduce a instrucciones de máquina para su ejecución. Lenguajes como Java también se compilan antes de ejecutarse, pero a [byte code](#byte_code) en lugar de instrucciones de máquina, mientras que los [lenguajes interpretados](#interpreted_language) como [Python](#python) se compilan a byte code dinámicamente.\n"
    }
  },
  "compiler": {
    "en": {
      "term": "compiler",
      "def": "An application that translates programs written in some languages into machine instructions or [byte code](#byte_code).\n"
    },
    "es": {
      "term": "compilador",
      "def": "Una aplicación que traduce programas escritos en ciertos lenguajes a instrucciones de máquina o a [byte code](#byte_code).\n"
    }
  },
  "computational_linguistics": {
    "en": {
      "term": "computational linguistics",
      "def": "The study or application of computational methods for [parsing](#parse) or understanding human languages. Early approaches were algorithmic; most modern approaches are statistical.\n"
    },
    "es": {
      "term": "lingüística computacional",
      "def": "El estudio o aplicación de métodos computacionales para procesamiento o entendimiento de lenguajes humanos. Los primeros acercamientos fueron algorítmicos; la mayoría de los acercamientos modernos son estadísticos.\n"
    }
  },
  "computational_notebook": {
    "en": {
      "term": "computational notebook",
      "def": "A combination of a document format that allows users to mix prose and code in a single file, and an application that executes that code interactively and in place. The [Jupyter Notebook](#jupyter_notebook) and [R Markdown](#r_markdown) files are both examples of computational notebooks.\n"
    },
    "es": {
      "term": "cuaderno computacional",
      "def": "Una combinación entre un formato de documento que permite a los usuarios mezclar prosa y código en un solo archivo, y una aplicación que ejecuta ese código de forma interactiva y en el mismo lugar. [Jupyter Notebook](#jupyter_notebook) y [R Markdown](#r_markdown) son ejemplos de cuadernos computacionales.\n"
    }
  },
  "condition": {
    "en": {
      "term": "condition",
      "def": "An error or other unexpected event that disrupts the normal flow of control.\n"
    },
    "es": {
      "term": "condición",
      "def": "Un error u otro evento inesperado que interrumpe el flujo normal de ejecución.\n"
    }
  },
  "conditional_expression": {
    "en": {
      "term": "conditional expression",
      "def": "A [ternary expression](#ternary_expression) that serves the role of an if/else statement. For example, C and similar languages use the syntax `test : ifTrue ? ifFalse` to mean \"choose the value `ifTrue` if `test` is true, or the value `ifFalse` if it is not.\"\n"
    },
    "es": {
      "term": "expresión condicional",
      "def": "Una [expresión ternaria](#ternary_expression) que cumple el rol de una instrucción if/else. Por ejemplo, en C y lenguajes similares se usa la sintaxis `test ? ifTrue : ifFalse` para significar \"elige el valor `ifTrue` si `test` es verdadero, o `ifFalse` si no lo es.\"\n"
    }
  },
  "confidence_interval": {
    "en": {
      "term": "confidence interval",
      "def": "A range around an estimate that indicates the margin of error, combined with a probability that the actual value falls in that range.\n"
    },
    "es": {
      "term": "intervalo de confianza",
      "def": "Un rango alrededor de una estimación que indica el margen de error, junto con una probabilidad de que el valor real caiga dentro de ese rango.\n"
    }
  },
  "configuration file": {
    "en": {
      "term": "configuration file",
      "def": "A file that specifies the parameters and initial settings of a software program. Configuration, or config, files are often used for information subject to changes, such as environment-specific settings.\n"
    },
    "es": {
      "term": "archivo de configuración",
      "def": "Un archivo que especifica los parámetros y configuraciones iniciales de un programa de software. Los archivos de configuración suelen usarse para información sujeta a cambios, como configuraciones específicas del entorno.\n"
    }
  },
  "console": {
    "en": {
      "term": "console",
      "def": "A computer terminal where a user may enter commands, or a program, such as a shell that simulates such a device.\n"
    },
    "es": {
      "term": "consola",
      "def": "Un terminal de computadora donde un usuario puede ingresar comandos, o un programa como una shell que simula dicho dispositivo.\n"
    }
  },
  "constant": {
    "en": {
      "term": "constant",
      "def": "A value that cannot be changed after it has been defined, as opposed  to a [variable](#variable_program)."
    },
    "es": {
      "term": "constante",
      "def": "Un valor que no puede cambiar después de ser definido, a diferencia de una [variable](#variable_program).\n"
    }
  },
  "constructor": {
    "en": {
      "term": "constructor",
      "def": "A function that creates an [object](#object) of a particular [class](#class). In the [S3](#s3) object system, constructors are a convention rather than a requirement.\n"
    },
    "es": {
      "term": "constructor",
      "def": "Una función que crea un [objeto](#object) de una [clase](#class) particular. En el sistema de objetos de [S3](#s3), los constructores son más una convención que un requisito.\n"
    }
  },
  "continuation_prompt": {
    "en": {
      "term": "continuation prompt",
      "def": "A [prompt](#prompt) that indicates that the command currently being typed is not yet complete, and will not be run until it is.\n"
    },
    "es": {
      "term": "indicador de continuación",
      "def": "Un [indicador](#prompt) que señala que el comando que se está escribiendo aún no está completo y no se ejecutará hasta que lo esté.\n"
    }
  },
  "continuous_integration": {
    "en": {
      "term": "continuous integration",
      "def": "A software development practice in which changes are automatically merged as soon as they become available.\n"
    },
    "es": {
      "term": "integración continua",
      "def": "Una práctica de desarrollo de software en la que los cambios se combinan automáticamente tan pronto como están disponibles.\n"
    }
  },
  "continuous_random_variable": {
    "en": {
      "term": "continuous random variable",
      "def": "A [variable](#variable_data) whose value can be any real value, either within a range, or unbounded, such as age or distance.\n"
    },
    "es": {
      "term": "variable aleatoria continua",
      "def": "Una [variable](#variable_data) cuyo valor puede ser cualquier número real, dentro de un rango o sin límite, como la edad o la distancia.\n"
    }
  },
  "control_flow": {
    "en": {
      "term": "control flow",
      "def": "The logical flow through a program's code. May be linear (i.e. just a series of commands), but may also include [loops](#loop) or conditional execution (i.e. if a condition is met).\n"
    },
    "es": {
      "term": "flujo de control",
      "def": "El flujo lógico a través del código de un programa. Puede ser lineal (es decir, solo una serie de comandos), pero también puede incluir [bucles](#loop) o ejecución condicional (es decir, si se cumple una condición).\n"
    }
  },
  "copy_on_modify": {
    "en": {
      "term": "copy-on-modify",
      "def": "The practice of creating a new copy of aliased data whenever there is an attempt to modify it so that each reference will believe theirs is the only one.\n"
    },
    "es": {
      "term": "copiar al modificar",
      "def": "La práctica de crear una nueva copia de datos con alias cada vez que se intenta modificarlos para que cada referencia crea que es la única.\n"
    }
  },
  "correlation": {
    "en": {
      "term": "correlation",
      "def": "A measure of how well two variables agree with each other. Correlation is usually measured by calculating a [correlation coefficient](#correlation_coefficient), and does not imply [causation](#causation).\n"
    },
    "es": {
      "term": "correlación",
      "def": "Una medida de qué tan bien se relacionan dos variables. La correlación se suele medir mediante un [coeficiente de correlación](#correlation_coefficient) y no implica [causalidad](#causation).\n"
    }
  },
  "correlation_coefficient": {
    "en": {
      "term": "correlation coefficient",
      "def": "A measure of how well-[correlated](#correlation) two variables are. If the [correlation coefficient](#correlation_coefficient) between X and Y is 1.0, knowing X allows perfect prediction of Y. If the correlation coefficient is 0.0, knowing X tells you nothing about Y, and if it is -1.0, then X predicts Y, but a change in X causes an opposite change in Y.\n"
    },
    "es": {
      "term": "coeficiente de correlación",
      "def": "Una medida de qué tan bien-[correlacionadas](#correlation) están dos variables. Si el [coeficiente de correlación](#correlation_coefficient) entre X y Y es 1.0, conocer X permite predecir perfectamente Y. Si el coeficiente es 0.0, conocer X no da información sobre Y, y si es -1.0, entonces X predice Y, pero un cambio en X causa un cambio opuesto en Y.\n"
    }
  },
  "covariance": {
    "en": {
      "term": "covariance",
      "def": "How well two variables agree with each other. The [correlation coefficient](#correlation_coefficient) is a normalized measure of covariance.\n"
    },
    "es": {
      "term": "covarianza",
      "def": "Qué tan bien coinciden dos variables entre sí. El [coeficiente de correlación](#correlation_coefficient) es una medida normalizada de la covarianza.\n"
    }
  },
  "cpu": {
    "en": {
      "term": "Central Processing Unit",
      "acronym": "CPU",
      "def": "The principal hardware of any digital computer. The CPU constitutes the essential electronic circuitry that interprets and executes instructions from the software or other hardware. Also called a central processor, main processor, or microprocessor.\n"
    },
    "es": {
      "term": "Unidad Central de Procesamiento",
      "acronym": "CPU",
      "def": "El hardware principal de cualquier computadora digital. La CPU constituye el circuito electrónico esencial que interpreta y ejecuta instrucciones del software u otro hardware. También se conoce como procesador central, procesador principal o microprocesador.\n"
    }
  },
  "cran": {
    "en": {
      "term": "Comprehensive R Archive Network",
      "acronym": "CRAN",
      "def": "A public repository of [R](#r_language) packages.\n"
    },
    "es": {
      "term": "Red Integral de Archivos de R",
      "acronym": "CRAN",
      "def": "Un repositorio público de paquetes de [R](#r_language).\n"
    }
  },
  "cross_join": {
    "en": {
      "term": "cross join",
      "def": "A [join](#join) that produces all possible combinations of rows from two tables.\n"
    },
    "es": {
      "term": "unión cruzada",
      "def": "Una [unión](#join) que produce todas las combinaciones posibles de filas de dos tablas.\n"
    }
  },
  "cross_validation": {
    "en": {
      "term": "cross-validation",
      "def": "A technique that divides data into [training data](t#raining_data) and [test data](#test_data). The training data and correct answers are used to find [parameters](#parameter), and the algorithm's effectiveness is then measured by examining the answers it gives on the test data.\n"
    },
    "es": {
      "term": "validación cruzada",
      "def": "Una técnica que divide los datos en [datos de entrenamiento](#training_data) y [datos de prueba](#test_data). Los datos de entrenamiento y las respuestas correctas se utilizan para encontrar [parámetros](#parameter), y luego se mide la efectividad del algoritmo examinando las respuestas que da sobre los datos de prueba.\n"
    }
  },
  "cryptographic_hash_function": {
    "en": {
      "term": "cryptographic hash function",
      "def": "A [hash function](#hash_function) that produces an apparently-random value for any input.\n"
    },
    "es": {
      "term": "función hash criptográfica",
      "def": "Una [función hash](#hash_function) que produce un valor aparentemente aleatorio para cualquier entrada.\n"
    }
  },
  "css": {
    "en": {
      "term": "Cascading Style Sheets",
      "acronym": "CSS",
      "def": "A way to control the appearance of HTML. CSS is typically used to specify fonts, colors, and layout.\n"
    },
    "es": {
      "term": "Hojas de Estilo en Cascada",
      "acronym": "CSS",
      "def": "Una forma de controlar la apariencia del HTML. CSS se utiliza normalmente para especificar fuentes, colores y disposición.\n"
    }
  },
  "csv": {
    "en": {
      "term": "comma-separated values",
      "acronym": "CSV",
      "def": "A text format for tabular data in which each [record](#record) is one row and [fields](#field) are separated by commas. There are many minor variations, particularly around quoting of [strings](#string).\n"
    },
    "es": {
      "term": "valores separados por comas",
      "acronym": "CSV",
      "def": "Un formato de texto para datos tabulares en el que cada [registro](#record) es una fila y los [campos](#field) están separados por comas. Existen muchas variaciones menores, especialmente en torno al uso de comillas para las [cadenas](#string).\n"
    }
  },
  "current_working_directory": {
    "en": {
      "term": "current working directory",
      "def": "The [folder](#folder) or [directory](#directory) location in which the program operates. Any action taken by the program occurs relative to this directory.\n"
    },
    "es": {
      "term": "directorio de trabajo actual",
      "def": "La ubicación de la [carpeta](#folder) o [directorio](#directory) en la que opera el programa. Cualquier acción tomada por el programa ocurre en relación con este directorio.\n"
    }
  },
  "data_engineer": {
    "en": {
      "term": "data engineer",
      "def": "Someone who sets up and runs data analyses. Data engineers are often responsible for installing software, managing databases, generating reports, and archiving results.\n"
    },
    "es": {
      "term": "ingeniero/a de datos",
      "def": "Alguien que configura y ejecuta análisis de datos. Los ingenieros de datos suelen ser responsables de instalar software, gestionar bases de datos, generar informes y archivar resultados.\n"
    }
  },
  "data_engineering": {
    "en": {
      "term": "data engineering",
      "def": "The pragmatic steps taken to make data usable, such as writing short programs to put mailing addresses in a uniform format.\n"
    },
    "es": {
      "term": "ingeniería de datos",
      "def": "Los pasos pragmáticos que se toman para que los datos sean utilizables, como escribir programas cortos para poner direcciones en un formato uniforme.\n"
    }
  },
  "data_frame": {
    "en": {
      "term": "data frame",
      "def": "A two-dimensional data structure for storing tabular data in memory. Rows represent [records](#record) and columns represent [variables](#variable_data).\n"
    },
    "es": {
      "term": "marco de datos",
      "def": "Una estructura de datos bi-dimensional para guardar datos tabulares en memoria. Líneas representan [entradas](#record) y columnas representan [variables](#variable_data).\n"
    }
  },
  "data_mining": {
    "en": {
      "term": "data mining",
      "def": "The use of computers to search for patterns in large datasets. The term [data science](#data_science) is now more commonly used.\n"
    },
    "es": {
      "term": "minería de datos",
      "def": "El uso de computadoras para buscar patrones en grandes conjuntos de datos. El término [ciencia de datos](#data_science) se usa ahora con más frecuencia.\n"
    }
  },
  "data_package": {
    "en": {
      "term": "data package",
      "def": "A software package that, mostly, contains only data. Is used to make it simpler to disseminate data for easier use.\n"
    },
    "es": {
      "term": "paquete de datos",
      "def": "Un paquete de software que, en su mayoría, contiene solo datos. Se utiliza para facilitar la difusión de datos para un uso más sencillo.\n"
    }
  },
  "data_science": {
    "en": {
      "term": "data science",
      "def": "The combination of statistics, programming, and hard work used to extract knowledge from data.\n"
    },
    "es": {
      "term": "ciencia de datos",
      "def": "La combinación de estadísticas, programación y trabajo duro que se utiliza para extraer información de los datos.\n"
    }
  },
  "data_scientist": {
    "en": {
      "term": "data scientist",
      "def": "Someone who uses programming skills to solve statistical problems.\n"
    },
    "es": {
      "term": "cientifico/cientifica de datos",
      "def": "Alguien que usa habilidades de programación para resolver problemas de estadísticas.\n"
    }
  },
  "data_structure": {
    "en": {
      "term": "data structure",
      "def": "A format for the organisation, management, and efficient access of data. Typically it will characterise a set of data values and their representation (or [encoding](#character_encoding)), the relationships between values, and ways to access or manipulate those data, such as reading, altering, or writing.\n"
    },
    "es": {
      "term": "estructura de datos",
      "def": "Un formato para la organización, gestión y acceso eficiente a los datos. Normalmente caracteriza un conjunto de valores de datos y su representación (o [codificación](#character_encoding)), las relaciones entre los valores y las formas de acceder o manipular esos datos, como leer, modificar o escribir.\n"
    }
  },
  "data_wrangling": {
    "en": {
      "term": "data wrangling",
      "def": "A colloquial name for small-scale [data engineering](#data_engineering).\n"
    },
    "es": {
      "term": "preparación de datos",
      "def": "Un término coloquial para referirse a la [ingeniería de datos](#data_engineering) a pequeña escala.\n"
    }
  },
  "decision_tree": {
    "en": {
      "term": "decision tree",
      "def": "A tree whose [nodes](#node) are questions and whose [branches](#branch) eventually lead to a decision or [classification](#classification).\n"
    },
    "es": {
      "term": "árbol de decisiones",
      "def": "Un árbol cuyos [nodos](#node) son preguntas y cuyas [ramas](#branch) eventualmente conducen a una decisión o [clasificación](#classification).\n"
    }
  },
  "decorator_pattern": {
    "en": {
      "term": "Decorator pattern",
      "def": "A [design pattern](#design_pattern) in which a function adds additional features to another function or a [class](#class) after its initial definition. Decorators are a feature of [Python](#python) and can be implemented in most other languages as well.\n"
    },
    "es": {
      "term": "patrón decorador",
      "def": "Un [patrón de diseño](#design_pattern) en el cual una función agrega características adicionales a otra función o una [clase](#class) después de su definición inicial. Los decoradores son una característica de [Python](#python) y pueden implementarse en la mayoría de los otros lenguajes también.\n"
    }
  },
  "decrement": {
    "en": {
      "term": "decrement",
      "def": "A unary operation that decreases the value of a variable, usually by 1.\n"
    },
    "es": {
      "term": "decrementar",
      "def": "Una operación unaria que disminuye el valor de una variable, generalmente en 1.\n"
    }
  },
  "deep_learning": {
    "en": {
      "term": "deep learning",
      "def": "A family of [neural network](#neural_network) algorithms that use multiple layers to extract features at successively higher levels.\n"
    },
    "es": {
      "term": "aprendizaje profundo",
      "def": "Una familia de algoritmos de [redes neuronales](#neural_network) que utiliza múltiples capas para extraer características en niveles sucesivamente más altos.\n"
    }
  },
  "default_target": {
    "en": {
      "term": "default target",
      "def": "The [build target](#build_target) that is used when none is specified explicitly.\n"
    },
    "es": {
      "term": "objetivo predeterminado",
      "def": "El [objetivo de compilación](#build_target) que se utiliza cuando no se especifica explícitamente ninguno.\n"
    }
  },
  "default_value": {
    "en": {
      "term": "default value",
      "def": "A value assigned to a function [parameter](#parameter) when the caller does not specify a value. Default values are specified as part of the function's definition.\n"
    },
    "es": {
      "term": "valor predeterminado",
      "def": "Un valor asignado a un [parámetro](#parameter) de una función cuando quien llama no especifica un valor. Los valores predeterminados se especifican como parte de la definición de la función.\n"
    }
  },
  "defensive_programming": {
    "en": {
      "term": "defensive programming",
      "def": "A set of programming practices that assumes mistakes will happen and either reports or corrects them, such as inserting [assertions](#assertion) to report situations that are not ever supposed to occur.\n"
    },
    "es": {
      "term": "programación defensiva",
      "def": "Un conjunto de prácticas de programación que asume que ocurrirán errores y que los reporta o corrige, como insertar [afirmaciones](#assertion) para informar sobre situaciones que no deberían ocurrir nunca.\n"
    }
  },
  "degrees_of_freedom": {
    "en": {
      "term": "degrees of freedom",
      "def": "In statistics, the degrees of freedom (often \"DF\") is a measure of how much independent information, in the form data and calculations, has been combined to produce a given statistical parameter. Put another way, the DF is the number of values that are free to vary in the calculation of a given statistical parameter. For a statistic calculated from data which are indepdendent (i.e., the values are uncorrelated), the DF can be generally estimated as the sample size minus the number of individual parameters calculated to obtain the final statistic.\n"
    },
    "es": {
      "term": "grados de libertad",
      "def": "En estadística, los grados de libertad (a menudo \"DF\") miden cuánta información independiente, en forma de datos y cálculos, se ha combinado para producir un parámetro estadístico. Dicho de otra manera, los grados de libertad representan la cantidad de valores que pueden variar libremente en el cálculo del parámetro. Para estadísticas calculadas a partir de datos independientes (es decir, no correlacionados), los grados de libertad se estiman generalmente como el tamaño de la muestra menos el número de parámetros individuales calculados para obtener la estadística final.\n"
    }
  },
  "delegate_pattern": {
    "en": {
      "term": "Delegate pattern",
      "def": "A [design pattern](#design_pattern) in which an [object](#object) does most of the work to complete a task, but uses one of a set of other objects to complete some specific parts of the work. Delegation is often used instead of inheritance to customize objects' behavior.\n"
    },
    "es": {
      "term": "patrón de delegado",
      "def": "Un [patrón de diseño](#design_pattern) en el que un [objeto](#object) realiza la mayor parte del trabajo para completar una tarea, pero usa uno de un conjunto de otros objetos para completar partes específicas del trabajo. La delegación a menudo se utiliza en lugar de la herencia para personalizar el comportamiento de los objetos.\n"
    }
  },
  "dependency": {
    "en": {
      "term": "dependency",
      "def": "See [prerequisite](#prerequisite).\n"
    },
    "es": {
      "term": "dependencia",
      "def": "Ver [prerrequisito](#prerequisite).\n"
    }
  },
  "dependent_variable": {
    "en": {
      "term": "dependent variable",
      "def": "A variable whose value depends on the value of another variable, which is called the [independent variable](#independent_variable).\n"
    },
    "es": {
      "term": "variable dependiente",
      "def": "Una variable cuyo valor depende del valor de otra variable, llamada [variable independiente](#independent_variable).\n"
    }
  },
  "depth_first": {
    "en": {
      "term": "depth first",
      "def": "To go through a nested data structure such as a [tree](#tree) by going as far as possible down one path, then as far as possible down the next and so on, or to explore a problem by following one solution to its conclusion and then trying the next.\n"
    },
    "es": {
      "term": "búsqueda en profundidad",
      "def": "Recorrer una estructura de datos anidada como un [árbol](#tree) yendo lo más profundo posible en un camino, luego en el siguiente, y así sucesivamente; o explorar un problema siguiendo una solución hasta su conclusión antes de probar otra.\n"
    }
  },
  "design_pattern": {
    "en": {
      "term": "design pattern",
      "def": "A recurring pattern in software design that is specific enough to be worth naming, but not so specific that a single best implementation can be provided by a [library](#library). For example, [data frames](#data_frame) and database [tables](#table) are instances of the same pattern.\n"
    },
    "es": {
      "term": "patrón de diseño",
      "def": "Un patrón recurrente en el diseño de software que es lo suficientemente específico como para merecer un nombre, pero no tanto como para que una única implementación sea la mejor solución ofrecida por una [librería](#library). Por ejemplo, los [data frames](#data_frame) y las [tablas](#table) de bases de datos son instancias del mismo patrón.\n"
    }
  },
  "destructuring_assignment": {
    "en": {
      "term": "destructuring assignment",
      "def": "Unpacking values from data structures and assigning them to multiple variables in a single statement.\n"
    },
    "es": {
      "term": "asignación por desestructuración",
      "def": "Desempaquetar valores de estructuras de datos y asignarlos a múltiples variables en una sola instrucción.\n"
    }
  },
  "dictionary": {
    "en": {
      "term": "dictionary",
      "def": "A data structure that allows items to be looked up by value, sometimes called an [associative array](#associative_array). Dictionaries are often implemented using [hash tables](#hash_table).\n"
    },
    "es": {
      "term": "diccionario",
      "def": "Una estructura de datos que permite buscar elementos por valor, a veces llamada un [arreglo asociativo](#associative_array). Los diccionarios suelen implementarse utilizando [tablas hash](#hash_table).\n"
    }
  },
  "dimension_reduction": {
    "en": {
      "term": "dimension reduction",
      "def": "Reducing the number of dimensions in a dataset, typically by finding the dimensions along which it varies most.\n"
    },
    "es": {
      "term": "reducción de dimensionalidad",
      "def": "Reducir el número de dimensiones en un conjunto de datos, típicamente encontrando aquellas dimensiones en las que más varía.\n"
    }
  },
  "directory": {
    "en": {
      "term": "directory",
      "def": "An item within a [filesystem](#filesystem) that can contain files and other directories. Also known as a [folder](#folder).\n"
    },
    "es": {
      "term": "directorio",
      "def": "Un elemento dentro de un [sistema de archivos](#filesystem) que puede contener archivos y otros directorios. También conocido como una [carpeta](#folder).\n"
    }
  },
  "discrete_random_variable": {
    "en": {
      "term": "discrete random variable",
      "def": "A [variable](#variable_data) whose value can take on only one of a fixed set of values, such as [true](#true) or [false](#false).\n"
    },
    "es": {
      "term": "variable aleatoria discreta",
      "def": "Una [variable](#variable_data) cuyo valor solo puede tomar uno de un conjunto fijo de valores, como [verdadero](#true) o [falso](#false).\n"
    }
  },
  "distro": {
    "en": {
      "term": "distro",
      "def": "See [software distribution](#software_distribution).\n"
    },
    "es": {
      "term": "distro",
      "def": "Ver [distribución de software](#software_distribution).\n"
    }
  },
  "docstring": {
    "en": {
      "term": "docstring",
      "def": "Short for \"documentation string,\" a string appearing at the start of a module, class, or function in [Python](#python) that automatically becomes that object's documentation.\n"
    },
    "es": {
      "term": "docstring",
      "def": "Abreviación de \"cadena de documentación\", una cadena que aparece al inicio de un módulo, clase o función en [Python](#python) y que automáticamente se convierte en la documentación de ese objeto.\n"
    }
  },
  "documentation_generator": {
    "en": {
      "term": "documentation generator",
      "def": "A software tool that extracts specially formatted comments or [docstrings](#docstring) from code and generates cross-referenced developer documentation.\n"
    },
    "es": {
      "term": "generador de documentación",
      "def": "Una herramienta de software que extrae comentarios con formato especial o [docstrings](#docstring) del código y genera documentación para desarrolladores con referencias cruzadas.\n"
    }
  },
  "doi": {
    "en": {
      "term": "Digital Object Identifier",
      "acronym": "DOI",
      "def": "A unique persistent identifier for a book, paper, report, dataset, software release, or other digital artefact.\n"
    },
    "es": {
      "term": "Identificador de Objeto Digital",
      "acronym": "DOI",
      "def": "Un identificador persistente y único para un libro, artículo, informe, conjunto de datos, versión de software u otro artefacto digital.\n"
    }
  },
  "dom": {
    "en": {
      "term": "Document Object Model",
      "acronym": "DOM",
      "def": "A standard, in-memory representation of [HTML](#html) and [XML](#xml). Each [element](#element) is stored as a [node](#node) in a [tree](#tree) with a set of named [attributes](#attribute); contained elements are [child nodes](#child_tree). Modern programming languages provide many [libraries](#library) for searching and modifying the DOM.\n"
    },
    "es": {
      "term": "Modelo de Objetos del Documento",
      "acronym": "DOM",
      "def": "Una representación estándar en memoria de [HTML](#html) y [XML](#xml). Cada [elemento](#element) se almacena como un [nodo](#node) en un [árbol](#tree) con un conjunto de [atributos](#attribute) nombrados; los elementos contenidos son [nodos hijos](#child_tree). Los lenguajes de programación modernos ofrecen muchas [librerías](#library) para buscar y modificar el DOM.\n"
    }
  },
  "dom_selector": {
    "en": {
      "term": "DOM selector",
      "def": "A pattern that identifies [nodes](#node) in a [DOM](#dom) [tree](#tree). For example, `#alpha` matches nodes whose `id` [attribute](#attribute) is \"alpha\", while `.beta` matches nodes whose `class` [attribute](#attribute) is \"beta\".\n"
    },
    "es": {
      "term": "selector DOM",
      "def": "Un patrón que identifica [nodos](#node) en un [árbol](#tree) [DOM](#dom). Por ejemplo, `#alpha` coincide con nodos cuyo [atributo](#attribute) `id` es \"alpha\", mientras que `.beta` coincide con nodos cuyo atributo `class` es \"beta\".\n"
    }
  },
  "domain_knowledge": {
    "en": {
      "term": "domain knowledge",
      "def": "Understanding of a specific problem domain, e.g., knowledge of transportation logistics.\n"
    },
    "es": {
      "term": "conocimiento del dominio",
      "def": "Comprensión de un dominio de problema específico, por ejemplo, conocimientos sobre logística de transporte.\n"
    }
  },
  "double": {
    "en": {
      "term": "double",
      "def": "Short for \"double-precision floating-point number\", meaning a 64-bit numeric value with a fractional part and an exponent.\n"
    },
    "es": {
      "term": "double",
      "def": "Abreviatura de \"número de punto flotante de doble precisión\", que significa un valor numérico de 64 bits con una parte fraccionaria y un exponente.\n"
    }
  },
  "double_square_brackets": {
    "en": {
      "term": "double square brackets",
      "def": "An index enclosed in `[[...]]`, used to return a single value of the underlying type.\n"
    },
    "es": {
      "term": "corchetes dobles",
      "def": "Un índice encerrado en `[[...]]`, utilizado para devolver un solo valor del tipo subyacente.\n"
    }
  },
  "down_vote": {
    "en": {
      "term": "down-vote",
      "def": "A vote against something.\n"
    },
    "es": {
      "term": "voto negativo",
      "def": "Un voto en contra de algo.\n"
    }
  },
  "dry": {
    "en": {
      "term": "Don't Repeat Yourself principle",
      "acronym": "DRY",
      "def": "The Don't Repeat Yourself (DRY) principle states that — Every piece of knowledge must have a single, unambiguous, authoritative representation within a system. The term comes from The Pragmatic Programmer, by Andrew Hunt and David Thomas. Programs that follow the DRY Principle avoid duplication of definitions and logic, so that a change in their behaviour only requires each modification to be made in one part of the code. The goal is to create code that is easier to maintain.\n"
    },
    "es": {
      "term": "principio DRY (Don't Repeat Yourself)",
      "acronym": "DRY",
      "def": "El principio DRY (No te repitas) establece que cada pieza de conocimiento debe tener una única representación clara y autorizada dentro de un sistema. El término proviene del libro 'The Pragmatic Programmer' de Andrew Hunt y David Thomas. Los programas que siguen este principio evitan duplicaciones para que cualquier cambio solo tenga que hacerse en un lugar, facilitando así el mantenimiento del código.\n"
    }
  },
  "dynamic_loading": {
    "en": {
      "term": "dynamic loading",
      "def": "To [import](#import) a [module](#module) into the memory of a program while it is already running. Most [interpreted languages](#interpreted_language) use dynamic loading, and provide tools so that programs can find and load modules dynamically to configure themselves.\n"
    },
    "es": {
      "term": "carga dinámica",
      "def": "Importar un [módulo](#module) en la memoria de un programa mientras ya se está ejecutando. La mayoría de los [lenguajes interpretados](#interpreted_language) utilizan carga dinámica y proporcionan herramientas para encontrar y cargar módulos de forma dinámica.\n"
    }
  },
  "dynamic_lookup": {
    "en": {
      "term": "dynamic lookup",
      "def": "To find a function or a property of an [object](#object) by name while a program is running. For example, instead of getting a specific property of an object using `obj.name`, a program might use `obj[someVariable]`, where `someVariable` could hold `\"name\"` or some other property name.\n"
    },
    "es": {
      "term": "búsqueda dinámica",
      "def": "Encontrar una función o propiedad de un [objeto](#object) por nombre mientras un programa se está ejecutando. Por ejemplo, usar `obj[algunVariable]` en vez de `obj.name`.\n"
    }
  },
  "dynamic_scoping": {
    "en": {
      "term": "dynamic scoping",
      "def": "To find the value of a [variable](#variable_program) by looking at what is on the [call stack](#call_stack) at the moment the lookup is done. Almost all programming languages use [lexical_scoping](#lexical_scoping) instead, since it is more predictable.\n"
    },
    "es": {
      "term": "ámbito dinámico",
      "def": "Encontrar el valor de una [variable](#variable_program) observando la [pila de llamadas](#call_stack) en el momento de la búsqueda. Casi todos los lenguajes usan [ámbito léxico](#lexical_scoping), ya que es más predecible.\n"
    }
  },
  "edge": {
    "en": {
      "term": "edge",
      "def": "A connection between two [nodes](#node) in a [graph](#graph). An edge may have data associated with it, such as a name or distance.\n"
    },
    "es": {
      "term": "arista",
      "def": "Una conexión entre dos [nodos](#node) en un [grafo](#graph). Una arista puede tener datos asociados, como un nombre o una distancia.\n"
    }
  },
  "element": {
    "en": {
      "term": "element",
      "def": "A named component in an [HTML](#html) or [XML](#xml) document. Elements are usually written `<name>`...`</name>`, where \"...\" represents the content of the element. Elements often have [attributes](#attribute).\n"
    },
    "es": {
      "term": "elemento",
      "def": "Un componente nombrado en un documento [HTML](#html) o [XML](#xml). Los elementos se escriben como `<nombre>`...`</nombre>` y pueden tener [atributos](#attribute).\n"
    }
  },
  "emacs": {
    "en": {
      "term": "Emacs (editor)",
      "def": "A text editor that is popular among Unix programmers.\n"
    },
    "es": {
      "term": "Emacs (editor)",
      "def": "Un editor de texto popular entre los programadores de Unix.\n"
    }
  },
  "empty_element": {
    "en": {
      "term": "empty element",
      "def": "An [element](#element) of an [HTML](#html) or [XML](#xml) document that has no [children](#child_tree). Empty elements can always be written as `<name></name>`, but may also be written using the shorthand notation `<name/>` (with a slash after the name inside the angle brackets).\n"
    },
    "es": {
      "term": "elemento vacío",
      "def": "Un [elemento](#element) de un documento [HTML](#html) o [XML](#xml) que no tiene [hijos](#child_tree). Se puede escribir como `<nombre></nombre>` o con la forma abreviada `<nombre/>`.\n"
    }
  },
  "empty_vector": {
    "en": {
      "term": "empty vector",
      "def": "A vector that contains no elements. Empty vectors have a type such as logical or character, and are *not* the same as [null](#null).\n"
    },
    "es": {
      "term": "vector vacío",
      "def": "Un vector que no contiene elementos. Los vectores vacíos tienen un tipo, como lógico o carácter, y *no* son lo mismo que [null](#null).\n"
    }
  },
  "environment": {
    "en": {
      "term": "environment",
      "def": "A structure that stores a set of variable names and the values they refer to.\n"
    },
    "es": {
      "term": "entorno",
      "def": "Una estructura que almacena un conjunto de nombres de variables y los valores a los que se refieren.\n"
    }
  },
  "error_handling": {
    "en": {
      "term": "error handling",
      "def": "What a program does to detect and correct for errors. Examples include printing a message and using a default configuration if the user-specified configuration cannot be found.\n"
    },
    "es": {
      "term": "manejo de errores",
      "def": "Lo que hace un programa para detectar y corregir errores. Ejemplos incluyen imprimir un mensaje y usar una configuración por defecto si no se encuentra la especificada por el usuario.\n"
    }
  },
  "error_test": {
    "en": {
      "term": "error (in a test)",
      "def": "Signalled when something goes wrong in a [unit test](#unit_test) itself rather than in the system being tested. In this case, we do not know anything about the correctness of the system.\n"
    },
    "es": {
      "term": "error (en una prueba)",
      "def": "Señalado cuando algo falla en la propia [prueba unitaria](#unit_test), no en el sistema que se está probando. En este caso, no se puede evaluar la corrección del sistema.\n"
    }
  },
  "escape_sequence": {
    "en": {
      "term": "escape sequence",
      "def": "A sequence of characters added as a prefix to some other character that would otherwise have a special meaning, temporarily altering the meaning of the character. For example, the escape sequence `\\\"` is used to represent a double-quote character inside a double-quoted string.\n"
    },
    "es": {
      "term": "secuencia de escape",
      "def": "Una secuencia de caracteres añadida como prefijo a otro carácter que normalmente tendría un significado especial, alterando temporalmente su significado. Por ejemplo, la secuencia de escape `\\\"` se utiliza para representar una comilla doble dentro de una cadena entre comillas dobles.\n"
    }
  },
  "evaluation": {
    "en": {
      "term": "evaluation",
      "def": "The process of taking an expression such as `1+2*3/4` and turning it into a single, irreducible value.\n"
    },
    "es": {
      "term": "evaluación",
      "def": "El proceso de tomar una expresión como `1+2*3/4` y convertirla en un solo valor irreductible.\n"
    }
  },
  "exception": {
    "en": {
      "term": "exception",
      "def": "An object that stores information about an error or other unusual event in a program. One part of a program will create and [raise an exception](#raise_exception) to signal that something unexpected has happened; another part will [catch](#catch_exception) it.\n"
    },
    "es": {
      "term": "excepción",
      "def": "Un objeto que almacena información sobre un error u otro evento inusual en un programa. Una parte del programa crea y [lanza una excepción](#raise_exception) para señalar que algo inesperado ha ocurrido; otra parte la [captura](#catch_exception).\n"
    }
  },
  "exception_handler": {
    "en": {
      "term": "exception handler",
      "def": "A piece of code that deals with an [exception](#exception) after it is [caught](#catch_exception), e.g., by writing a [log message](#log_message), retrying the operation that failed, or performing an alternate operation.\n"
    },
    "es": {
      "term": "manejador de excepciones",
      "def": "Un fragmento de código que se encarga de una [excepción](#exception) después de ser [capturada](#catch_exception), por ejemplo, escribiendo un [mensaje de registro](#log_message), reintentando la operación que falló o realizando una operación alternativa.\n"
    }
  },
  "expected_result": {
    "en": {
      "term": "expected result (of test)",
      "def": "The value that a piece of software is supposed to produce when tested in a certain way, or the state in which it is supposed to leave the system.\n"
    },
    "es": {
      "term": "resultado esperado (de una prueba)",
      "def": "El valor que se espera que un software produzca al ser probado de cierta manera, o el estado en el que se supone debe dejar el sistema.\n"
    }
  },
  "exploratory_programming": {
    "en": {
      "term": "exploratory programming",
      "def": "A software development methodology in which requirements emerge or change as the software is being written, often in response to results from early runs.\n"
    },
    "es": {
      "term": "programación exploratoria",
      "def": "Un método de desarrollo de software en el cual los requerimientos emergen o cambian a medida que el software es escrito, frecuentemente en respuesta a resultados de corridas previas.\n"
    }
  },
  "export": {
    "en": {
      "term": "export",
      "def": "To make something visible outside a [module](#module) so that other parts of a program can [import](#import) it. In most languages a module must export things explicitly in an attempt to avoid [name collision](#name_collision).\n"
    },
    "es": {
      "term": "exportar",
      "def": "Hacer que algo sea visible fuera de un [módulo](#module) para que otras partes del programa puedan [importarlo](#import). En la mayoría de los lenguajes, un módulo debe exportar elementos explícitamente para evitar [colisiones de nombres](#name_collision).\n"
    }
  },
  "fail_test": {
    "en": {
      "term": "fail (a test)",
      "def": "A test fails if the [actual result](#actual_result) does not match the [expected result](#expected_result).\n"
    },
    "es": {
      "term": "fallar (una prueba)",
      "def": "Una prueba falla si el [resultado real](#actual_result) no coincide con el [resultado esperado](#expected_result).\n"
    }
  },
  "false": {
    "en": {
      "term": "false",
      "def": "The logical ([Boolean](#boolean)) state opposite of \"[true](#true)\". Used in logic and programming to represent a [binary](#binary) state of something.\n"
    },
    "es": {
      "term": "falso",
      "def": "El estado lógico ([Booleano](#boolean)) opuesto a \"[true](#true)\". Se usa en lógica y programación para representar un estado [binario](#binary).\n"
    }
  },
  "falsy": {
    "en": {
      "term": "falsy",
      "def": "Evaluating to [false](#false) in a [Boolean](#boolean) context.\n"
    },
    "es": {
      "term": "falsy",
      "def": "Que se evalúa como [false](#false) en un contexto [Booleano](#boolean).\n"
    }
  },
  "faq": {
    "en": {
      "term": "Frequently Asked Questions",
      "acronym": "FAQ",
      "def": "A curated list of questions commonly asked about a subject, along with answers.\n"
    },
    "es": {
      "term": "Preguntas Frecuentes",
      "acronym": "FAQ",
      "def": "Una lista curada de preguntas comúnmente hechas sobre un tema, junto con sus respuestas.\n"
    }
  },
  "feature_branch": {
    "en": {
      "term": "feature branch",
      "def": "A [branch](#branch) within a [Git](#git) [repository](#repository) containing [commits](#commit) dedicated to a specific feature, e.g., a [bug](#bug) fix or a new function. This branch can be merged into another branch.\n"
    },
    "es": {
      "term": "rama de funcionalidad",
      "def": "Una [rama](#branch) dentro de un [repositorio](#repository) de [Git](#git) que contiene [commits](#commit) dedicados a una funcionalidad específica, por ejemplo, una corrección de [bug](#bug) o una nueva función. Esta rama puede fusionarse con otra.\n"
    }
  },
  "feature_data": {
    "en": {
      "term": "feature (in data)",
      "def": "A variable or observable in a dataset.\n"
    },
    "es": {
      "term": "característica (en datos)",
      "def": "Una variable u observable en un conjunto de datos.\n"
    }
  },
  "feature_engineering": {
    "en": {
      "term": "feature engineering",
      "def": "The process of choosing the variables to be used as inputs to a [model](#model). Choosing good features often depends on [domain knowledge](#domain_knowledge).\n"
    },
    "es": {
      "term": "ingeniería de características",
      "def": "El proceso de elegir las variables que se usarán como entrada para un [modelo](#model). Elegir buenas características a menudo depende del [conocimiento del dominio](#domain_knowledge).\n"
    }
  },
  "feature_request": {
    "en": {
      "term": "feature request",
      "def": "A request to the maintainers or developers of a software program to add a specific functionality (a feature) to that program.\n"
    },
    "es": {
      "term": "solicitud de funcionalidad",
      "def": "Una solicitud a los responsables o desarrolladores de un programa para añadir una funcionalidad específica al software.\n"
    }
  },
  "feature_software": {
    "en": {
      "term": "feature (in software)",
      "def": "Some aspect of software that was deliberately designed or built. A [bug](#bug) is an undesired feature.\n"
    },
    "es": {
      "term": "característica (en software)",
      "def": "Un aspecto del software que fue diseñado o construido deliberadamente. Un [bug](#bug) es una característica no deseada.\n"
    }
  },
  "field": {
    "en": {
      "term": "field",
      "def": "A component of a [record](#record) containing a single value. Every record in a [tibble](#tibble) or database [table](#table) has the same fields.\n"
    },
    "es": {
      "term": "campo",
      "def": "Un componente de un [registro](#record) que contiene un solo valor. Cada registro en un [tibble](#tibble) o [tabla](#table) de base de datos tiene los mismos campos.\n"
    }
  },
  "filename_extension": {
    "en": {
      "term": "filename extension",
      "def": "The last part of a filename, usually following the '.' symbol. Filename extensions are commonly used to indicate the type of content in the file, though there is no guarantee that this is correct.\n"
    },
    "es": {
      "term": "extensión de archivo",
      "def": "La última parte de un nombre de archivo, usualmente después del símbolo '.'. Las extensiones se usan comúnmente para indicar el tipo de contenido, aunque no siempre es confiable.\n"
    }
  },
  "filename_stem": {
    "en": {
      "term": "filename stem",
      "def": "The part of the filename that does not include the [extension](#filename_extension). For example, the stem of `glossary.yml` is `glossary`.\n"
    },
    "es": {
      "term": "raíz del nombre de archivo",
      "def": "La parte del nombre del archivo que no incluye la [extensión](#filename_extension). Por ejemplo, la raíz de `glossary.yml` es `glossary`.\n"
    }
  },
  "filesystem": {
    "en": {
      "term": "filesystem",
      "def": "The part of the [operating system](#operating_system) that manages how files are stored and retrieved. Also used to refer to all of those files and [directories](#directory) or the specific way they are stored (as in \"the Unix filesystem\").\n"
    },
    "es": {
      "term": "sistema de archivos",
      "def": "La parte del sistema operativo que administra cómo se almacenan y recuperan los archivos. También se usa para referirse a todos esos archivos y directorios o a la forma específica en que se almacenan (como en \"el sistema de archivos Unix\").\n"
    }
  },
  "filter": {
    "en": {
      "term": "filter",
      "def": "As a verb, to choose a set of [records](#record) (i.e., rows of a table) based on the values they contain. As a noun, a command-line program that reads lines of text from files or [standard input](#stdin), performs some operation on them (such as filtering), and writes to a file or [stdout](#stdout).\n"
    },
    "es": {
      "term": "filtro",
      "def": "Como verbo, seleccionar un conjunto de [registros](#record) (es decir, filas de una tabla) según los valores que contienen. Como sustantivo, un programa de línea de comandos que lee líneas de texto de archivos o de la [entrada estándar](#stdin), realiza alguna operación sobre ellas (como filtrar) y escribe en un archivo o en la [salida estándar](#stdout).\n"
    }
  },
  "fixture": {
    "en": {
      "term": "fixture",
      "def": "The thing on which a test is run, such as the [parameters](#parameter) to the function being tested or the file being processed.\n"
    },
    "es": {
      "term": "fixture",
      "def": "El objeto sobre el cual se ejecuta una prueba, como los [parámetros](#parameter) de la función que se está probando o el archivo que se está procesando.\n"
    }
  },
  "folder": {
    "en": {
      "term": "folder",
      "def": "Another term for a [directory](#directory).\n"
    },
    "es": {
      "term": "carpeta",
      "def": "Otro término para hacer referencia a un [directorio](#directory).\n"
    }
  },
  "for_loop": {
    "en": {
      "term": "for loop",
      "def": "A construct in a program that repeats one or more other statements (the [loop body](#loop_body)) once for each item in a sequence, such as each number in a range or each element of a list.\n"
    },
    "es": {
      "term": "bucle for",
      "def": "Una estructura en un programa que repite una o más instrucciones (el [cuerpo del bucle](#loop_body)) una vez por cada elemento de una secuencia, como cada número en un rango o cada elemento de una lista.\n"
    }
  },
  "fork": {
    "en": {
      "term": "fork",
      "def": "A copy of one person's [Git](#git) [repository](#repository) that lives in another person's GitHub account. Changes to the content of a fork can be submitted to the [upstream repository](#upstream_repository) via a [pull request](#pull_request).\n"
    },
    "es": {
      "term": "fork",
      "def": "Una copia del [repositorio](#repository) de [Git](#git) de una persona que reside en la cuenta de GitHub de otra persona. Los cambios en el contenido de un fork pueden enviarse al [repositorio original](#upstream_repository) mediante una [solicitud de extracción](#pull_request).\n"
    }
  },
  "full_identifier_git": {
    "en": {
      "term": "full identifier (of a commit)",
      "def": "A unique 160-bit identifier for a [commit](#commit) in a [Git](#git) [repository](#repository), usually written as a 20-character [hexadecimal](#hexadecimal) character [string](#string).\n"
    },
    "es": {
      "term": "identificador completo (de un commit)",
      "def": "Un identificador único de 160 bits para un [commit](#commit) en un [repositorio](#repository) de [Git](#git), usualmente escrito como una [cadena](#string) de 20 caracteres [hexadecimales](#hexadecimal).\n"
    }
  },
  "full_join": {
    "en": {
      "term": "full join",
      "def": "A [join](#join) that returns all rows and all columns from two tables A and B. Where the [keys](#key) of A and B match, values are combined; where they do not, missing values from either table are filled with [null](#null), [NA](#na), or some other [missing value](#missing_value) signifier.\n"
    },
    "es": {
      "term": "unión completa",
      "def": "Un [join](#join) que devuelve todas las filas y todas las columnas de dos tablas A y B. Donde las [claves](#key) de A y B coinciden, los valores se combinan; donde no lo hacen, los valores faltantes se rellenan con [null](#null), [NA](#na) u otro indicador de [valor ausente](#missing_value).\n"
    }
  },
  "fully_qualified_name": {
    "en": {
      "term": "fully-qualified name",
      "def": "An unambiguous name of the form `package::thing`, indicating the original source of the [object](#object) in question.\n"
    },
    "es": {
      "term": "nombre completamente calificado",
      "def": "Un nombre inequívoco con la forma `paquete::objeto`, que indica la fuente original del [objeto](#object) en cuestión.\n"
    }
  },
  "function": {
    "en": {
      "term": "function",
      "def": "A code block which gathers a sequence of operations into a whole, preserving it for ongoing use by defining a set of tasks that takes zero or more required and optional arguments as inputs and returns expected outputs (return values), if any. Functions enable repeating these defined tasks with one command, known as a function call.\n"
    },
    "es": {
      "term": "función",
      "def": "Un bloque de código que reúne una secuencia de operaciones en un todo, preservándolo para su uso continuo al definir un conjunto de tareas que reciben cero o más argumentos requeridos u opcionales como entrada y devuelven los resultados esperados (valores de retorno), si los hay. Las funciones permiten repetir estas tareas definidas con un solo comando, conocido como llamada a función.\n"
    }
  },
  "functional_programming": {
    "en": {
      "term": "functional programming",
      "def": "A style of programming in which data is transformed through successive application of functions, rather than by using control structures such as loops. In functional programming, there must be a direct relationship between the input to a function and the output produced by the function, meaning the result should not be affected by the current values of global variables or other parts of the [global program state](#global_environment). It also requires that functions do not produce [side effects](#side_effect), meaning they do not modify the global program state, or do anything other than computing the return value, such as writing output to a [log](#log) file, or printing to the [console](#console).\n"
    },
    "es": {
      "term": "programación funcional",
      "def": "Un estilo de programación en el que los datos se transforman mediante la aplicación sucesiva de funciones, en lugar de utilizar estructuras de control como bucles. En la programación funcional, debe existir una relación directa entre la entrada y la salida de una función, lo que significa que el resultado no debe depender de variables globales ni de otras partes del [estado global del programa](#global_environment). También se requiere que las funciones no produzcan [efectos secundarios](#side_effect), es decir, que no modifiquen el estado global ni realicen acciones como escribir en un [log](#log) o imprimir en la [consola](#console).\n"
    }
  },
  "generator_function": {
    "en": {
      "term": "generator function",
      "def": "A function whose state is automatically saved when it returns a value so that execution can be restarted from that point the next time it is called. One example of generator functions use is to produce streams of values that can be processed by [for loops](#for_loop).\n"
    },
    "es": {
      "term": "función generadora",
      "def": "Una función cuyo estado se guarda automáticamente cuando devuelve un valor, de modo que la ejecución pueda reanudarse desde ese punto la próxima vez que se llame. Un ejemplo del uso de funciones generadoras es la producción de secuencias de valores que pueden ser procesadas por [bucles for](#for_loop).\n"
    }
  },
  "generic_function": {
    "en": {
      "term": "generic function",
      "def": "A collection of functions with similar purpose, each operating on a different class of data.\n"
    },
    "es": {
      "term": "función genérica",
      "def": "Un conjunto de funciones con propósitos similares, cada una operando en una clase diferente de datos.\n"
    }
  },
  "geometric_mean": {
    "en": {
      "term": "Geometric Mean",
      "def": "Calculated from a set of n numbers by first computing the product of those numbers, and then computing the n-th [root](#root_math) of the result. In contrast to the [arithmetic mean](#arithmetic_mean), which measures central tendancy in an \"additive\" way, the geometric mean measures central tendancy in a \"multiplicative\" way, and hence is often appropriate when estimating an average rates of change or some other multiplicative constant.\n"
    },
    "es": {
      "term": "media geométrica",
      "def": "Calculada a partir de un conjunto de n números, primero computando el producto de esos números y luego sacando la [raíz](#root_math) n-ésima del resultado. En contraste con la [media aritmética](#arithmetic_mean), que mide la tendencia central de manera \"aditiva\", la media geométrica lo hace de manera \"multiplicativa\" y, por lo tanto, es útil para estimar tasas promedio de cambio u otras constantes multiplicativas.\n"
    }
  },
  "ggplot2": {
    "en": {
      "term": "ggplot2",
      "def": "A [package](#package) in [R](#r_language) that implements a layered grammar of graphics for generating plots. It is a popular alternative to plotting with [base R](#base_r) and part of the [tidyverse](#tidyverse).\n"
    },
    "es": {
      "term": "ggplot2",
      "def": "Un [paquete](#package) en [R](#r_language) que implementa una gramática de gráficos por capas para generar visualizaciones. Es una alternativa popular a la visualización con [base R](#base_r) y parte del [tidyverse](#tidyverse).\n"
    }
  },
  "git": {
    "en": {
      "term": "Git",
      "def": "A [version control tool](#version_control_system) to record and manage changes to a project.\n"
    },
    "es": {
      "term": "Git",
      "def": "Una [herramienta de control de versiones](#version_control_system) para registrar y gestionar cambios en un proyecto.\n"
    }
  },
  "git_branch": {
    "en": {
      "term": "Git branch",
      "def": "A snapshot of a version of a [Git](#git) [repository](#repository). Multiple branches can capture multiple versions of the same repository.\n"
    },
    "es": {
      "term": "rama de Git",
      "def": "Una instantánea de una versión de un [repositorio](#repository) de [Git](#git). Varias ramas pueden capturar diferentes versiones del mismo repositorio.\n"
    }
  },
  "git_clone": {
    "en": {
      "term": "Git clone",
      "def": "Copies (and usually downloads) of a [Git](#git) [remote repository](#remote_repository) on a local computer.\n"
    },
    "es": {
      "term": "clon de Git",
      "def": "Copias (normalmente descargadas) de un [repositorio remoto](#remote_repository) de [Git](#git) en una computadora local.\n"
    }
  },
  "git_conflict": {
    "en": {
      "term": "Git conflict",
      "def": "A situation in which incompatible or overlapping changes have been made on different [branches](#branch) that are now being [merged](#git_merge).\n"
    },
    "es": {
      "term": "conflicto de Git",
      "def": "Una situación en la que se han realizado cambios incompatibles o superpuestos en diferentes [ramas](#branch) que ahora se están [fusionando](#git_merge).\n"
    }
  },
  "git_fork": {
    "en": {
      "term": "Git fork",
      "def": "To make a new copy of a [Git](#git) [repository](#repository) on a [server](#server), or the copy that is made.\n"
    },
    "es": {
      "term": "fork de Git",
      "def": "Hacer una nueva copia de un [repositorio](#repository) de [Git](#git) en un [servidor](#server), o la copia que se ha hecho.\n"
    }
  },
  "git_merge": {
    "en": {
      "term": "Git merge",
      "def": "Merging branches in [Git](#git) incorporates development histories of two [branches](#branch) in one. If changes are made to similar parts of the branches on both branches, a [conflict](#git_conflict) will occur and this must be resolved before the merge will be completed.\n"
    },
    "es": {
      "term": "fusión en Git",
      "def": "La fusión de ramas en [Git](#git) incorpora los historiales de desarrollo de dos [ramas](#branch) en una sola. Si se hacen cambios en las mismas partes en ambas ramas, ocurrirá un [conflicto](#git_conflict) que debe resolverse antes de completar la fusión.\n"
    }
  },
  "git_pull": {
    "en": {
      "term": "Git pull",
      "def": "Downloads and synchronizes changes between a [remote repository](#remote_repository) and a local [repository](#repository).\n"
    },
    "es": {
      "term": "git pull",
      "def": "Descarga y sincroniza los cambios entre un [repositorio remoto](#remote_repository) y un [repositorio](#repository) local.\n"
    }
  },
  "git_push": {
    "en": {
      "term": "Git push",
      "def": "Uploads and synchronizes changes between a local [repository](#repository) and a [remote repository](#remote_repository).\n"
    },
    "es": {
      "term": "git push",
      "def": "Sube y sincroniza los cambios entre un [repositorio](#repository) local y un [repositorio remoto](#remote_repository).\n"
    }
  },
  "git_remote": {
    "en": {
      "term": "Git remote",
      "def": "A short name for a [remote repository](#remote_repository) (like a bookmark).\n"
    },
    "es": {
      "term": "remoto de Git",
      "def": "Un nombre corto para un [repositorio remoto](#remote_repository) (como un marcador o alias).\n"
    }
  },
  "github": {
    "en": {
      "term": "GitHub",
      "def": "A cloud-based platform built around [Git](#git) that allows you to save versions of your project online and collaborate with other Git users.\n"
    },
    "es": {
      "term": "GitHub",
      "def": "Una plataforma basada en la nube construida alrededor de [Git](#git) que permite guardar versiones de tu proyecto en línea y colaborar con otros usuarios de Git.\n"
    }
  },
  "global_environment": {
    "en": {
      "term": "global environment",
      "def": "The [environment](#environment) that holds top-level definitions in a programming language, e.g., those written directly in the interpreter.\n"
    },
    "es": {
      "term": "entorno global",
      "def": "El [entorno](#environment) que contiene las definiciones de nivel superior en un lenguaje de programación, por ejemplo, las escritas directamente en el intérprete.\n"
    }
  },
  "global_installation": {
    "en": {
      "term": "global installation",
      "def": "Installing a package in a location where it can be accessed by all users and projects.\n"
    },
    "es": {
      "term": "instalación global",
      "def": "El acto de instalar un paquete en una ubicación donde pueda ser accedido por todas las usuarias y proyectos.\n"
    }
  },
  "global_variable": {
    "en": {
      "term": "global variable",
      "def": "A variable defined outside any particular function or [package](#package) namespace, which is therefore visible to all functions.\n"
    },
    "es": {
      "term": "variable global",
      "def": "Una variable definida fuera de alguna función en particular, por lo que es visible para todas las funciones.\n"
    }
  },
  "globbing": {
    "en": {
      "term": "globbing",
      "def": "To specify a set of filenames using a simplified form of [regular expressions](#regular_expression), such as `*.dat` to mean \"all files whose names end in `.dat`\". The name is derived from \"global\".\n"
    },
    "es": {
      "term": "globbing",
      "def": "Especificar un conjunto de nombres de archivo utilizando una forma simplificada de [expresiones regulares](#regular_expression), como `*.dat` para indicar \"todos los archivos cuyos nombres terminan en `.dat`\". El nombre proviene de \"global\".\n"
    }
  },
  "gnu": {
    "en": {
      "term": "GNU Operating System",
      "acronym": "GNU",
      "def": "\"GNU\" is an [operating system](#operating_system) that is free software. GNU is a recursive acronym for \"GNU is Not Unix!\". The GNU operating system consists of GNU [packages](#package) as well as free software realeased by third parties.\n"
    },
    "es": {
      "term": "Sistema Operativo GNU",
      "acronym": "GNU",
      "def": "\"GNU\" es un [sistema operativo](#operating_system) de software libre. GNU es un acrónimo recursivo de \"GNU's Not Unix!\". El sistema operativo GNU consiste en [paquetes](#package) GNU, así como software libre publicado por terceros.\n"
    }
  },
  "gpl": {
    "en": {
      "term": "GNU Public License",
      "acronym": "GPL",
      "def": "A [license](#license) that allows people to re-use software as long as they distribute the source of their changes.\n"
    },
    "es": {
      "term": "Licencia Pública GNU",
      "acronym": "GPL",
      "def": "Una [licencia](#license) que permite a las personas reutilizar software siempre que distribuyan el código fuente de sus modificaciones.\n"
    }
  },
  "gradient_boosting": {
    "en": {
      "term": "gradient boosting",
      "def": "A [machine learning](#machine_learning) technique that produces an ensemble of weak prediction models (typically [decision trees](#decision_tree)) in a stepwise fashion.\n"
    },
    "es": {
      "term": "impulso por gradiente",
      "def": "Una técnica de [aprendizaje automático](#machine_learning) que produce un conjunto de modelos de predicción débiles (normalmente [árboles de decisión](#decision_tree)) de forma iterativa.\n"
    }
  },
  "gradient_descent": {
    "en": {
      "term": "gradient descent",
      "def": "An optimization algorithm that repeatedly calculates the gradient at the current point takes a small step in the direction in which the gradient is decreasing, and then recalculates the gradient.\n"
    },
    "es": {
      "term": "descenso por gradiente",
      "def": "Un algoritmo de optimización que calcula repetidamente el gradiente en el punto actual, da un pequeño paso en la dirección en la que el gradiente disminuye y luego vuelve a calcular el gradiente.\n"
    }
  },
  "graph": {
    "en": {
      "term": "graph",
      "def": "1. A plot or a chart that displays data, or 2. a data structure in which [nodes](#node) are connected to one another by [edges](#edge).\n"
    },
    "es": {
      "term": "gráfico / grafo",
      "def": "1. Una visualización o diagrama que muestra datos, o 2. una estructura de datos en la que los [nodos](#node) están conectados entre sí por [aristas](#edge).\n"
    }
  },
  "group": {
    "en": {
      "term": "group",
      "def": "To divide data into subsets according to a set of criteria while leaving records in a single structure.\n"
    },
    "es": {
      "term": "agrupar",
      "def": "Dividir datos en subconjuntos según un conjunto de criterios, manteniendo los registros dentro de una sola estructura.\n"
    }
  },
  "gui": {
    "en": {
      "term": "graphical user interface",
      "acronym": "GUI",
      "def": "A user interface that relies on windows, menus, pointers, and other graphical elements, as opposed to a [command-line interface](#cli) or voice-driven interface.\n"
    },
    "es": {
      "term": "interfaz gráfica de usuario",
      "acronym": "GUI",
      "def": "Una interfaz de usuario que utiliza ventanas, menús, punteros y otros elementos gráficos, a diferencia de una [interfaz de línea de comandos](#cli) o una interfaz por voz.\n"
    }
  },
  "handle_condition": {
    "en": {
      "term": "handle (condition)",
      "def": "To accept responsibility for handling an error or other unexpected event. [R](#r_language) prefers \"handling a condition\" to \"[catching an exception](catch_exception)\". [Python](#python), on the other hand, encourages raising and catching exceptions, and in some situations, requires it.\n"
    },
    "es": {
      "term": "manejar (una condición)",
      "def": "Aceptar la responsabilidad de manejar un error u otro evento inesperado. [R](#r_language) prefiere \"manejar una condición\" en lugar de \"[capturar una excepción](catch_exception)\". [Python](#python), por otro lado, promueve lanzar y capturar excepciones, y en algunas situaciones, lo requiere.\n"
    }
  },
  "hardware": {
    "en": {
      "term": "hardware",
      "acronym": "HW",
      "def": "Any physical component of a computer system. Hardware can be internal, such as CPU, memory, and graphics cards; or external, such as monitors and keyboards. Hardware operates in conjunction with software to produce a functioning computer system.\n"
    },
    "es": {
      "term": "hardware",
      "acronym": "HW",
      "def": "Cualquier componente físico de un sistema informático. El hardware puede ser interno, como la CPU, la memoria y las tarjetas gráficas; o externo, como los monitores y teclados. El hardware funciona junto con el software para producir un sistema informático operativo.\n"
    }
  },
  "harmonic_mean": {
    "en": {
      "term": "Harmonic Mean",
      "def": "Calculated from a set of n numbers by first computing the sum of the [reciprocals](#reciprocal) of those numbers, and then dividing n by the resulting sum. Alternatively, it can be computed as the [reciprocal](#reciprocal) of the [arithmetic mean](#arithmetic_mean) of the [reciprocal](#reciprocal) values. Similarly to the [geometric mean](#geometric_mean), the harmonic mean is often used as an alternative measure of central tendancy to the usual [arithmetic mean](#arithmetic_mean) when estimating an average rates of change or some other multiplicative constant.\n"
    },
    "es": {
      "term": "media armónica",
      "def": "Se calcula a partir de un conjunto de n números sumando primero los [recíprocos](#reciprocal) de esos números y luego dividiendo n por dicha suma. También puede calcularse como el [recíproco](#reciprocal) de la [media aritmética](#arithmetic_mean) de los valores recíprocos. Al igual que la [media geométrica](#geometric_mean), la media armónica se usa como una medida alternativa de la tendencia central cuando se estiman tasas promedio de cambio u otras constantes multiplicativas.\n"
    }
  },
  "hash_function": {
    "en": {
      "term": "hash function",
      "def": "A function that turns arbitrary data into a bit array, or a [key](#key), of a fixed size. Hash functions are used to determine where data should be stored in a [hash table](#hash_table).\n"
    },
    "es": {
      "term": "función hash",
      "def": "Una función que transforma datos arbitrarios en una matriz de bits o una [clave](#key) de tamaño fijo. Las funciones hash se utilizan para determinar dónde almacenar datos en una [tabla hash](#hash_table).\n"
    }
  },
  "hash_table": {
    "en": {
      "term": "hash table",
      "def": "A data structure that calculates a pseudo-random key (location) for each value passed to it and stores the value in that location. Hash tables enable fast lookup for arbitrary data. This occurs at the cost of extra memory because hash tables must always be larger than the amount of information they need to store, to avoid the possibility of data collisions, when the hash function returns the same key for two different values.\n"
    },
    "es": {
      "term": "tabla hash",
      "def": "Una estructura de datos que calcula una clave pseudoaleatoria (ubicación) para cada valor que recibe y almacena el valor en esa ubicación. Las tablas hash permiten una búsqueda rápida de datos arbitrarios, a costa de usar memoria adicional para evitar colisiones de datos (cuando dos valores distintos generan la misma clave).\n"
    }
  },
  "header_row": {
    "en": {
      "term": "header row",
      "def": "If present, the first row of a data file that defines column names (but not their data types or units).\n"
    },
    "es": {
      "term": "fila de encabezado",
      "def": "Si está presente, la primera fila de un archivo de datos que define los nombres de las columnas (pero no sus tipos de datos ni unidades).\n"
    }
  },
  "heterogeneous": {
    "en": {
      "term": "heterogeneous",
      "def": "Containing mixed data types. For example, in [Python](#python) and [R](#r_language), a [list](#list) can contain a mix of numbers, character strings, and values of other types.\n"
    },
    "es": {
      "term": "heterogéneo",
      "def": "Contiene tipos de datos mezclados. Por ejemplo, en [Python](#python) y [R](#r_language), una [lista](#list) puede contener una mezcla de números, cadenas de texto y otros tipos de valores.\n"
    }
  },
  "hexadecimal": {
    "en": {
      "term": "hexadecimal",
      "def": "A base-16 number system. Hexadecimal values are usually written using the digits 0-9 and the characters A-F in either upper or lower case. Hexadecimal is often used to represent [binary](#binary) values, since two hexadecimal digits use exactly one byte of storage.\n"
    },
    "es": {
      "term": "hexadecimal",
      "def": "Un sistema numérico de base 16. Los valores hexadecimales normalmente se escriben con los dígitos del 0 al 9 y las letras A-F en mayúsculas o minúsculas. El sistema hexadecimal se usa comúnmente para representar valores [binarios](#binary), ya que dos dígitos hexadecimales ocupan exactamente un byte de almacenamiento.\n"
    }
  },
  "higher_order_function": {
    "en": {
      "term": "higher-order function",
      "def": "A function that operates on other functions. For example, the higher-order function `map` executes a given function once on each value in a [list](#list). Higher-order functions are heavily used in [functional programming](#functional_programming).\n"
    },
    "es": {
      "term": "función de orden superior",
      "def": "Una función que opera sobre otras funciones. Por ejemplo, la función de orden superior `map` ejecuta una función dada una vez por cada valor en una [lista](#list). Estas funciones se usan frecuentemente en la [programación funcional](#functional_programming).\n"
    }
  },
  "hippocratic_license": {
    "en": {
      "term": "Hippocratic License",
      "def": "An ethical software [license](#license) that allows free use for any purpose that does not contravene the Universal Declaration of Human Rights.\n"
    },
    "es": {
      "term": "Licencia Hipocrática",
      "def": "Una [licencia](#license) de software ética que permite su uso libre para cualquier propósito que no contravenga la Declaración Universal de los Derechos Humanos.\n"
    }
  },
  "histogram": {
    "en": {
      "term": "histogram",
      "def": "A graphical representation of the distribution of a set of numeric data, usually a vertical bar graph.\n"
    },
    "es": {
      "term": "histograma",
      "def": "Una representación gráfica de la distribución de un conjunto de datos numéricos, normalmente como un gráfico de barras verticales.\n"
    }
  },
  "hitchhiker": {
    "en": {
      "term": "hitchhiker",
      "def": "Someone who is part of a project but does not actually do any work on it.\n"
    },
    "es": {
      "term": "polizón",
      "def": "Alguien que forma parte de un proyecto pero que en realidad no hace ningún trabajo en él.\n"
    }
  },
  "home_directory": {
    "en": {
      "term": "home directory",
      "def": "A directory that contains a user's files. Each user on a multi-user computer will have their own home directory; a personal computer will often only have one home directory.\n"
    },
    "es": {
      "term": "directorio personal",
      "def": "Un directorio que contiene los archivos de un usuario. En un sistema multiusuario, cada persona tiene su propio directorio personal; en un ordenador personal normalmente solo hay uno.\n"
    }
  },
  "homogeneous": {
    "en": {
      "term": "homogeneous",
      "def": "Containing a single data type. For example, a [vector](#vector) must be homogeneous: its values must all be numeric, logical, etc.\n"
    },
    "es": {
      "term": "homogéneo",
      "def": "Que contiene un solo tipo de datos. Por ejemplo, un [vector](#vector) debe ser homogéneo: todos sus valores deben ser numéricos, lógicos, etc.\n"
    }
  },
  "html": {
    "en": {
      "term": "HyperText Markup Language",
      "acronym": "HTML",
      "def": "The standard [markup language](#markup_language) used for web pages. HTML is represented in memory using [DOM](#dom) (Digital Object Model).\n"
    },
    "es": {
      "term": "Lenguaje de Marcado de Hipertexto",
      "acronym": "HTML",
      "def": "El [lenguaje de marcado](#markup_language) estándar utilizado para páginas web. HTML se representa en la memoria mediante el [DOM](#dom) (Modelo de Objetos del Documento).\n"
    }
  },
  "http": {
    "en": {
      "term": "HyperText Transfer Protocol",
      "acronym": "HTTP",
      "def": "The standard [protocol](#protocol) for data transfer on the World-Wide Web. HTTP defines the format of [requests](#http_request) and [responses](#http_response), the meanings of standard error codes, and other features.\n"
    },
    "es": {
      "term": "Protocolo de Transferencia de Hipertexto",
      "acronym": "HTTP",
      "def": "El [protocolo](#protocol) estándar para la transferencia de datos en la Web. HTTP define el formato de las [solicitudes](#http_request) y [respuestas](#http_response), el significado de los códigos de error estándar y otras características.\n"
    }
  },
  "http_header": {
    "en": {
      "term": "HTTP header",
      "def": "A key-value pair at the top of an [HTTP](#http) [request](#http_request) or [response](#http_response) that carries additional information such as the user's preferred language or the length of the data being transferred.\n"
    },
    "es": {
      "term": "encabezado HTTP",
      "def": "Un par clave-valor en la parte superior de una [solicitud](#http_request) o [respuesta](#http_response) [HTTP](#http) que contiene información adicional como el idioma preferido del usuario o la longitud de los datos transferidos.\n"
    }
  },
  "http_request": {
    "en": {
      "term": "HTTP request",
      "def": "A message sent from a [client](#client) to a [server](#server) using the [HTTP](#http) [protocol](#protocol) asking for data. A request usually asks for a web page, image, or other data.\n"
    },
    "es": {
      "term": "solicitud HTTP",
      "def": "Un mensaje enviado desde un [cliente](#client) a un [servidor](#server) utilizando el [protocolo HTTP](#http), solicitando datos. Normalmente, se pide una página web, imagen u otro tipo de información.\n"
    }
  },
  "http_response": {
    "en": {
      "term": "HTTP response",
      "def": "A reply sent from a [server](#server) to a [client](#client) using the [HTTP](#http) [protocol](#protocol) in response to a [request](#http_request). The response usually contains a web page, image, or data.\n"
    },
    "es": {
      "term": "respuesta HTTP",
      "def": "Una respuesta enviada desde un [servidor](#server) a un [cliente](#client) usando el [protocolo HTTP](#http) como respuesta a una [solicitud](#http_request). La respuesta suele contener una página web, imagen o datos.\n"
    }
  },
  "ide": {
    "en": {
      "term": "Integrated Development Environment",
      "acronym": "IDE",
      "def": "An application that helps programmers develop software. IDEs typically have a built-in editor, a [console](#console) to execute code immediately, and browsers for exploring data structures in memory and files on disk.\n"
    },
    "es": {
      "term": "Entorno de Desarrollo Integrado",
      "acronym": "EDI",
      "def": "Una aplicación que ayuda a programadores a desarrollar software. Los EDI usualmente tiene un editor incorporado, una consola que ejecuta el código inmediatamente y navegadores para explorar estructuras de datos en la memoria y archivos en el disco.\n"
    }
  },
  "import": {
    "en": {
      "term": "import",
      "def": "To bring things from a [module](#module) into a program for use. In most languages a program can only import things that the module explicitly [exports](#export).\n"
    },
    "es": {
      "term": "importar",
      "def": "traer cosas de un [módulo](#module) para incorporarlas al programa. En la mayoría de las lenguajes, un programa solo puede importar cosas que el módulo [exporta](#export) explícitamente.\n"
    }
  },
  "impostor_syndrome": {
    "en": {
      "term": "impostor syndrome",
      "def": "The [false](#false) belief that one's successes are a result of accident or luck rather than ability.\n"
    },
    "es": {
      "term": "síndrome del impostor",
      "def": "La creencia [falsa](#false) de que los propios logros son resultado del azar o la suerte en lugar de la habilidad.\n"
    }
  },
  "in_place_operator": {
    "en": {
      "term": "in-place operator",
      "def": "An operator that updates one of its operands. For example, the expression `x += 2` uses the in-place operator `+=` to add 2 to the current value of `x` and assign the result back to `x`.\n"
    },
    "es": {
      "term": "operador in-place",
      "def": "Un operador que actualiza uno de sus operandos. Por ejemplo, la expresión `x += 2` usa el operador in-place `+=` para sumar 2 al valor actual de `x` y asignar el resultado de nuevo a `x`.\n"
    }
  },
  "increment": {
    "en": {
      "term": "increment",
      "def": "A unary operation that increases the value of a variable, usually by 1.\n"
    },
    "es": {
      "term": "incrementar",
      "def": "Una operación unaria que aumenta el valor de una variable, generalmente en 1.\n"
    }
  },
  "independent_variable": {
    "en": {
      "term": "independent variable",
      "def": "The factor that you purposely change or control in order to see what effect it has on the [dependent variable](#dependent_variable).\n"
    },
    "es": {
      "term": "variable independiente",
      "def": "El factor que cambias o controlas intencionalmente para ver qué efecto tiene sobre la [variable dependiente](#dependent_variable).\n"
    }
  },
  "infinite_loop": {
    "en": {
      "term": "infinite loop",
      "def": "A loop where the exit condition is never met, so the loop continues to repeat itself. Often a programming error.\n"
    },
    "es": {
      "term": "bucle infinito",
      "def": "Un bucle cuya condición de salida nunca se cumple, por lo que se repite indefinidamente. A menudo es un error de programación.\n"
    }
  },
  "inner_join": {
    "en": {
      "term": "inner join",
      "def": "A [join](#join) that returns the combination of rows from two tables, A and B, whose [keys](#key) exist in both tables.\n"
    },
    "es": {
      "term": "inner join",
      "def": "Una operación de [unión](#join) que devuelve la combinación de filas de dos tablas, A y B, cuyos [claves](#key) existen en ambas tablas.\n"
    }
  },
  "instance": {
    "en": {
      "term": "instance",
      "def": "An [object](#object) of a particular [class](#class).\n"
    },
    "es": {
      "term": "instancia",
      "def": "Un [objeto](#object) de una [clase](#class) en particular.\n"
    }
  },
  "integration_test": {
    "en": {
      "term": "integration test",
      "def": "A test that checks whether the parts of a system work properly when put together.\n"
    },
    "es": {
      "term": "prueba de integración",
      "def": "Una prueba que verifica si las partes de un sistema funcionan correctamente cuando se combinan.\n"
    }
  },
  "interpreted_language": {
    "en": {
      "term": "interpreted language",
      "def": "A high-level language that is not executed directly by the computer, but instead is run by an [interpreter](#interpreter) that translates program instructions into machine commands on the fly.\n"
    },
    "es": {
      "term": "lenguaje interpretado",
      "def": "Un lenguaje de alto nivel que no es ejecutado directamente por la computadora, sino que se ejecuta mediante un [intérprete](#interpreter) que traduce las instrucciones del programa a comandos de máquina en tiempo real.\n"
    }
  },
  "interpreter": {
    "en": {
      "term": "interpreter",
      "def": "A program whose job it is to run programs written in a high-level [interpreted language](#interpreted_language). Interpreters can run interactively, but may also execute commands saved in a file.\n"
    },
    "es": {
      "term": "intérprete",
      "def": "Un programa cuya función es ejecutar programas escritos en un [lenguaje interpretado](#interpreted_language) de alto nivel. Los intérpretes pueden ejecutarse de forma interactiva o procesar comandos guardados en un archivo.\n"
    }
  },
  "invariant": {
    "en": {
      "term": "invariant",
      "def": "Something that must be [true](#true) at all times inside of a program or during the [lifecycle](#lifecycle) of an [object](#object). Invariants are often expressed using [assertions](#assertion). If an invariant expression is not true, this is indicative of a problem, and may result in failure or early termination of the program.\n"
    },
    "es": {
      "term": "invariante",
      "def": "Algo que debe ser [verdadero](#true) en todo momento dentro de un programa o durante el [ciclo de vida](#lifecycle) de un [objeto](#object). Los invariantes suelen expresarse con [aserciones](#assertion). Si un invariante no se cumple, suele ser indicativo de un problema que puede causar fallos o la terminación prematura del programa.\n"
    }
  },
  "iso_date_format": {
    "en": {
      "term": "ISO date format",
      "def": "An international for formatting dates. While the full standard is complex, the most common form is `YYYY-MM-DD`, i.e., a four-digit year, a two-digit month, and a two-digit day, separated by hyphens.\n"
    },
    "es": {
      "term": "formato de fecha ISO",
      "def": "Un estándar internacional para el formato de fechas. Aunque la norma completa es compleja, la forma más común es `AAAA-MM-DD`, es decir, un año de cuatro dígitos, un mes de dos dígitos y un día de dos dígitos, separados por guiones.\n"
    }
  },
  "issue": {
    "en": {
      "term": "issue",
      "def": "A [bug report](#bug_report), feature request, or other to-do item associated with a project. Also called a [ticket](#ticket).\n"
    },
    "es": {
      "term": "incidencia",
      "def": "Un [informe de error](#bug_report), solicitud de función u otro elemento de tareas asociado a un proyecto. También llamado [ticket](#ticket).\n"
    }
  },
  "issue_label": {
    "en": {
      "term": "label (an issue)",
      "def": "A short textual tag associated with an [issue](#issue) to categorize it. Common labels include [`bug`](#bug) and `feature request`.\n"
    },
    "es": {
      "term": "etiqueta (una incidencia)",
      "def": "Una etiqueta textual corta asociada con una [incidencia](#issue) para categorizarla. Las etiquetas comunes incluyen [`bug`](#bug) y `solicitud de función`.\n"
    }
  },
  "issue_tracking_system": {
    "en": {
      "term": "issue tracking system",
      "def": "Similar to a [bug tracking system](#bug_tracker) in that it tracks [issues](#issue) made to a [repository](#repository), usually in the form of [feature requests](#feature_request), [bug reports](#bug_report), or some other to-do item.\n"
    },
    "es": {
      "term": "sistema de seguimiento de incidencias",
      "def": "Similar a un [sistema de seguimiento de errores](#bug_tracker) en el que se rastrean [incidencias](#issue) realizadas en un [repositorio](#repository), generalmente en forma de [solicitudes de funciones](#feature_request), [informes de errores](#bug_report), u otros elementos de tareas.\n"
    }
  },
  "iterator_pattern": {
    "en": {
      "term": "Iterator pattern",
      "def": "A [design pattern](#design_pattern) in which a temporary [object](#object) or [generator function](#generator_function) produces each value from a collection in turn for processing. This pattern hides the differences between different kinds of data structures so that everything can be processed using loops.\n"
    },
    "es": {
      "term": "patrón iterador",
      "def": "Un [patrón de diseño](#design_pattern) en el cual un [objeto](#object) temporal o una [función generadora](#generator_function) produce cada valor de una colección para ser procesado secuencialmente. Este patrón oculta las diferencias entre distintos tipos de estructuras de datos para que todo pueda procesarse con bucles.\n"
    }
  },
  "join": {
    "en": {
      "term": "join",
      "def": "One of several operations that combine values from two [tables](#table).\n"
    },
    "es": {
      "term": "unión",
      "def": "Una de varias operaciones que combinan valores de dos [tablas](#table).\n"
    }
  },
  "json": {
    "en": {
      "term": "JavaScript Object Notation",
      "acronym": "JSON",
      "def": "A way to represent data by combining basic values like numbers and character strings in [lists](#list) and [key/value](#dictionary) structures. The acronym stands for \"JavaScript Object Notation\"; unlike better-defined standards like [XML](#xml), it is unencumbered by a syntax for comments or ways to define a [schema](#schema).\n"
    },
    "es": {
      "term": "Notación de Objetos de JavaScript",
      "acronym": "JSON",
      "def": "Una forma de representar datos combinando valores básicos como números y cadenas de caracteres en [listas](#list) y estructuras [clave/valor](#dictionary). El acrónimo significa \"JavaScript Object Notation\"; a diferencia de estándares mejor definidos como [XML](#xml), no tiene sintaxis para comentarios ni formas de definir un [esquema](#schema).\n"
    }
  },
  "jupyter": {
    "en": {
      "term": "Jupyter",
      "def": "Project Jupyter is a non-profit, open-source project that was born out of the IPython Project in 2014 as IPython evolved to support interactive [data science](#data_science) and scientific computing in many different programming languages.\n"
    },
    "es": {
      "term": "Jupyter",
      "def": "El Proyecto Jupyter es un proyecto sin fines de lucro y de código abierto que nació del Proyecto IPython en 2014, cuando IPython evolucionó para admitir [ciencia de datos](#data_science) interactiva y computación científica en muchos lenguajes de programación diferentes.\n"
    }
  },
  "jupyter_notebook": {
    "en": {
      "term": "Jupyter Notebook",
      "def": "The Jupyter Notebook is an open-source, web-based [computational notebook](#computational_notebook) that allows the user to write and share live code, equations, visualisations, and narrative text.\n"
    },
    "es": {
      "term": "Cuaderno Jupyter",
      "def": "El Cuaderno Jupyter es un [cuaderno computacional](#computational_notebook) basado en la web y de código abierto que permite al usuario escribir y compartir código en vivo, ecuaciones, visualizaciones y texto narrativo.\n"
    }
  },
  "k_means_clustering": {
    "en": {
      "term": "k-means clustering",
      "def": "An [unsupervised_learning](#unsupervised_learning) algorithm that forms *k* groups by repeatedly calculating the [centroid](#centroid) of the current groups and then reallocating data points to the nearest centroid until the centroids no longer move.\n"
    },
    "es": {
      "term": "agrupamiento k-means",
      "def": "Un algoritmo de [aprendizaje no supervisado](#unsupervised_learning) que forma *k* grupos calculando repetidamente el [centroide](#centroid) de los grupos actuales y luego reasignando los puntos de datos al centroide más cercano hasta que los centroides ya no se muevan.\n"
    }
  },
  "k_nearest_neighbors": {
    "en": {
      "term": "k-nearest neighbors",
      "def": "A [classification](#classification) algorithm that classifies data points based on their similarity to their *k* nearest neighbours.\n"
    },
    "es": {
      "term": "k vecinos más cercanos",
      "def": "Un algoritmo de [clasificación](#classification) que clasifica puntos de datos en función de su similitud con sus *k* vecinos más cercanos.\n"
    }
  },
  "kebab_case": {
    "en": {
      "term": "kebab case",
      "def": "A naming convention in which the parts of a name are separated with dashes, as in `first-second-third`.\n"
    },
    "es": {
      "term": "notación kebab",
      "def": "Una convención de nombres en la que las partes de un nombre están separadas por guiones, como en `primero-segundo-tercero`.\n"
    }
  },
  "key": {
    "en": {
      "term": "key",
      "def": "1. A [field](#field) or combination of fields whose value(s) uniquely identify a [record](#record) within a [table](#table) or dataset. Keys are often used to select specific records and in [joins](#join). 2. Part of a key/value pair, used as a unique identifier in a data structure such as a [dictionary](#dictionary).\n"
    },
    "es": {
      "term": "clave",
      "def": "1. Un [campo](#field) o combinación de campos cuyos valores identifican de manera única un [registro](#record) dentro de una [tabla](#table) o conjunto de datos. Las claves se utilizan a menudo para seleccionar registros específicos y en [uniones](#join). 2. Parte de un par clave/valor, usada como identificador único en estructuras de datos como un [diccionario](#dictionary).\n"
    }
  },
  "keyword_argument": {
    "en": {
      "term": "keyword arguments",
      "def": "Extra (often optional) arguments given to a function as key/value pairs.\n"
    },
    "es": {
      "term": "argumentos por palabra clave",
      "def": "Argumentos adicionales (a menudo opcionales) que se pasan a una función como pares clave/valor.\n"
    }
  },
  "latent_variable": {
    "en": {
      "term": "latent variable",
      "def": "A variable that is not observed directly but instead is inferred from the states or values of other variables.\n"
    },
    "es": {
      "term": "variable latente",
      "def": "Una variable que no se observa directamente, sino que se infiere a partir de los estados o valores de otras variables.\n"
    }
  },
  "latex": {
    "en": {
      "term": "LaTeX",
      "def": "A typesetting system for document preparation that uses a specialized [markup language](#markup_language) to define a document structure (e.g., headings), stylise text, insert mathematical equations, and manage citations and cross-references. LaTeX is widely used in academia, in particular for scientific papers and theses in mathematics, physics, engineering, and computer science.\n"
    },
    "es": {
      "term": "LaTeX",
      "def": "Un sistema de composición de textos para la preparación de documentos que utiliza un [lenguaje de marcado](#markup_language) especializado para definir la estructura del documento (por ejemplo, encabezados), estilizar texto, insertar ecuaciones matemáticas y gestionar citas y referencias cruzadas. LaTeX se utiliza ampliamente en el ámbito académico, en particular para artículos científicos y tesis en matemáticas, física, ingeniería e informática.\n"
    }
  },
  "lazy_evaluation": {
    "en": {
      "term": "lazy evaluation",
      "def": "Delaying evaluation of an expression until the value is actually needed or, in the case of a conditional expression, only evaluating as much of the expression as is necessary. For instance, the second half of `A and B` will only be evaluated if A is [truthy](#truthy).\n"
    },
    "es": {
      "term": "evaluación perezosa",
      "def": "Retrasar la evaluación de una expresión hasta que el valor sea realmente necesario o, en el caso de una expresión condicional, evaluar solo lo necesario. Por ejemplo, la segunda parte de `A and B` solo se evaluará si A es [verdadero](#truthy).\n"
    }
  },
  "left_join": {
    "en": {
      "term": "left join",
      "def": "A [join](#join) that combines data from two tables, A and B, where [keys](#key) in table A match keys in table B, [fields](#field) are concatenated. Where a key in table A does *not* match a key in table B, columns from table B are filled with [null](#null), [NA](#na), or some other [missing value](#missing_value). Keys from table B that do not match keys from table A are excluded for the result.\n"
    },
    "es": {
      "term": "unión izquierda",
      "def": "Una [unión](#join) que combina datos de dos tablas, A y B, donde las [claves](#key) de la tabla A coinciden con las de la tabla B, y los [campos](#field) se concatenan. Cuando una clave de A *no* coincide con una clave de B, las columnas de B se rellenan con [nulo](#null), [NA](#na), u otro [valor faltante](#missing_value). Las claves de B que no coinciden con A se excluyen del resultado.\n"
    }
  },
  "lexical_scoping": {
    "en": {
      "term": "lexical scoping",
      "def": "To look up the value associated with a name according to the textual structure of a program. Most programming languages use lexical scoping instead of [dynamic scoping](#dynamic_scoping) because the latter is less predictable.\n"
    },
    "es": {
      "term": "ámbito léxico",
      "def": "Buscar el valor asociado a un nombre según la estructura textual de un programa. La mayoría de los lenguajes de programación utilizan ámbito léxico en lugar de [ámbito dinámico](#dynamic_scoping) porque este último es menos predecible.\n"
    }
  },
  "library": {
    "en": {
      "term": "library",
      "def": "A reusable software [package](#package), also often called a [module](#module).\n"
    },
    "es": {
      "term": "biblioteca",
      "def": "un paquete de software reutilizable, también  se llama un [módulo](#module).\n"
    }
  },
  "license": {
    "en": {
      "term": "license",
      "def": "A legal document describing how something can be used, and by whom.\n"
    },
    "es": {
      "term": "licencia",
      "def": "Un documento legal que describe cómo se puede usar algo y por quién.\n"
    }
  },
  "lifecycle": {
    "en": {
      "term": "lifecycle",
      "def": "The steps that something is allowed or required to go through. The lifecycle of an [object](#object) runs from its [construction](#constructor) through the operations it can or must perform before it is destroyed; the lifecycle of an [issue](#issue) may be: \"created\", \"assigned\", \"in progress\", \"ready for review\", and \"completed\".\n"
    },
    "es": {
      "term": "ciclo de vida",
      "def": "Los pasos que algo puede o debe atravesar. El ciclo de vida de un [objeto](#object) va desde su [construcción](#constructor) hasta las operaciones que puede o debe realizar antes de ser destruido; el ciclo de vida de un [problema](#issue) puede ser: \"creado\", \"asignado\", \"en progreso\", \"listo para revisión\" y \"completado\".\n"
    }
  },
  "lift": {
    "en": {
      "term": "lift",
      "def": "How well a model predicts or [classifies](#classification) things, measured as the ratio of the response in the segment identified to the response in the population as a whole. A lift of 1 means the model does no better than chance; higher lift means the model is doing better.\n"
    },
    "es": {
      "term": "elevación (lift)",
      "def": "Qué tan bien un modelo predice o [clasifica](#classification) elementos, medido como la razón entre la respuesta en el segmento identificado y la respuesta en la población general. Una elevación de 1 significa que el modelo no es mejor que el azar; una elevación más alta indica que el modelo tiene mejor desempeño.\n"
    }
  },
  "line_comment": {
    "en": {
      "term": "line comment",
      "def": "A [comment](#comment) in a program that spans part of a single line, as opposed to a [block comment](#block_comment) that may span multiple lines.\n"
    },
    "es": {
      "term": "comentario de línea",
      "def": "Un [comentario](#comment) en un programa que abarca parte de una sola línea, a diferencia de un [comentario de bloque](#block_comment) que puede abarcar varias líneas.\n"
    }
  },
  "linear_regression": {
    "en": {
      "term": "linear regression",
      "def": "A method for finding the best straight-line fit between two datasets, typically by minimizing the squares of the distances between the points and a regression line.\n"
    },
    "es": {
      "term": "regresión lineal",
      "def": "Un método para encontrar la mejor línea recta de ajuste entre dos conjuntos de datos, típicamente minimizando los cuadrados de las distancias entre los puntos y una línea de regresión.\n"
    }
  },
  "linter": {
    "en": {
      "term": "linter",
      "def": "A program that checks for common problems in software, such as violations of indentation rules or variable naming conventions. The name comes from the first tool of its kind, called `lint`.\n"
    },
    "es": {
      "term": "linter",
      "def": "Un programa que verifica problemas comunes en el software, como violaciones a las reglas de indentación o convenciones de nombres de variables. El nombre proviene de la primera herramienta de este tipo, llamada `lint`.\n"
    }
  },
  "lisp": {
    "en": {
      "term": "Lisp",
      "def": "A family of programming languages that represent programs and data as nested lists. Many other programming languages have borrowed ideas from Lisp.\n"
    },
    "es": {
      "term": "Lisp",
      "def": "Una familia de lenguajes de programación que representan programas y datos como listas anidadas. Muchos otros lenguajes de programación han adoptado ideas de Lisp.\n"
    }
  },
  "list": {
    "en": {
      "term": "list",
      "def": "A [vector](#vector) that can contain values of many different ([heterogeneous](#heterogeneous)) types.\n"
    },
    "es": {
      "term": "lista",
      "def": "Un [vector](#vector) que puede contener valores de muchos tipos diferentes ([heterogéneos](#heterogeneous)).\n"
    }
  },
  "list_comprehension": {
    "en": {
      "term": "list comprehension",
      "def": "In [Python](#python), an expression that creates a new list in place. For example, `[2*x for x in values]` creates a new list whose items are the doubles of those in `values`.\n"
    },
    "es": {
      "term": "comprensión de listas",
      "def": "En [Python](#python), una expresión que crea una nueva lista en el lugar. Por ejemplo, `[2*x for x in values]` crea una nueva lista cuyos elementos son el doble de los de `values`.\n"
    }
  },
  "literate_programming": {
    "en": {
      "term": "literate programming",
      "def": "A programming paradigm that mixes prose and code.\n"
    },
    "es": {
      "term": "programación literaria",
      "def": "Un paradigma de programación que mezcla prosa y código.\n"
    }
  },
  "local_installation": {
    "en": {
      "term": "local installation",
      "def": "Placing a [package](#package) inside a particular project so that it is only accessible within that project.\n"
    },
    "es": {
      "term": "instalación local",
      "def": "El acto de ubicar un paquete en un proyecto en particular para que sólo sea accesible dentro de ese proyecto.\n"
    }
  },
  "local_variable": {
    "en": {
      "term": "local variable",
      "def": "A variable defined inside a function which is only visible within that function.\n"
    },
    "es": {
      "term": "variable local",
      "def": "Una variable definida dentro de una función, por lo que solo es visible dentro de ella.\n"
    }
  },
  "log": {
    "en": {
      "term": "log",
      "def": "A record of a program's execution containing [messages](#log_message) written via a [logging framework](#logging_framework) for later inspection.\n"
    },
    "es": {
      "term": "registro",
      "def": "Un registro de la ejecución de un programa que contiene [mensajes](#log_message) escritos mediante un [framework de registro](#logging_framework) para su posterior inspección.\n"
    }
  },
  "log_message": {
    "en": {
      "term": "log message",
      "def": "A single entry in a [log](#log) of a program's execution. Log messages are usually highly structured so that data (such as the time or the severity) can be recovered later.\n"
    },
    "es": {
      "term": "mensaje de registro",
      "def": "Una entrada única en un [registro](#log) de la ejecución de un programa. Los mensajes de registro suelen estar altamente estructurados para que se pueda recuperar información como la hora o la gravedad.\n"
    }
  },
  "logging_framework": {
    "en": {
      "term": "logging framework",
      "def": "A software [library](#library) that manages internal reporting for programs.\n"
    },
    "es": {
      "term": "framework de registro",
      "def": "Una [biblioteca](#library) de software que gestiona los reportes internos de los programas.\n"
    }
  },
  "logging_level": {
    "en": {
      "term": "logging level",
      "def": "A setting that controls how much information is generated by a [logging framework](#logging_framework). Typical logging levels include `DEBUG`, `WARNING`, and `ERROR`.\n"
    },
    "es": {
      "term": "nivel de registro",
      "def": "Una configuración que controla cuánta información es generada por un [framework de registro](#logging_framework). Los niveles típicos incluyen `DEBUG`, `WARNING` y `ERROR`.\n"
    }
  },
  "logical_indexing": {
    "en": {
      "term": "logical indexing",
      "def": "To index a [vector](#vector) or other structure with a vector of [Booleans](#boolean), keeping only the values that correspond to [true](#true) values. Also referred to as [masking](#masking).\n"
    },
    "es": {
      "term": "indexación lógica",
      "def": "Indexar un [vector](#vector) u otra estructura con un vector de valores [booleanos](#boolean), manteniendo solo los valores que corresponden a valores [verdaderos](#true). También se conoce como [enmascaramiento](#masking).\n"
    }
  },
  "logistic_regression": {
    "en": {
      "term": "logistic regression",
      "def": "A method for fitting a model to some data that uses logistic (S-shaped) curves instead of straight lines.\n"
    },
    "es": {
      "term": "regresión logística",
      "def": "Un método para ajustar un modelo a algunos datos que utiliza curvas logísticas (en forma de S) en lugar de líneas rectas.\n"
    }
  },
  "long_identifier_git": {
    "en": {
      "term": "long identifier (of commit)",
      "def": "See [full identifier](#full_identifier_git).\n"
    },
    "es": {
      "term": "identificador largo (de commit)",
      "def": "Ver [identificador completo](#full_identifier_git).\n"
    }
  },
  "long_option": {
    "en": {
      "term": "long option",
      "def": "A full-word identifier for a [command-line argument](#command_line_argument). While most common flags are a single letter preceded by a dash, such as `-v`, long options typically use two dashes and a readable name, such as `--verbose`.\n"
    },
    "es": {
      "term": "opción larga",
      "def": "Un identificador en forma de palabra completa para un [argumento de línea de comandos](#command_line_argument). Mientras que las banderas comunes son letras precedidas por un guion como `-v`, las opciones largas usan dos guiones y un nombre legible, como `--verbose`.\n"
    }
  },
  "loop": {
    "en": {
      "term": "loop",
      "def": "A structure that repeatedly executes a section of code until a specific exit condition is met.\n"
    },
    "es": {
      "term": "bucle",
      "def": "Una estructura que ejecuta repetidamente una sección de código hasta que se cumple una condición de salida específica.\n"
    }
  },
  "loop_body": {
    "en": {
      "term": "loop body",
      "def": "The statement or statements executed by a loop.\n"
    },
    "es": {
      "term": "cuerpo del bucle",
      "def": "La instrucción o instrucciones que ejecuta un bucle.\n"
    }
  },
  "machine_learning": {
    "en": {
      "term": "machine learning",
      "def": "The study or use of algorithms whose performance improves as they are given more data. Machine learning algorithms often use [training data](#training_data) to build a [model](#model). Their performance is then measured by how well they predict the properties of [test data](#test_data).\n"
    },
    "es": {
      "term": "aprendizaje automático",
      "def": "El estudio o uso de algoritmos cuyo rendimiento mejora a medida que se les proporciona más datos. Los algoritmos de aprendizaje automático suelen usar [datos de entrenamiento](#training_data) para construir un [modelo](#model), y su rendimiento se mide por qué tan bien predicen las propiedades de los [datos de prueba](#test_data).\n"
    }
  },
  "magic_number": {
    "en": {
      "term": "magic number",
      "def": "An unnamed numerical constant that appears in a program without explanation.\n"
    },
    "es": {
      "term": "número mágico",
      "def": "Una constante numérica sin nombre que aparece en un programa sin explicación.\n"
    }
  },
  "make": {
    "en": {
      "term": "Make",
      "def": "The original [build manager](#build_manager) for Unix, still in daily use after more than forty years.\n"
    },
    "es": {
      "term": "Make",
      "def": "El [gestor de construcción](#build_manager) original para Unix, que todavía se utiliza diariamente después de más de cuarenta años.\n"
    }
  },
  "makefile": {
    "en": {
      "term": "Makefile",
      "def": "A file containing commands for [Make](#make), often actually called `Makefile`.\n"
    },
    "es": {
      "term": "Makefile",
      "def": "Un archivo que contiene comandos para [Make](#make), comúnmente llamado `Makefile`.\n"
    }
  },
  "markdown": {
    "en": {
      "term": "Markdown",
      "def": "A [markup language](#markup_language) with a simple syntax intended as a replacement for [HTML](#html). Markdown is often used for README files, and is the basis for [R markdown](#r_markdown).\n"
    },
    "es": {
      "term": "Markdown",
      "def": "Un [lenguaje de marcado](#markup_language) con una sintaxis simple que sirve como reemplazo de [HTML](#html). Markdown se usa a menudo para archivos README y es la base para [R markdown](#r_markdown).\n"
    }
  },
  "markov_chain": {
    "en": {
      "term": "Markov Chain",
      "def": "Any [model](#model) describing a series of events in which the probability of each event depends only on the current state, not on the path taken to reach that state.\n"
    },
    "es": {
      "term": "cadena de Markov",
      "def": "Cualquier [modelo](#model) que describe una serie de eventos en la que la probabilidad de cada evento depende solo del estado actual y no del camino tomado para llegar a ese estado.\n"
    }
  },
  "markup_language": {
    "en": {
      "term": "markup language",
      "def": "A set of rules for annotating text to define its meaning or how it should be displayed. The markup is usually not displayed, but instead controls how the underlying text is interpreted or shown. [Markdown](#markdown) and [HTML](#html) are widely-used markup languages for web pages.\n"
    },
    "es": {
      "term": "lenguaje de marcado",
      "def": "Un conjunto de reglas para anotar texto y definir su significado o cómo debe mostrarse. El marcado generalmente no se muestra, sino que controla cómo se interpreta o presenta el texto. [Markdown](#markdown) y [HTML](#html) son lenguajes de marcado ampliamente utilizados en páginas web.\n"
    }
  },
  "marthas_rules": {
    "en": {
      "term": "Martha's Rules",
      "def": "A simple set of rules for making decisions in small groups.\n"
    },
    "es": {
      "term": "Reglas de Martha",
      "def": "Un conjunto simple de reglas para tomar decisiones en grupos pequeños.\n"
    }
  },
  "masking": {
    "en": {
      "term": "Masking",
      "def": "[TODO] to be defined"
    },
    "es": {
      "term": "enmascaramiento",
      "def": "[POR HACER] por definir"
    }
  },
  "master_branch": {
    "en": {
      "term": "master branch",
      "def": "A dedicated, permanent, central [branch](#branch) which should contain a \"ready product\". After a new feature is developed on a separate branch to avoid breaking the main code, it can be [merged](#git_merge) into the master branch.\n"
    },
    "es": {
      "term": "rama principal",
      "def": "Una [rama](#branch) central, permanente y dedicada que debe contener un \"producto listo\". Después de desarrollar una nueva función en una rama separada para evitar romper el código principal, se puede [fusionar](#git_merge) con la rama principal.\n"
    }
  },
  "maximum_likelihood_estimation": {
    "en": {
      "term": "maximum likelihood estimation",
      "def": "To choose the [parameters](#parameter) for a [probability distribution](#probability_distribution) in order to maximize the likelihood of obtaining observed data.\n"
    },
    "es": {
      "term": "estimación de máxima verosimilitud",
      "def": "Elegir los [parámetros](#parameter) para una [distribución de probabilidad](#probability_distribution) con el fin de maximizar la probabilidad de obtener los datos observados.\n"
    }
  },
  "mean": {
    "en": {
      "term": "mean",
      "def": "The average value of a dataset, more properly known as the [arithmetic mean](#arithmetic_mean) to distinguish it from the [geometric](#geometric_mean) and [harmonic](#harmonic_mean) means.\n"
    },
    "es": {
      "term": "media",
      "def": "El valor promedio de un conjunto de datos, conocido más propiamente como [media aritmética](#arithmetic_mean) para distinguirlo de la [media geométrica](#geometric_mean) y la [media armónica](#harmonic_mean).\n"
    }
  },
  "mean_absolute_error": {
    "en": {
      "term": "mean absolute error",
      "def": "The average error of all predicted values compared with actual values.\n"
    },
    "es": {
      "term": "error absoluto medio",
      "def": "El error promedio de todos los valores predichos en comparación con los valores reales.\n"
    }
  },
  "mean_squared_error": {
    "en": {
      "term": "mean squared error",
      "def": "The average of the squares of all the errors of all predicted values compared with actual values. Squaring makes larger errors count for more, and transforms negative errors into positive values, making this a more popular measure than [mean absolute error](#mean_absolute_error).\n"
    },
    "es": {
      "term": "error cuadrático medio",
      "def": "El promedio de los cuadrados de todos los errores de todos los valores predichos comparados con valores reales. El cuadrado hace que los errores más grandes cuenten más, haciendo esta medida más popular que el [error absoluto medio](#mean_absolute_error).\n"
    }
  },
  "median": {
    "en": {
      "term": "median",
      "def": "A value separating the upper and lower halves of a sorted dataset. The median often gives a better idea of what is typical of the dataset than the [mean](#mean), which can be influenced by a small number of extreme [outliers](#outlier). If the dataset contains an even number of elements, this is the average of the two central elements.\n"
    },
    "es": {
      "term": "mediana",
      "def": "Un valor que separa las mitades superior e inferior de un conjunto de datos ordenado. Frecuentemente, la mediana da una idea mejor de lo que es característico del conjunto de datos que la [media](#mean), que puede estar influenciada por un pequeño número de [valores atípicos](#outlier). Si el conjunto de datos contiene un número par de elementos, este es el promedio de los dos elementos centrales.\n"
    }
  },
  "merge_git": {
    "en": {
      "term": "merge (Git)",
      "def": "See [Git merge](#git_merge)\n"
    },
    "es": {
      "term": "fusión (Git)",
      "def": "Ver [fusión de Git](#git_merge)\n"
    }
  },
  "method": {
    "en": {
      "term": "method",
      "def": "An implementation of a [generic function](#generic_function) that handles objects of a specific class.\n"
    },
    "es": {
      "term": "método",
      "def": "Una implementación de una [función genérica](#generic_function) que manipula objetos de una clase específica.\n"
    }
  },
  "milestone": {
    "en": {
      "term": "milestone",
      "def": "A target that a project is trying to meet, often represented as a set of [issues](#issue) that all have to be resolved by a certain time.\n"
    },
    "es": {
      "term": "hito",
      "def": "Un objetivo que un proyecto intenta alcanzar, a menudo representado como un conjunto de [problemas](#issue) que deben resolverse antes de una fecha determinada.\n"
    }
  },
  "mime_type": {
    "en": {
      "term": "MIME type",
      "def": "A standard way to identify the contents of files on the internet. The term is an acronym of \"multi-purpose Internet mail extension\", and MIME types are often identified by [filename extensions](#filename_extension), such as `.png` for PNG-formatted images.\n"
    },
    "es": {
      "term": "tipo MIME",
      "def": "Una forma estándar de identificar el contenido de archivos en internet. El término es un acrónimo de \"extensión de correo de Internet multipropósito\", y los tipos MIME a menudo se identifican por [extensiones de nombre de archivo](#filename_extension), como `.png` para imágenes en formato PNG.\n"
    }
  },
  "missing_value": {
    "en": {
      "term": "missing value",
      "def": "A special value such as [null](#null) or [NA](#na) used to indicate the absence of data. Missing values can signal that data was not collected or that the data did not exist in the first place (e.g., the middle name of someone who does not have one).\n"
    },
    "es": {
      "term": "valor faltante",
      "def": "Un valor especial como [null](#null) o [NA](#na) usado para indicar la ausencia de datos. Los valores faltantes pueden indicar que no se recolectaron datos o que los datos no existían (por ejemplo, el segundo nombre de alguien que no tiene uno).\n"
    }
  },
  "mit_license": {
    "en": {
      "term": "MIT License",
      "def": "A [license](#license) that allows people to re-use software with no restrictions.\n"
    },
    "es": {
      "term": "Licencia MIT",
      "def": "Una [licencia](#license) que permite a las personas reutilizar software sin restricciones.\n"
    }
  },
  "mock_object": {
    "en": {
      "term": "mock object",
      "def": "A simplified replacement for part of a program whose behavior is easy to control and predict. Mock objects are used in [unit tests](#unit_test) to simulate databases, web services, and other complex systems.\n"
    },
    "es": {
      "term": "objeto simulado",
      "def": "Un reemplazo simplificado de parte de un programa cuyo comportamiento es fácil de controlar y predecir. Los objetos simulados se utilizan en las [pruebas unitarias](#unit_test) para simular bases de datos, servicios web y otros sistemas complejos.\n"
    }
  },
  "mode": {
    "en": {
      "term": "mode",
      "def": "The value, or values, that occurs most frequently in a dataset.\n"
    },
    "es": {
      "term": "moda",
      "def": "El valor que ocurre con más frecuencia en un conjunto de datos.\n"
    }
  },
  "model": {
    "en": {
      "term": "model",
      "def": "A specification of the mathematical relationship between different variables.\n"
    },
    "es": {
      "term": "modelo",
      "def": "Una especificación de la relación matemática entre diferentes variables.\n"
    }
  },
  "module": {
    "en": {
      "term": "module",
      "def": "A reusable software [package](#package), also often called a [library](#library).\n"
    },
    "es": {
      "term": "módulo",
      "def": "un paquete de software reutilizable, también se llama una [biblioteca](#library).\n"
    }
  },
  "monte_carlo": {
    "en": {
      "term": "Monte Carlo method",
      "def": "Any method or algorithm that relies on artificially-injected randomness.\n"
    },
    "es": {
      "term": "método de Monte Carlo",
      "def": "Cualquier método o algoritmo que depende de la aleatoriedad introducida artificialmente.\n"
    }
  },
  "moving_average": {
    "en": {
      "term": "moving average",
      "def": "The [mean](#mean) of each set of several consecutive values from [time series](#time_series) data.\n"
    },
    "es": {
      "term": "media móvil",
      "def": "La [media](#mean) de cada conjunto de varios valores consecutivos de datos de una [serie temporal](#time_series).\n"
    }
  },
  "multi_threaded": {
    "en": {
      "term": "multi-threaded",
      "def": "Capable of performing several operations simultaneously. Multi-threaded programs are usually more efficient than [single-threaded](#single_threaded) ones, but also harder to understand and debug.\n"
    },
    "es": {
      "term": "multihilo",
      "def": "Capaz de realizar varias operaciones simultáneamente. Los programas multihilo suelen ser más eficientes que los [de un solo hilo](#single_threaded), pero también más difíciles de entender y depurar.\n"
    }
  },
  "mutation": {
    "en": {
      "term": "mutation",
      "def": "Changing data in place, such as modifying an element of an array or adding a record to a database.\n"
    },
    "es": {
      "term": "mutación",
      "def": "Modificar datos en su lugar, como cambiar un elemento de un arreglo o agregar un registro a una base de datos.\n"
    }
  },
  "n_gram": {
    "en": {
      "term": "n-gram",
      "def": "A sequence of $N$ items, typically words in natural language. For example, a trigram is a sequence of three words. N-grams are often used as input in [computational linguistics](#computational_linguistics).\n"
    },
    "es": {
      "term": "n-grama",
      "def": "Una secuencia de $N$ elementos, típicamente palabras en lenguaje natural. Por ejemplo, un trigrama es una secuencia de tres palabras. Los n-gramas se usan a menudo como entrada en [lingüística computacional](#computational_linguistics).\n"
    }
  },
  "na": {
    "en": {
      "term": "NA",
      "def": "A special value used to represent data that is not available.\n"
    },
    "es": {
      "term": "NA",
      "def": "Un valor especial usado para representar datos no disponibles.\n"
    }
  },
  "naive_bayes_classifier": {
    "en": {
      "term": "naive Bayes classifier",
      "def": "Any [classification](#classification) algorithm based on [Bayes' Theorem](#bayes_theorem) that assumes every [feature](#feature_data) being classified is independent of every other feature.\n"
    },
    "es": {
      "term": "clasificador ingenuo de Bayes",
      "def": "Cualquier algoritmo de [clasificación](#classification) basado en el [Teorema de Bayes](#bayes_theorem) que asume que cada [característica](#feature_data) es independiente de las demás.\n"
    }
  },
  "name_collision": {
    "en": {
      "term": "name collision",
      "def": "The ambiguity that arises when two or more things in a program that have the same name are active at the same time. Most languages use [namespaces](#namespace) to prevent such collisions.\n"
    },
    "es": {
      "term": "colisión de nombres",
      "def": "La ambigüedad que surge cuando dos o más elementos en un programa con el mismo nombre están activos al mismo tiempo. La mayoría de los lenguajes usan [espacios de nombres](#namespace) para evitar tales colisiones.\n"
    }
  },
  "named_argument": {
    "en": {
      "term": "named argument",
      "def": "A function [parameter](#parameter) that is given a value by explicitly naming it in a function call.\n"
    },
    "es": {
      "term": "argumento nombrado",
      "def": "Un [parámetro](#parameter) de función que recibe un valor nombrándolo explícitamente en la llamada a la función.\n"
    }
  },
  "namespace": {
    "en": {
      "term": "namespace",
      "def": "A collection of names in a program that exists in isolation from other namespaces. Each function, [object](#object), [class](#class), or [module](#module) in a program typically has its own namespace so that references to \"X\" in one part of a program do not accidentally refer to something called \"X\" in another part of the program. Scope is a distinct, but related, concept.\n"
    },
    "es": {
      "term": "espacio de nombres",
      "def": "Una colección de nombres en un programa que existe de manera aislada de otros espacios de nombres. Cada función, [objeto](#object), [clase](#class), o [módulo](#module) normalmente tiene su propio espacio de nombres para que las referencias a \"X\" en una parte del programa no se refieran accidentalmente a otra cosa llamada \"X\" en otra parte. El alcance es un concepto diferente pero relacionado.\n"
    }
  },
  "nano_editor": {
    "en": {
      "term": "Nano (editor)",
      "def": "A very simple text editor found on most Unix systems.\n"
    },
    "es": {
      "term": "Nano (editor)",
      "def": "Un editor de texto muy simple que se encuentra en la mayoría de los sistemas Unix.\n"
    }
  },
  "negative_selection": {
    "en": {
      "term": "negative selection",
      "def": "To specify the [elements](#element) of a [vector](#vector) or other data structure that are not desired by negating their indices.\n"
    },
    "es": {
      "term": "selección negativa",
      "def": "Especificar los [elementos](#element) de un [vector](#vector) u otra estructura de datos que no se desean, negando sus índices.\n"
    }
  },
  "neural_network": {
    "en": {
      "term": "neural network",
      "def": "One of a large family of algorithms for identifying patterns in data by mimicking the way neurons interact. A neural network consists of one or more layers of [nodes](#node), each of which is connected to nodes in the preceding and subsequent layer. If enough of a node's inputs are active, that node activates as well.\n"
    },
    "es": {
      "term": "red neuronal",
      "def": "Una de muchas familias de algoritmos para identificar patrones en datos imitando la forma en que interactúan las neuronas. Una red neuronal consiste en una o más capas de [nodos](#node), cada una conectada a los nodos en la capa anterior y siguiente. Si suficientes entradas de un nodo están activas, ese nodo también se activa.\n"
    }
  },
  "nlp": {
    "en": {
      "term": "natural language processing",
      "acronym": "NLP",
      "def": "See [computational linguistics](#computational_linguistics).\n"
    },
    "es": {
      "term": "procesamiento de lenguaje natural",
      "acronym": "PLN",
      "def": "Ver [lingüística computacional](#computational_linguistics).\n"
    }
  },
  "node": {
    "en": {
      "term": "node",
      "def": "An element of a [graph](#graph) that is connected to other nodes by [edges](#edge). Nodes typically have data associated with them, such as names or weights.\n"
    },
    "es": {
      "term": "nodo",
      "def": "Un elemento de un [grafo](#graph) que está conectado a otros nodos mediante [aristas](#edge). Los nodos normalmente tienen datos asociados, como nombres o pesos.\n"
    }
  },
  "non_blocking_execution": {
    "en": {
      "term": "non-blocking execution",
      "def": "To allow a program to continue running while an operation is in progress. For example, many systems support non-blocking execution for file I/O so that the program can continue doing work while it waits for data to be read from or written to the [filesystem](#filesystem) (which is typically much slower than the CPU).\n"
    },
    "es": {
      "term": "ejecución no bloqueante",
      "def": "Permitir que un programa continúe ejecutándose mientras una operación está en curso. Por ejemplo, muchos sistemas admiten ejecución no bloqueante para entrada/salida de archivos, lo que permite que el programa siga trabajando mientras espera que los datos se lean o escriban en el [sistema de archivos](#filesystem) (que suele ser mucho más lento que la CPU).\n"
    }
  },
  "normal_distribution": {
    "en": {
      "term": "normal distribution",
      "def": "A continuous random distribution with a symmetric bell-curve shape. As datasets get larger, some of their most important statistical properties can be modeled using a normal distribution.\n"
    },
    "es": {
      "term": "distribución normal",
      "def": "Una distribución aleatoria continua con forma de campana simétrica. A medida que los conjuntos de datos aumentan de tamaño, algunas de sus propiedades estadísticas más importantes pueden modelarse usando una distribución normal.\n"
    }
  },
  "nosql_database": {
    "en": {
      "term": "NoSQL database",
      "def": "Any database that does not use the [relational](#relational_database) model. The name comes from the fact that such databases do not use [SQL](#sql) as a query language.\n"
    },
    "es": {
      "term": "base de datos NoSQL",
      "def": "Cualquier base de datos que no use el modelo [relacional](#relational_database). El nombre proviene del hecho de que dichas bases de datos no utilizan [SQL](#sql) como lenguaje de consultas.\n"
    }
  },
  "null": {
    "en": {
      "term": "null",
      "def": "A special value used to represent a missing object. Null is not the same as [NA](#na), and neither is it the same as an [empty vector](#empty_vector).\n"
    },
    "es": {
      "term": "null",
      "def": "Un valor especial que representa un objeto ausente. Null no es lo mismo que [NA](#na), ni tampoco equivale a un [vector vacío](#empty_vector).\n"
    }
  },
  "null_hypothesis": {
    "en": {
      "term": "null hypothesis",
      "def": "The claim that any patterns seen in data are entirely due to chance. Other claims (e.g., \"X causes Y\") must be much more likely than the null hypothesis in order to be substantiated.\n"
    },
    "es": {
      "term": "hipótesis nula",
      "def": "La afirmación de que cualquier patrón observado en los datos se debe completamente al azar. Otras afirmaciones (por ejemplo, \"X causa Y\") deben ser mucho más probables que la hipótesis nula para que se consideren válidas.\n"
    }
  },
  "nullary_expression": {
    "en": {
      "term": "nullary expression",
      "def": "An \"expression\" with no arguments, such as the value 3.\n"
    },
    "es": {
      "term": "expresión nularia",
      "def": "Una \"expresión\" sin argumentos, como el valor 3.\n"
    }
  },
  "numpy": {
    "en": {
      "term": "numpy",
      "def": "An open source Python package that works with arrays, vectors and matrices of dimension N, in a comparable method and with a syntax similar at Matlab software. You can find functions and sophisticated operations, focused in multidimensional arrays, linear algebra, Fourrier transform and generation of random values.\n"
    },
    "es": {
      "term": "numpy",
      "def": "Es un paquete Python de código abierto que le permite trabajar con arreglos, vectores y matrices de dimensión N, en un método comparable y con una sintaxis similar al software Matlab. Puede encontrar funciones y operaciones sofisticadas, enfocadas en matrices multidimensionales, álgebra lineal, transformada de Fourrier y generación de valores aleatorios.\n"
    }
  },
  "object": {
    "en": {
      "term": "object",
      "def": "In [object-oriented programming](#oop), a structure that contains the data for a specific instance of a [class](#class). The operations the object is capable of are defined by the class's [methods](#method).\n"
    },
    "es": {
      "term": "objeto",
      "def": "En [programación orientada a objetos](#oop), es una estructura que contiene los datos de una instancia específica de una [clase](#class). Las operaciones que son capaces de realizar estos objetos están definidas por los [métodos](#method) de la clase.\n"
    }
  },
  "objective_function": {
    "en": {
      "term": "objective function",
      "def": "A function of one or more variables used to measure or compare the goodness of different solutions in an optimization problem.\n"
    },
    "es": {
      "term": "función objetivo",
      "def": "Una función de una o más variables utilizada para medir o comparar la calidad de distintas soluciones en un problema de optimización.\n"
    }
  },
  "observation": {
    "en": {
      "term": "observation",
      "def": "A value or property of a specific member of a population.\n"
    },
    "es": {
      "term": "observación",
      "def": "Un valor o propiedad de un miembro específico de una población.\n"
    }
  },
  "off_by_one_error": {
    "en": {
      "term": "off-by-one error",
      "def": "A common error in programming in which the program refers to element `i` of a structure when it should refer to element `i-1` or `i+1`, or processes `N` elements when it should process `N-1` or `N+1`.\n"
    },
    "es": {
      "term": "error por uno",
      "def": "Un error común en programación donde el programa se refiere al elemento `i` de una estructura cuando debería referirse a `i-1` o `i+1`, o procesa `N` elementos cuando debería procesar `N-1` o `N+1`.\n"
    }
  },
  "oop": {
    "en": {
      "term": "object-oriented programming",
      "acronym": "OOP",
      "def": "A style of programming in which functions and data are bound together in [objects](#object) that only interact with each other through well-defined interfaces.\n"
    },
    "es": {
      "term": "programación orientada a objetos",
      "acronym": "POO",
      "def": "Un paradigma de programación en el cual los datos (atributos) y funciones (métodos) se agrupan en objetos que interactúan entre sí a través de interfaces bien definidas.\n"
    }
  },
  "open_license": {
    "en": {
      "term": "open license",
      "def": "A [license](#license) that permits general re-use, such as the [MIT License](#mit_license) or [GPL](#gpl) for software and [CC-BY](#cc_by) or [CC-0](#cc_0) for data, prose, or other creative outputs.\n"
    },
    "es": {
      "term": "licencia abierta",
      "def": "Una [licencia](#license) que permite reuso en general, tal como la [Licencia MIT](#mit_license)  o [GPL](#gpl) para software y [CC-BY](#cc_by) o [CC-0](#cc_0) para datos, prosas u otros productos creativos.\n"
    }
  },
  "open_science": {
    "en": {
      "term": "open science",
      "def": "A generic term for making scientific software, data, and publications generally available.\n"
    },
    "es": {
      "term": "ciencia abierta",
      "def": "Un término general para referirse a la disponibilidad pública de software, datos y publicaciones científicas.\n"
    }
  },
  "operating_system": {
    "en": {
      "term": "operating system",
      "def": "A program that provides a standard interface to whatever hardware it is running on. Theoretically, any program that only interacts with the operating system should run on any computer that operating system runs on.\n"
    },
    "es": {
      "term": "sistema operativo",
      "def": "Un programa que proporciona una interfaz estándar al hardware en el que se ejecuta. En teoría, cualquier programa que solo interactúe con el sistema operativo debería funcionar en cualquier computadora donde se ejecute ese sistema.\n"
    }
  },
  "optional_parameter": {
    "en": {
      "term": "optional_parameter",
      "def": "A [parameter](#parameter) that does not have to be given a value when a function is called. Most programming languages require programmers to define [default values](#default_value) for optional parameters, or assign them a special value automatically. Arguments passed to optional parameters will often be specified using [keyword arguments](#keyword_argument).\n"
    },
    "es": {
      "term": "parámetro opcional",
      "def": "Un [parámetro](#parameter) al que no es necesario asignarle un valor al llamar a una función. La mayoría de los lenguajes de programación requieren que se definan [valores predeterminados](#default_value), o que se les asigne un valor especial automáticamente. Los argumentos para estos parámetros suelen proporcionarse como [argumentos por palabra clave](#keyword_argument).\n"
    }
  },
  "orcid": {
    "en": {
      "term": "ORCID",
      "def": "An Open Researcher and Contributor ID that uniquely and persistently identifies an author of scholarly works. ORCIDs are for people what [DOIs](#doi) are for documents.\n"
    },
    "es": {
      "term": "ORCID",
      "def": "Un identificador abierto y persistente que identifica de manera única a autores de obras académicas. Los ORCID son para las personas lo que los [DOI](#doi) son para los documentos.\n"
    }
  },
  "orthogonality": {
    "en": {
      "term": "orthogonality",
      "def": "The ability to use various features of software in any order or combination. Orthogonal systems tend to be easier to understand, since features can be combined without worrying about unexpected interactions.\n"
    },
    "es": {
      "term": "ortogonalidad",
      "def": "La capacidad de usar diferentes características de un software en cualquier orden o combinación. Los sistemas ortogonales suelen ser más fáciles de entender, ya que sus funciones se pueden combinar sin preocuparse por interacciones inesperadas.\n"
    }
  },
  "outlier": {
    "en": {
      "term": "outlier",
      "def": "Extreme values that might be measurement or recording errors, or might actually be rare events. Outliers are sometimes ignored when doing statistics, or handled or visualized separately.\n"
    },
    "es": {
      "term": "valor atípico",
      "def": "Valores extremos que podrían ser errores de medición o registro, o eventos realmente raros. A veces se ignoran en el análisis estadístico o se manejan/visualizan por separado.\n"
    }
  },
  "overfitting": {
    "en": {
      "term": "overfitting",
      "def": "Fitting a [model](#model) so closely to one dataset that it does not generalize to others.\n"
    },
    "es": {
      "term": "sobreajuste",
      "def": "Ajustar un [modelo](#model) tan estrechamente a un conjunto de datos que no se generaliza bien a otros conjuntos.\n"
    }
  },
  "p_value": {
    "en": {
      "term": "p value",
      "def": "The probability of obtaining a result at least as strong as the one observed if the [null_hypothesis](#null_hypothesis) is [true](#true) (i.e., if variation is purely due to chance). The lower the p-value, the more likely it is that something other than chance is having an effect.\n"
    },
    "es": {
      "term": "valor p",
      "def": "La probabilidad de obtener un resultado al menos tan extremo como el observado si la [hipótesis nula](#null_hypothesis) es [cierta](#true), es decir, si la variación se debe únicamente al azar. Cuanto menor sea el valor p, mayor la probabilidad de que otro factor esté influyendo.\n"
    }
  },
  "package": {
    "en": {
      "term": "package",
      "def": "A collection of code, data, and documentation that can be distributed and re-used. Also referred to in some languages as a [library](#library) or [module](#module).\n"
    },
    "es": {
      "term": "paquete",
      "def": "Una colección de código, datos y documentación que puede distribuirse y reutilizarse. También puede denominarse [biblioteca](#library) o [módulo](#module) en algunos lenguajes.\n"
    }
  },
  "package_manager": {
    "en": {
      "term": "package manager",
      "def": "A program that does its best to keep track of the different software installed on a computer and their dependencies on one another.\n"
    },
    "es": {
      "term": "gestor de paquetes",
      "def": "Un programa que se encarga de rastrear el software instalado en una computadora y sus dependencias entre sí.\n"
    }
  },
  "pager": {
    "en": {
      "term": "pager",
      "def": "A program that displays a few lines of text at a time.\n"
    },
    "es": {
      "term": "paginador",
      "def": "Un programa que muestra unas pocas líneas de texto a la vez.\n"
    }
  },
  "pandas": {
    "en": {
      "term": "pandas",
      "def": "An open source Python package that offers fast, flexible, and expressive data structures to make working with structured data, and time series easy and intuitive. It is a powerful tool for data analysis and data manipulation.\n"
    },
    "es": {
      "term": "pandas",
      "def": "Es un paquete de Python de código abierto que ofrece estructuras de datos rápidas, flexibles y expresivas para que trabajar con series de tiempo estructuradas sea fácil e intuitivo. Se utiliza como una poderosa herramienta para el análisis y la manipulación de datos.\n"
    }
  },
  "parameter": {
    "en": {
      "term": "parameter",
      "def": "A variable specified in a function definition whose value is passed to the function when the function is called. Parameters and arguments are distinct, but related concepts. Parameters are variables and [arguments](#argument) are the values assigned to those variables.\n"
    },
    "es": {
      "term": "parámetro",
      "def": "Una variable especificada en la definición de una función cuyo valor se pasa cuando se llama la función. Parámetros y argumentos son conceptos distintos pero relacionados. Los parámetros son variables y los [argumentos](#argument) son los valores asignados a esas variables.\n"
    }
  },
  "parent_class": {
    "en": {
      "term": "parent class",
      "def": "In [object-oriented programming](#oop), the [class](#class) from which a sub class (called the [child class](#child_class)) is derived.\n"
    },
    "es": {
      "term": "superclase",
      "def": "En [programación orientada a objetos](#oop), es la clase a partir de la cual se derivan otras clases (denominadas [subclases](#child_class)).\n"
    }
  },
  "parent_directory": {
    "en": {
      "term": "parent directory",
      "def": "The [directory](#directory) that contains another directory of interest. Going from a directory to its parent, then its parent, and so on eventually leads to the [root directory](#root_directory) of the [filesystem](#filesystem).\n"
    },
    "es": {
      "term": "directorio padre",
      "def": "El [directorio](#directory) que contiene a otro directorio. Al subir desde un directorio al padre, luego al padre de ese, y así sucesivamente, se llega eventualmente al [directorio raíz](#root_directory) del [sistema de archivos](#filesystem).\n"
    }
  },
  "parent_tree": {
    "en": {
      "term": "parent (in a tree)",
      "def": "A [node](#node) in a [tree](#node) that is above another node (call a [child](#child_tree)). Every node in a tree except the [root node](#root_tree) has a single parent.\n"
    },
    "es": {
      "term": "padre (en un árbol)",
      "def": "Un [nodo](#node) en un [árbol](#node) que está por encima de otro nodo (llamado [hijo](#child_tree)). Todo nodo en un árbol, excepto la [raíz](#root_tree), tiene un solo padre.\n"
    }
  },
  "parse": {
    "en": {
      "term": "parse",
      "def": "To translate the text of a program or web page into a data structure in memory that the program can then manipulate.\n"
    },
    "es": {
      "term": "analizar sintácticamente",
      "def": "Traducir el texto de un programa o una página web a una estructura de datos en memoria que el programa pueda manipular.\n"
    }
  },
  "pass_test": {
    "en": {
      "term": "pass (a test)",
      "def": "A test passes if the [actual result](#actual_result) matches the [expected result](#expected_result).\n"
    },
    "es": {
      "term": "pasar (una prueba)",
      "def": "Una prueba pasa si el [resultado real](#actual_result) coincide con el [resultado esperado](#expected_result).\n"
    }
  },
  "patch": {
    "en": {
      "term": "patch",
      "def": "A single file containing a set of changes to a set of files, separated by markers that indicate where each individual change should be applied.\n"
    },
    "es": {
      "term": "parche",
      "def": "Un solo archivo que contiene un conjunto de cambios para un conjunto de archivos, separados por marcadores que indican dónde debe aplicarse cada cambio.\n"
    }
  },
  "path": {
    "en": {
      "term": "path (in filesystem)",
      "def": "A [string](#string) that specifies a location in a [filesystem](#filesystem). In Unix, the [directories](#directory) in a path are joined using `/`.\n"
    },
    "es": {
      "term": "ruta (en sistema de archivos)",
      "def": "Una [cadena](#string) que especifica una ubicación en un [sistema de archivos](#filesystem). En Unix, los [directorios](#directory) de una ruta se separan con `/`.\n"
    }
  },
  "pattern_rule": {
    "en": {
      "term": "pattern rule",
      "def": "A generic [build rule](#build_rule) that describes how to update any file whose name matches a pattern. Pattern rules often use [automatic variables](#automatic_variable) to represent the actual filenames.\n"
    },
    "es": {
      "term": "regla de patrón",
      "def": "Una [regla de compilación](#build_rule) genérica que describe cómo actualizar cualquier archivo cuyo nombre coincida con un patrón. Las reglas de patrón suelen usar [variables automáticas](#automatic_variable) para representar los nombres reales de los archivos.\n"
    }
  },
  "peanuts": {
    "en": {
      "term": "Peanuts",
      "def": "An American comic strip by Charles M. Schulz which has inspired the names of [R](#r_language) versions.\n"
    },
    "es": {
      "term": "Peanuts",
      "def": "Una tira cómica estadounidense de Charles M. Schulz que ha inspirado los nombres de algunas versiones de [R](#r_language).\n"
    }
  },
  "perceptron": {
    "en": {
      "term": "perceptron",
      "def": "The simplest kind of [neural network](#neural_network), which approximates a single neuron with _N_ binary inputs by computing a weighted sum of its inputs and firing if that value is zero or greater.\n"
    },
    "es": {
      "term": "perceptrón",
      "def": "El tipo más simple de [red neuronal](#neural_network), que aproxima una sola neurona con _N_ entradas binarias al calcular una suma ponderada de sus entradas y activarse si ese valor es cero o mayor.\n"
    }
  },
  "permalink": {
    "en": {
      "term": "permalink",
      "def": "Short for \"permanent link\", a URL that is intended to last forever.\n"
    },
    "es": {
      "term": "permalink",
      "def": "Abreviatura de \"enlace permanente\", una URL que se pretende que dure para siempre.\n"
    }
  },
  "phony_target": {
    "en": {
      "term": "phony target",
      "def": "A [build target](#build_target) that does not correspond to an actual file. Phony targets are often used to store commonly used commands in a [Makefile](#makefile).\n"
    },
    "es": {
      "term": "objetivo falso",
      "def": "Un [objetivo de compilación](#build_target) que no corresponde a un archivo real. Los objetivos falsos suelen usarse para almacenar comandos comunes en un [Makefile](#makefile).\n"
    }
  },
  "pip": {
    "en": {
      "term": "Pip Install Packages",
      "acronym": "PIP",
      "def": "The standard [package manager](#package_manager) for [Python](#python). pip enables the download and installation of Python packages not included in the standard library.\n"
    },
    "es": {
      "term": "Pip Install Packages",
      "acronym": "PIP",
      "def": "El [gestor de paquetes](#package_manager) estándar para [Python](#python). pip permite descargar e instalar paquetes de Python que no están incluidos en la biblioteca estándar.\n"
    }
  },
  "pipe_operator": {
    "en": {
      "term": "pipe operator",
      "def": "The `%>%` used to make the output of one function the input of the next.\n"
    },
    "es": {
      "term": "operador pipe",
      "def": "El `%>%` utilizado para hacer que la salida de una función sea la entrada de la siguiente.\n"
    }
  },
  "pipe_shell": {
    "en": {
      "term": "pipe (in the Unix shell)",
      "def": "The `|` used to make the output of one command the input of the next.\n"
    },
    "es": {
      "term": "pipe (en la shell de Unix)",
      "def": "El `|` utilizado para hacer que la salida de un comando sea la entrada del siguiente.\n"
    }
  },
  "pivot_table": {
    "en": {
      "term": "pivot table",
      "def": "A technique for summarizing tabular data in which each cell represents the sum, average, or other function of the subset of the original data identified by the cell's row and column heading.\n"
    },
    "es": {
      "term": "tabla dinámica",
      "def": "Una técnica para resumir datos tabulares en la que cada celda representa la suma, el promedio u otra función del subconjunto de los datos originales identificados por los encabezados de fila y columna.\n"
    }
  },
  "plus_one": {
    "en": {
      "term": "+1",
      "def": "A vote in favor of something.\n"
    },
    "es": {
      "term": "+1",
      "def": "Un voto a favor de alguna cosa.\n"
    }
  },
  "poisson_distribution": {
    "en": {
      "term": "Poisson distribution",
      "def": "A [discrete random distribution](#discrete_random_variable) that expresses the probability of $N$ events occurring in a fixed time interval if the events occur at a constant rate, independent of the time since the last event.\n"
    },
    "es": {
      "term": "distribución de Poisson",
      "def": "Una [distribución aleatoria discreta](#discrete_random_variable) que expresa la probabilidad de que ocurran $N$ eventos en un intervalo de tiempo fijo, si los eventos ocurren a una tasa constante e independientemente del tiempo desde el último evento.\n"
    }
  },
  "positional_argument": {
    "en": {
      "term": "positional argument",
      "def": "An argument to a function that gets its value according to its place in the function's definition, as opposed to a named argument that is explicitly matched by name.\n"
    },
    "es": {
      "term": "argumento posicional",
      "def": "Un argumento de una función cuyo valor se determina según su posición en la definición de la función, en contraste con un argumento nombrado que se empareja explícitamente por nombre.\n"
    }
  },
  "posterior_distribution": {
    "en": {
      "term": "posterior distribution",
      "def": "Probability distribution summarizing the [prior distribution](#prior_distribution) and the likelihood function."
    },
    "es": {
      "term": "distribución posterior",
      "def": "Distribución de probabilidad que resume la [distribución previa](#prior_distribution) y la función de verosimilitud."
    }
  },
  "pothole_case": {
    "en": {
      "term": "pothole case",
      "def": "A naming style that separates the parts of a name with underscores, as in `first_second_third`.\n"
    },
    "es": {
      "term": "estilo pothole",
      "def": "Un estilo de nombramiento que separa las partes de un nombre con guiones bajos, como en `primero_segundo_tercero`.\n"
    }
  },
  "preamble": {
    "en": {
      "term": "preamble",
      "def": "A series of commands, either placed in the main document, or kept in a separate document, that are included prior to the \\begin{document} command. The preamble defines the type of the document, along with other formatting attributes and parameters. This is also the section of the document where packages are added using the command \\usepackage{} to enable additional functionalities, and where custom commands can be defined.\n"
    },
    "es": {
      "term": "preámbulo",
      "def": "Una serie de comandos, colocados en el documento principal o en uno separado, que se incluyen antes del comando \\begin{document}. El preámbulo define el tipo de documento, junto con otros atributos y parámetros de formato. También es la sección donde se añaden paquetes con \\usepackage{} y se pueden definir comandos personalizados.\n"
    }
  },
  "prerequisite": {
    "en": {
      "term": "prerequisite",
      "def": "Something that a [build target](#build_target) depends on.\n"
    },
    "es": {
      "term": "prerrequisito",
      "def": "Algo de lo que depende un [objetivo de compilación](#build_target).\n"
    }
  },
  "principal_component_analysis": {
    "en": {
      "term": "principal component analysis",
      "acronym": "PCA",
      "def": "An algorithm that find the axis along which data varies most, then the axis that accounts for the largest part of the remaining variation, and so on.\n"
    },
    "es": {
      "term": "análisis de componentes principales",
      "acronym": "PCA",
      "def": "Un algoritmo que encuentra el eje a lo largo del cual los datos varían más, luego el eje que explica la mayor parte de la variación restante, y así sucesivamente.\n"
    }
  },
  "prior_distribution": {
    "en": {
      "term": "prior distribution",
      "def": "The [probability distribution](#probability_distribution) that is assumed as a starting point when using [Bayes' Theorem](#bayes_theorem) and used to construct a more accurate [posterior_distribution](#posterior_distribution).\n"
    },
    "es": {
      "term": "distribución previa",
      "def": "La [distribución de probabilidad](#probability_distribution) que se asume como punto de partida al usar el [teorema de Bayes](#bayes_theorem), y que se usa para construir una [distribución posterior](#posterior_distribution) más precisa.\n"
    }
  },
  "prng": {
    "en": {
      "term": "pseudo-random number generator",
      "acronym": "PRNG",
      "def": "A function that can generate [pseudo-random numbers](#pseudo_random_number).\n"
    },
    "es": {
      "term": "generador de números pseudoaleatorios",
      "acronym": "PRNG",
      "def": "Una función que puede generar [números pseudoaleatorios](#pseudo_random_number).\n"
    }
  },
  "probability_distribution": {
    "en": {
      "term": "probability distribution",
      "def": "A mathematical description of all possible outcomes of a random event, and the probability of each occurring.\n"
    },
    "es": {
      "term": "distribución de probabilidad",
      "def": "Una descripción matemática de todos los resultados posibles de un evento aleatorio, y la probabilidad de que ocurra cada uno.\n"
    }
  },
  "procedural_programming": {
    "en": {
      "term": "procedural programming",
      "def": "A style of programming in which functions operate on data that is passed into them. The term is used in contrast to other programming styles, such as [object-oriented programming](#oop) and [functional programming](#functional_programming).\n"
    },
    "es": {
      "term": "programación procedural",
      "def": "Un estilo de programación en el que las funciones operan sobre datos que se les pasan. El término se usa en contraste con otros estilos de programación, como la [orientada a objetos](#oop) o la [funcional](#functional_programming).\n"
    }
  },
  "process": {
    "en": {
      "term": "process",
      "def": "An [operating system](#operating_system)'s representation of a running program. A process typically has some memory, the identity of the user who is running it, and a set of connections to open files.\n"
    },
    "es": {
      "term": "proceso",
      "def": "La representación de un programa en ejecución para un [sistema operativo](#operating_system). Un proceso típicamente tiene memoria, la identidad del usuario que lo ejecuta y un conjunto de conexiones a archivos abiertos.\n"
    }
  },
  "product_manager": {
    "en": {
      "term": "product manager",
      "def": "The person responsible for defining what features a product should have.\n"
    },
    "es": {
      "term": "gerente de producto",
      "def": "La persona responsable de definir qué características debe tener un producto.\n"
    }
  },
  "production_code": {
    "en": {
      "term": "production code",
      "def": "Software that is delivered to an end user. The term is used to distinguish such code from test code, deployment infrastructure, and everything else that programmers write along the way.\n"
    },
    "es": {
      "term": "código de producción",
      "def": "Software que se entrega a un usuario final. El término se usa para distinguir este código del código de prueba, la infraestructura de despliegue y todo lo demás que escriben los programadores durante el desarrollo.\n"
    }
  },
  "project_manager": {
    "en": {
      "term": "project manager",
      "def": "The person responsible for ensuring that a project moves forward.\n"
    },
    "es": {
      "term": "gerente de proyecto",
      "def": "La persona responsable de asegurar que un proyecto avance.\n"
    }
  },
  "prompt": {
    "en": {
      "term": "prompt",
      "def": "The text printed by an [REPL](#repl) or [shell](#shell) that indicates it is ready to accept another command. The default prompt in the Unix shell is usually `$`, while in [Python](#python) it is `>>>`, and in [R](#r_language) it is `>`.\n"
    },
    "es": {
      "term": "prompt",
      "def": "El texto impreso por un [REPL](#repl) o una [shell](#shell) que indica que está listo para aceptar otro comando. El prompt predeterminado en la shell de Unix suele ser `$`, en [Python](#python) es `>>>`, y en [R](#r_language) es `>`.\n"
    }
  },
  "protocol": {
    "en": {
      "term": "protocol",
      "def": "Any standard specifying how two pieces of software interact. A network protocol such as [HTTP](#http) defines the messages that [clients](#client) and [servers](#server) exchange on the World-Wide Web; [object-oriented](#oop) programs often define protocols for interactions between [objects](#object) of different [classes](#class).\n"
    },
    "es": {
      "term": "protocolo",
      "def": "Cualquier estándar que especifique cómo interactúan dos piezas de software. Un protocolo de red como [HTTP](#http) define los mensajes que intercambian [clientes](#client) y [servidores](#server) en la web; los programas [orientados a objetos](#oop) suelen definir protocolos para las interacciones entre [objetos](#object) de distintas [clases](#class).\n"
    }
  },
  "provenance": {
    "en": {
      "term": "provenance",
      "def": "A record of where data originally came from and what was done to process it.\n"
    },
    "es": {
      "term": "procedencia",
      "def": "Un registro del origen de los datos y de lo que se hizo para procesarlos.\n"
    }
  },
  "pseudo_random_number": {
    "en": {
      "term": "pseudo-random number",
      "def": "A value generated in a repeatable way that resembles the [true](#true) randomness of the universe well enough to fool observers.\n"
    },
    "es": {
      "term": "número pseudo-aleatorio",
      "def": "Un valor generado de forma repetible que refleja suficientemente bien a la verdadera aleatoriedad del universo como para engañar a simples observadores mortales.\n"
    }
  },
  "psf": {
    "en": {
      "term": "Python Software Foundation",
      "acronym": "PSF",
      "def": "A non-profit organization that oversees and promotes the development and use of [Python](#python).\n"
    },
    "es": {
      "term": "Fundación para el Software Python",
      "acronym": "PSF",
      "def": "Una organización sin fines de lucro que supervisa y promueve el desarrollo y uso de [Python](#python).\n"
    }
  },
  "pull_indexing": {
    "en": {
      "term": "pull indexing",
      "def": "Vectorized indexing in which the value at location `i` in the index [vector](#vector) specifies which [element](#element) of the source vector is being pulled into that location in the result vector, i.e., `result[i] = source[index[i]]`.\n"
    },
    "es": {
      "term": "indexación por extracción",
      "def": "Indexación vectorizada en la que el valor en la posición `i` del [vector](#vector) de índices especifica qué [elemento](#element) del vector fuente se extrae a esa posición en el vector resultado, es decir, `resultado[i] = fuente[índice[i]]`.\n"
    }
  },
  "pull_request": {
    "en": {
      "term": "pull request",
      "def": "The request to merge a new feature or correction created on a user's [fork](#fork) of a [Git](#git) [repository](#repository) into the [upstream repository](#upstream_repository). The developer will be notified of the change, review it, make or suggest changes, and potentially [merge](#git_merge) it.\n"
    },
    "es": {
      "term": "pull request",
      "def": "La solicitud para fusionar una nueva función o corrección creada en un [fork](#fork) de un [repositorio](#repository) de [Git](#git) de un usuario en el [repositorio principal](#upstream_repository). El desarrollador será notificado del cambio, lo revisará, realizará o sugerirá cambios, y potencialmente lo [fusionará](#git_merge).\n"
    }
  },
  "push_indexing": {
    "en": {
      "term": "push indexing",
      "def": "Vectorized indexing in which the value at location `i` in the index [vector](#vector) specifies an [element](#element) of the result vector that gets the corresponding element of the source vector, i.e., `result[index[i]] = source[i]`. Push indexing can easily produce gaps and collisions.\n"
    },
    "es": {
      "term": "indexación por inserción",
      "def": "Indexación vectorizada en la que el valor en la posición `i` del [vector](#vector) de índices especifica un [elemento](#element) del vector resultado que recibe el elemento correspondiente del vector fuente, es decir, `resultado[índice[i]] = fuente[i]`. Esta técnica puede generar huecos y colisiones fácilmente.\n"
    }
  },
  "pypi": {
    "en": {
      "term": "Python Package Index",
      "acronym": "PyPI",
      "def": "The official third-party software repository for [Python](#python). Anyone can upload a [package](#package) to PyPI. PyPI packages may install via executed scripts or pre-compiled, system-specific wheels.\n"
    },
    "es": {
      "term": "Índice de Paquetes de Python",
      "acronym": "PyPI",
      "def": "El repositorio oficial de software de terceros para [Python](#python). Cualquiera puede subir un [paquete](#package) a PyPI. Los paquetes pueden instalarse mediante scripts ejecutables o archivos precompilados específicos del sistema (wheels).\n"
    }
  },
  "python": {
    "en": {
      "term": "Python",
      "def": "A popular interpreted open-source programming language that relies on indentation to define control structure.\n"
    },
    "es": {
      "term": "Python",
      "def": "Un lenguaje de programación de código abierto interpretado popular que se basa en la sangría para definir la estructura de control.\n"
    }
  },
  "quantile": {
    "en": {
      "term": "quantile",
      "def": "If a set of sorted values are divided into groups of each size, each group is called a quantile. For example, if there are five groups, each is called a *quintile*; the bottom quintile contains the lowest 20% of the values, while the top quintile contains the highest 20%.\n"
    },
    "es": {
      "term": "cuantil",
      "def": "Si un conjunto de valores ordenados se divide en grupos del mismo tamaño, cada grupo se llama cuantil. Por ejemplo, si hay cinco grupos, cada uno se llama *quintil*; el quintil inferior contiene el 20% más bajo de los valores, mientras que el superior contiene el 20% más alto.\n"
    }
  },
  "query_string": {
    "en": {
      "term": "query string",
      "def": "The portion of a [URL](#url) after the question mark `?` that specifies extra parameters for the [HTTP request](#http_request) as name-value pairs.\n"
    },
    "es": {
      "term": "cadena de consulta",
      "def": "La parte de una [URL](#url) después del signo de interrogación `?` que especifica parámetros adicionales para la [solicitud HTTP](#http_request) como pares nombre-valor.\n"
    }
  },
  "quosure": {
    "en": {
      "term": "quosure",
      "def": "A data structure containing an unevaluated expression and its environment.\n"
    },
    "es": {
      "term": "quosure",
      "def": "Una estructura de datos que contiene una expresión no evaluada y su entorno.\n"
    }
  },
  "quoting_function": {
    "en": {
      "term": "quoting function",
      "def": "A function that is passed expressions rather than the values of those expressions.\n"
    },
    "es": {
      "term": "función de entrecomillado",
      "def": "Una función a la que se le pasan expresiones en lugar de los valores de esas expresiones.\n"
    }
  },
  "r_consortium": {
    "en": {
      "term": "R Consortium",
      "def": "A group that supports the worldwide community of users, maintainers and developers of [R](#r_language). Its members include leading institutions and companies dedicated to the use, development, and growth of R.\n"
    },
    "es": {
      "term": "Consorcio R",
      "def": "Un grupo que apoya a la comunidad mundial de usuarios, mantenedores y desarrolladores de [R](#r_language). Sus miembros incluyen instituciones y empresas líderes dedicadas al uso, desarrollo y crecimiento de R.\n"
    }
  },
  "r_foundation": {
    "en": {
      "term": "R Foundation",
      "def": "A non-profit founded by the R development core team providing support for [R](#r_language). It is a member of the [R Consortium](#r_consortium).\n"
    },
    "es": {
      "term": "Fundación R",
      "def": "Una organización sin fines de lucro fundada por el equipo central de desarrollo de R para brindar apoyo a [R](#r_language). Es miembro del [Consorcio R](#r_consortium).\n"
    }
  },
  "r_hub": {
    "en": {
      "term": "R Hub",
      "def": "A free platform available to check an [R](#r_language) [package](#package) on several different platforms in preparation for the CRAN submission process.\n"
    },
    "es": {
      "term": "R Hub",
      "def": "Una plataforma gratuita disponible para verificar un [paquete](#package) de [R](#r_language) en varias plataformas diferentes como preparación para el proceso de envío a CRAN.\n"
    }
  },
  "r_language": {
    "en": {
      "term": "R (programming language)",
      "def": "A popular open-source programming language used primarily for data science.\n"
    },
    "es": {
      "term": "R (lenguaje de programación)",
      "def": "Un lenguaje de programación de código abierto muy popular, utilizado principalmente en ciencia de datos.\n"
    }
  },
  "r_markdown": {
    "en": {
      "term": "R Markdown",
      "def": "A dialect of [Markdown](#markdown) that allows authors to mix prose and code (usually written in [R](#r_language)) in a single document.\n"
    },
    "es": {
      "term": "R Markdown",
      "def": "Un dialecto de [Markdown](#markdown) que permite a sus autores mezclar prosa y código (usualmente escrito en [R](#r_language)) en un mismo documento.\n"
    }
  },
  "raise_exception": {
    "en": {
      "term": "raise (an exception)",
      "def": "To signal that something unexpected or unusual has happened in a program by creating an [exception](#exception) and handing it to the [error-handling](#error_handling) system, which then tries to find a point in the program that will [catch](#catch_exception) it.\n"
    },
    "es": {
      "term": "lanzar (una excepción)",
      "def": "Señalar que algo inesperado o inusual ha ocurrido en un programa creando una [excepción](#exception) y pasándola al sistema de [manejo de errores](#error_handling), que luego intenta encontrar un punto en el programa que la [capture](#catch_exception).\n"
    }
  },
  "random_forests": {
    "en": {
      "term": "random forests",
      "def": "An algorithm used for regression or [classification](#classification) that uses a collection of [decision trees](#decision_tree), called a forest. Each tree votes for a classification, and the algorithm chooses the classification having the most votes over all the trees in the forest.\n"
    },
    "es": {
      "term": "bosques aleatorios",
      "def": "Un algoritmo utilizado para regresión o [clasificación](#classification) que emplea un conjunto de [árboles de decisión](#decision_tree), llamado un bosque. Cada árbol vota por una clasificación, y el algoritmo elige la clasificación con más votos entre todos los árboles del bosque.\n"
    }
  },
  "raster_image": {
    "en": {
      "term": "raster image",
      "def": "An image stored as a matrix of pixels.\n"
    },
    "es": {
      "term": "imagen rasterizada",
      "def": "Una imagen almacenada como una matriz de píxeles.\n"
    }
  },
  "reactive_programming": {
    "en": {
      "term": "reactive programming",
      "def": "A style of programming in which actions are triggered by external events.\n"
    },
    "es": {
      "term": "programación reactiva",
      "def": "Un estilo de programación en el que las acciones se desencadenan por eventos externos.\n"
    }
  },
  "reactive_variable": {
    "en": {
      "term": "reactive variable",
      "def": "A variable whose value is automatically updated when some other value or values change. Reactive variables are used extensively in [Shiny](#shiny).\n"
    },
    "es": {
      "term": "variable reactiva",
      "def": "Una variable cuyo valor se actualiza automáticamente cuando otro u otros valores cambian. Las variables reactivas se utilizan ampliamente en [Shiny](#shiny).\n"
    }
  },
  "readme": {
    "en": {
      "term": "README",
      "def": "A plain text file containing important information about a project or software package.\n"
    },
    "es": {
      "term": "README",
      "def": "Un archivo de texto plano que contiene información importante sobre un proyecto o paquete de software.\n"
    }
  },
  "reciprocal": {
    "en": {
      "term": "reciprocal",
      "def": "The reciprocal of a number x is 1 / x, or alternatively x raised to the power of -1.\n"
    },
    "es": {
      "term": "recíproco",
      "def": "El recíproco de un número x es 1 / x, o alternativamente x elevado a la potencia de -1.\n"
    }
  },
  "record": {
    "en": {
      "term": "record",
      "def": "A group of related values that are stored together. A record may be represented as a [tuple](#tuple) or as a row in a [table](#table); in the latter case, every record in the table has the same [fields](#field).\n"
    },
    "es": {
      "term": "registro",
      "def": "Un grupo de valores relacionados que se almacenan juntos. Un registro puede representarse como una [tupla](#tuple) o como una fila en una [tabla](#table); en este último caso, cada registro en la tabla tiene los mismos [campos](#field).\n"
    }
  },
  "recursion": {
    "en": {
      "term": "recursion",
      "def": "Calling a function from within a call to that function, or defining a term using a simpler version of the same term.\n"
    },
    "es": {
      "term": "recursión",
      "def": "Llamar a una función desde una llamada a esa misma función, o definir un término utilizando una versión más simple del mismo término.\n"
    }
  },
  "recycle": {
    "en": {
      "term": "recycle",
      "def": "To re-use values from a shorter [vector](#vector) in order to generate a sequence of the same length as a longer one. In [Python](#python) NumPy, this is called broadcasting.\n"
    },
    "es": {
      "term": "reciclar",
      "def": "Reutilizar valores de un vector más corto con el fin de generar una secuencia del mismo largo que el vector más largo.\n"
    }
  },
  "redirection": {
    "en": {
      "term": "redirection",
      "def": "To send a request for a web page or web service to a different page or service.\n"
    },
    "es": {
      "term": "redirección",
      "def": "Enviar una solicitud para una página web o servicio web a una página o servicio diferente.\n"
    }
  },
  "refactoring": {
    "en": {
      "term": "refactoring",
      "def": "Reorganizing software without changing its behavior.\n"
    },
    "es": {
      "term": "refactorización",
      "def": "Reorganizar el software sin cambiar su comportamiento.\n"
    }
  },
  "regression_testing": {
    "en": {
      "term": "regression testing",
      "def": "Testing software to ensure that things which used to work have not been broken.\n"
    },
    "es": {
      "term": "pruebas de regresión",
      "def": "Probar el software para asegurarse de que las cosas que solían funcionar no se hayan roto.\n"
    }
  },
  "regular_expression": {
    "en": {
      "term": "regular expression",
      "def": "A pattern for matching text, written as text itself. Regular expressions are sometimes called \"regexp\", \"regex\", or \"RE\", and are powerful tools for working with text.\n"
    },
    "es": {
      "term": "expresión regular",
      "def": "Un patrón para buscar coincidencias en texto, que están a su vez escritas como texto. Las expresiones regulares a veces son llamadas \"regexp\", \"regex\", o \"RE\", y son poderosas.\n"
    }
  },
  "reinforcement_learning": {
    "en": {
      "term": "reinforcement learning",
      "def": "Any [machine learning](#machine_learning) algorithm which is not given specific goals to meet, but instead is given feedback on whether or not it is making progress.\n"
    },
    "es": {
      "term": "aprendizaje por refuerzo",
      "def": "Cualquier algoritmo de [aprendizaje automático](#machine_learning) al que no se le asignan metas específicas, sino que se le proporciona retroalimentación sobre si está progresando o no.\n"
    }
  },
  "relational_database": {
    "en": {
      "term": "relational database",
      "def": "A database that organizes information into [tables](#table), each of which has a fixed set of named [fields](#field) (shown as columns) and a variable number of [records](#record) (shown as rows).\n"
    },
    "es": {
      "term": "base de datos relacional",
      "def": "Una base de datos que organiza la información en [tablas](#table), cada una de las cuales tiene un set fijo de [campos](#field) con nombre (que se muestran como columnas) y un número variable de [registros](#record) (que se muestran como filas).\n"
    }
  },
  "relative_error": {
    "en": {
      "term": "relative error",
      "def": "The absolute value of the difference between the actual and correct value divided by the correct value. For example, if the actual value is 9 and the correct value is 10, the relative error is 0.1. Relative error is usually more useful than [absolute error](#absolute_error).\n"
    },
    "es": {
      "term": "error relativo",
      "def": "El valor absoluto de la diferencia entre el valor observado y el valor correcto, dividido por el valor deseado. Por ejemplo, si el valor observado es 9 y el valor correcto es 10, el error relativo es 0.1. El error relativo suele ser más útil que el [error absoluto](#absolute_error).\n"
    }
  },
  "relative_path": {
    "en": {
      "term": "relative path",
      "def": "A path whose destination is interpreted relative to some other location, such as the [current working directory](#current_working_directory). A relative path is the equivalent of giving directions using terms like \"straight\" and \"left\".\n"
    },
    "es": {
      "term": "ruta relativa",
      "def": "Una ruta cuyo destino se interpreta en relación con otra ubicación, como el [directorio de trabajo actual](#current_working_directory). Una ruta relativa es el equivalente a dar direcciones usando términos como \"recto\" y \"izquierda\".\n"
    }
  },
  "relative_row_number": {
    "en": {
      "term": "relative row number",
      "def": "The index of a row in a displayed portion of a table, which may or may not be the same as the [absolute row number](#absolute_row_number) within the table.\n"
    },
    "es": {
      "term": "número de fila relativo",
      "def": "El índice de una fila en la parte mostrada de una tabla, que puede o no coincidir con el [número de fila absoluto](#absolute_row_number) dentro de la tabla.\n"
    }
  },
  "remote_login": {
    "en": {
      "term": "remote login",
      "def": "Starting an interactive session on one computer from another computer, e.g., by using [SSH](#ssh).\n"
    },
    "es": {
      "term": "inicio de sesión remoto",
      "def": "Iniciar una sesión interactiva en una computadora desde otra computadora, por ejemplo, usando [SSH](#ssh).\n"
    }
  },
  "remote_repository": {
    "en": {
      "term": "remote repository",
      "def": "A [repository](#repository) located on another computer. Tools such as [Git](#git) are designed to synchronize changes between local and remote repositories in order to share work.\n"
    },
    "es": {
      "term": "repositorio remoto",
      "def": "Un [repositorio](#repository) ubicado en otra computadora. Herramientas como [Git](#git) están diseñadas para sincronizar cambios entre repositorios locales y remotos para compartir trabajo.\n"
    }
  },
  "repl": {
    "en": {
      "term": "read-eval-print loop",
      "acronym": "REPL",
      "def": "An interactive program that reads a command typed in by a user, executes it, prints the result, and then waits patiently for the next command. REPLs are often used to explore new ideas, or for debugging.\n"
    },
    "es": {
      "term": "bucle leer-evaluar-imprimir",
      "acronym": "REPL",
      "def": "Un programa interactivo que lee un comando escrito por el usuario, lo ejecuta, imprime el resultado y luego espera pacientemente el siguiente comando. Los REPL se usan a menudo para explorar nuevas ideas o para depurar.\n"
    }
  },
  "repository": {
    "en": {
      "term": "repository",
      "def": "A place where a [version control system](#version_control_system) stores the files that make up a project and the metadata that describes their history.\n"
    },
    "es": {
      "term": "repositorio",
      "def": "Lugar en el que un [sistema de control de versión](#version_control_system) guarda los archivos que conforman un proyecto y los metadatos que describen su historia.\n"
    }
  },
  "reprex": {
    "en": {
      "term": "reprex",
      "def": "A reproducible example. When asking questions about coding problems online or filing issues on [GitHub](#github), you should always include a reprex so others can reproduce your problem and help. The [reprex](https://github.com/tidyverse/reprex) package can help!\n"
    },
    "es": {
      "term": "reprex",
      "def": "Un ejemplo reproducible. Al hacer preguntas sobre problemas de programación en línea o al reportar errores en [GitHub](#github), siempre debes incluir un reprex para que otros puedan reproducir el problema y ayudarte. ¡El paquete [reprex](https://github.com/tidyverse/reprex) puede ayudarte!\n"
    }
  },
  "reproducible_example": {
    "en": {
      "term": "reproducible example",
      "def": "See [reprex](#reprex).\n"
    },
    "es": {
      "term": "ejemplo reproducible",
      "def": "Ver [reprex](#reprex).\n"
    }
  },
  "reproducible_research": {
    "en": {
      "term": "reproducible research",
      "def": "The practice of describing and documenting research results in such a way that another researcher or person can re-run the analysis code on the same data to obtain the same result.\n"
    },
    "es": {
      "term": "investigación reproducible",
      "def": "La práctica de describir y documentar los resultados de una investigación de manera que otra persona o investigador pueda volver a ejecutar el código de análisis con los mismos datos y obtener el mismo resultado.\n"
    }
  },
  "reserved_word": {
    "en": {
      "term": "reserved word",
      "def": "A word (character string) with a distinct meaning for a programming or scripting language. Typically, reserved words cannot be used as names for variables or constants, as this would confuse the compiler or interpreter.\n"
    },
    "es": {
      "term": "palabra reservada",
      "def": "Una palabra (cadena de caracteres) con un significado específico en un lenguaje de programación o secuencias de comandos. Normalmente, las palabras reservadas no se pueden usar como nombres de variables o constantes, ya que esto confundiría al compilador o al intérprete.\n"
    }
  },
  "restructured_text": {
    "en": {
      "term": "reStructured Text",
      "acronym": "reST",
      "def": "A plaintext [markup](#markup_language) format used primarily in [Python](#python) documentation.\n"
    },
    "es": {
      "term": "reStructured Text",
      "acronym": "reST",
      "def": "Un formato de [lenguaje de marcado](#markup_language) en texto plano utilizado principalmente en la documentación de [Python](#python).\n"
    }
  },
  "revision": {
    "en": {
      "term": "revision",
      "def": "See [commit](#commit).\n"
    },
    "es": {
      "term": "revisión",
      "def": "Ver [commit](#commit).\n"
    }
  },
  "right_join": {
    "en": {
      "term": "right join",
      "def": "A [join](#join) that combines data from two tables, A and B. Where [keys](#key) in table A match keys in table B, [fields](#field) are concatenated. Where a key in table B does *not* match a key in table A, columns from table A are filled with [null](#null), [NA](#na), or some other [missing value](#missing_value) signifier. Keys from table A that do not exist in table B are dropped.\n"
    },
    "es": {
      "term": "right join",
      "def": "Una [unión](#join) que combina datos de dos tablas, A y B. Donde las [claves](#key) en la tabla A coinciden con las claves en la tabla B, se concatenan los [campos](#field). Cuando una clave en la tabla B *no* coincide con una clave en la tabla A, las columnas de la tabla A se llenan con [null](#null), [NA](#na) u otro indicador de [valor faltante](#missing_value). Las claves de la tabla A que no existen en la tabla B se descartan.\n"
    }
  },
  "root_directory": {
    "en": {
      "term": "root directory",
      "def": "The [directory](#directory) that contains everything else, either directly or indirectly. The root directory is written `/` (a bare forward slash).\n"
    },
    "es": {
      "term": "directorio raíz",
      "def": "El [directorio](#directory) que contiene todo lo demás, ya sea directa o indirectamente. El directorio raíz se representa como `/` (una barra diagonal simple).\n"
    }
  },
  "root_math": {
    "en": {
      "term": "n-th root",
      "def": "The n-th root of a positive number x is the number that when multiplied by itself n times produces x. This can commonly be calculated by raising x to the power of the [reciprocal](#reciprocal) of n.\n"
    },
    "es": {
      "term": "raíz enésima",
      "def": "La raíz enésima de un número positivo x es el número que al multiplicarse por sí mismo n veces produce x. Esto normalmente se calcula elevando x a la potencia del [recíproco](#reciprocal) de n.\n"
    }
  },
  "root_mean_squared_error": {
    "en": {
      "term": "root mean squared error",
      "acronym": "RMSE",
      "def": "The [square root](#square_root) of the [mean squared error](#mean_squared_error). Like the [standard deviation](#standard_deviation), it is in the same units as the original data.\n"
    },
    "es": {
      "term": "raíz del error cuadrático medio",
      "acronym": "RECM",
      "def": "La raíz cuadrada del [error cuadrático medio](#mean_squared_error). Como la [desviación estándar](#standard_deviation), está en las mismas unidades que los datos originales.\n"
    }
  },
  "root_tree": {
    "en": {
      "term": "root (in a tree)",
      "def": "The [node](#node) in a [tree](#tree) of which all other nodes are direct or indirect [children](#child_tree), or equivalently the only node in the tree that has no [parent](#parent_tree).\n"
    },
    "es": {
      "term": "raíz (en un árbol)",
      "def": "El [nodo](#node) en un [árbol](#tree) del cual todos los demás nodos son [hijos](#child_tree) directos o indirectos, o equivalente, el único nodo en el árbol que no tiene [padre](#parent_tree).\n"
    }
  },
  "rotating_file": {
    "en": {
      "term": "rotating file",
      "def": "A set of files used to store recent information. For example, there might be one file with results for each day of the week, so that results from last Tuesday are overwritten this Tuesday.\n"
    },
    "es": {
      "term": "archivo rotativo",
      "def": "Un conjunto de archivos utilizados para almacenar información reciente. Por ejemplo, puede haber un archivo con resultados para cada día de la semana, de modo que los resultados del martes pasado se sobrescriben este martes.\n"
    }
  },
  "rse": {
    "en": {
      "term": "research software engineer",
      "acronym": "RSE",
      "def": "Someone whose primary responsibility is to build the specialized software that other researchers depend on.\n"
    },
    "es": {
      "term": "ingeniero/a de software de investigación",
      "acronym": "RSE",
      "def": "Alguien cuya responsabilidad principal es desarrollar el software especializado del cual dependen otros investigadores.\n"
    }
  },
  "s3": {
    "en": {
      "term": "S3",
      "def": "A framework for [object-oriented programming](#oop) in [R](#r_language).\n"
    },
    "es": {
      "term": "S3",
      "def": "Un entorno para la [programación orientada a objetos](#oop) en [R](#r_language).\n"
    }
  },
  "s4": {
    "en": {
      "term": "S4",
      "def": "A framework for [object-oriented programming](#oop) in [R](#r_language).\n"
    },
    "es": {
      "term": "S4",
      "def": "Un marco para la [programación orientada a objetos](#oop) en [R](#r_language).\n"
    }
  },
  "s_language": {
    "en": {
      "term": "S",
      "def": "A language originally developed in Bell Labs for data analysis, statistical modeling, and graphics. [R](#r_language) is a dialect of S.\n"
    },
    "es": {
      "term": "S",
      "def": "Un lenguaje para análisis de datos, modelado estadístico y gráficos desarrollado originalmente en los Laboratorios Bell. [R](#r_language) es un dialecto de S.\n"
    }
  },
  "sandbox": {
    "en": {
      "term": "sandbox",
      "def": "A testing environment that is separate from the production system, or an environment that is only allowed to perform a restricted set of operations for security reasons.\n"
    },
    "es": {
      "term": "sandbox (entorno de pruebas)",
      "def": "Un entorno de pruebas que está separado del sistema de producción, o un entorno que solo puede realizar un conjunto restringido de operaciones por razones de seguridad.\n"
    }
  },
  "schema": {
    "en": {
      "term": "schema",
      "def": "A specification of the format of a dataset, including the name, format, and content of each [table](#table).\n"
    },
    "es": {
      "term": "esquema",
      "def": "Una especificación del formato de un conjunto de datos, incluyendo el nombre, el formato y el contenido de cada [tabla](#table).\n"
    }
  },
  "scope": {
    "en": {
      "term": "scope",
      "def": "The portion of a program within which a definition can be seen and used. See [closure](#closure), [global variable](#global_variable), and [local variable](#local_variable).\n"
    },
    "es": {
      "term": "alcance",
      "def": "La parte de un programa dentro de la cual se puede ver y usar una definición. Ver también [closure](#closure), [variable global](#global_variable) y [variable local](#local_variable).\n"
    }
  },
  "script": {
    "en": {
      "term": "script",
      "def": "Originally, a program written in a language too user-friendly for \"real\" programmers to take seriously; the term is now synonymous with program.\n"
    },
    "es": {
      "term": "script",
      "def": "Originalmente, un programa escrito en un lenguaje demasiado fácil de usar como para que los \"programadores serios\" lo tomaran en serio; el término ahora es sinónimo de programa.\n"
    }
  },
  "search_path": {
    "en": {
      "term": "search path",
      "def": "The list of directories that a program searches to find something. For example, the Unix [shell](#shell) uses the search path stored in the `PATH` variable when trying to find a program whose name it has been given.\n"
    },
    "es": {
      "term": "ruta de búsqueda",
      "def": "La lista de directorios que un programa revisa para encontrar algo. Por ejemplo, la [shell](#shell) de Unix usa la ruta de búsqueda almacenada en la variable `PATH` al intentar encontrar un programa por su nombre.\n"
    }
  },
  "seed": {
    "en": {
      "term": "seed",
      "def": "A value used to initialize a [pseudo-random number generator](#prng).\n"
    },
    "es": {
      "term": "semilla",
      "def": "Un valor usado para inicializar un [generador de números pseudoaleatorios](#prng).\n"
    }
  },
  "select": {
    "en": {
      "term": "select",
      "def": "To choose entire columns or rows from a table by name or location.\n"
    },
    "es": {
      "term": "seleccionar",
      "def": "Elegir columnas o filas completas de una tabla por nombre o ubicación.\n"
    }
  },
  "self_join": {
    "en": {
      "term": "self join",
      "def": "A [join](#join) that combines a table with itself.\n"
    },
    "es": {
      "term": "autounión",
      "def": "Una [unión](#join) que combina una tabla consigo misma.\n"
    }
  },
  "semantic_versioning": {
    "en": {
      "term": "semantic versioning",
      "def": "A standard for identifying software releases. In the version identifier `major.minor.patch`, `major` changes when a new version of software is incompatible with old versions, `minor` changes when new features are added to an existing version, and `patch` changes when small [bugs](#bug) are fixed.\n"
    },
    "es": {
      "term": "versionado semántico",
      "def": "Un estándar para identificar versiones de software. En el identificador de versión `major.minor.patch`, `major` cambia cuando una nueva versión del software es incompatible con versiones anteriores, `minor` cambia cuando se agregan nuevas funcionalidades, y `patch` cambia cuando se corrigen pequeños [errores](#bug).\n"
    }
  },
  "sense_vote": {
    "en": {
      "term": "sense vote",
      "def": "A preliminary vote used to determine whether further discussion is needed in a meeting.\n"
    },
    "es": {
      "term": "votación preliminar",
      "def": "Una votación preliminar utilizada para determinar si se necesita más discusión en una reunión.\n"
    }
  },
  "sequential_data": {
    "en": {
      "term": "sequential data",
      "def": "Any list of data items where the order is an inherent property of the list. Often the next item in the list is dependent on the previous item or items.\n"
    },
    "es": {
      "term": "datos secuenciales",
      "def": "Cualquier lista de elementos de datos donde el orden es una propiedad inherente. A menudo, el siguiente elemento depende del anterior o anteriores.\n"
    }
  },
  "server": {
    "en": {
      "term": "server",
      "def": "Typically, a program such as a database manager or web server that provides data to a [client](#client) upon request.\n"
    },
    "es": {
      "term": "servidor",
      "def": "Típicamente, un programa como un administrador de base de datos o servidor web que proporciona datos a un [cliente](#client) bajo solicitud.\n"
    }
  },
  "shebang": {
    "en": {
      "term": "shebang",
      "def": "In Unix, a character sequence such as `#!/usr/bin/python` in the first line of an executable file that tells the [shell](#shell) what program to use to run that file.\n"
    },
    "es": {
      "term": "shebang",
      "def": "En Unix, una secuencia de caracteres como `#!/usr/bin/python` en la primera línea de un archivo ejecutable que le indica al [shell](#shell) qué programa usar para ejecutar ese archivo.\n"
    }
  },
  "shell": {
    "en": {
      "term": "shell",
      "def": "A [command-line interface](#cli) that allows a user to interact with the [operating system](#operating_system), such as Bash (for Unix and MacOS) or PowerShell (for Windows).\n"
    },
    "es": {
      "term": "shell",
      "def": "Una [interfaz de línea de comandos](#cli) que permite a un usuario interactuar con el [sistema operativo](#operating_system), como Bash (para Unix y MacOS) o PowerShell (para Windows).\n"
    }
  },
  "shell_script": {
    "en": {
      "term": "shell script",
      "def": "A set of commands for the [shell](#shell) stored in a file so that they can be re-executed. A shell script is effectively a program.\n"
    },
    "es": {
      "term": "script de shell",
      "def": "Un conjunto de comandos para el [shell](#shell) almacenados en un archivo para que puedan ser ejecutados nuevamente. Un script de shell es efectivamente un programa.\n"
    }
  },
  "shell_variable": {
    "en": {
      "term": "shell variable",
      "def": "A variable set and used in the [Unix shell](#shell). Commonly used shell variables include `HOME` (the user's home directory) and `PATH` (their [search path](#search_path)).\n"
    },
    "es": {
      "term": "variable de shell",
      "def": "Una variable definida y utilizada en el [shell de Unix](#shell). Variables comunes incluyen `HOME` (el directorio personal del usuario) y `PATH` (su [ruta de búsqueda](#search_path)).\n"
    }
  },
  "shiny": {
    "en": {
      "term": "Shiny",
      "def": "A [R](#r_language) [package](#package) that makes it simple to build web applications to interactively visualise and manipulate data. Often used to make interactive [graphs](graph) and [tables](#table) straight from [R](#r_language) without having to know [HTML](#html), [CSS](#css) or JavaScript.\n"
    },
    "es": {
      "term": "Shiny",
      "def": "Un [paquete](#package) de [R](#r_language) que facilita la creación de aplicaciones web para visualizar y manipular datos de forma interactiva. A menudo se utiliza para crear [gráficas](#graph) y [tablas](#table) interactivas directamente desde [R](#r_language) sin necesidad de conocer [HTML](#html), [CSS](#css) o JavaScript.\n"
    }
  },
  "short_circuit_test": {
    "en": {
      "term": "short circuit test",
      "def": "A logical test that only evaluates as many arguments as it needs to. For example, if `A` is [false](#false), then most languages never evaluate `B` in the expression `A and B`.\n"
    },
    "es": {
      "term": "evaluación de cortocircuito",
      "def": "Una prueba lógica que solo evalúa tantos argumentos como sea necesario. Por ejemplo, si `A` es [falso](#false), la mayoría de los lenguajes nunca evalúan `B` en la expresión `A and B`.\n"
    }
  },
  "short_identifier_git": {
    "en": {
      "term": "short identifier (of commit)",
      "def": "The first few characters of a [full identifier](#full_identifier_git). Short identifiers are easy for people to type and say aloud, and are usually unique within a [repository's](#repository) recent history.\n"
    },
    "es": {
      "term": "identificador corto (de commit)",
      "def": "Los primeros caracteres de un [identificador completo](#full_identifier_git). Los identificadores cortos son fáciles de escribir y decir en voz alta, y suelen ser únicos dentro del historial reciente de un [repositorio](#repository).\n"
    }
  },
  "short_option": {
    "en": {
      "term": "short option",
      "def": "A single-letter identifier for a [command-line argument](#command_line_argument). Most common flags are a single letter preceded by a dash, such as `-v`.\n"
    },
    "es": {
      "term": "opción corta",
      "def": "Un identificador de una sola letra para un [argumento de línea de comandos](#command_line_argument). La mayoría de las banderas comunes son una letra precedida por un guion, como `-v`.\n"
    }
  },
  "side_effect": {
    "en": {
      "term": "side effect",
      "def": "A change made by a function while it runs that is visible after the function finishes, such as modifying a [global variable](#global_variable) or writing to a file. Side effects make programs harder for people to understand, since the effects are not necessarily clear at the point in the program where the function is called.\n"
    },
    "es": {
      "term": "efecto secundario",
      "def": "Un cambio realizado por una función mientras se ejecuta que es visible después de que finaliza, como modificar una [variable global](#global_variable) o escribir en un archivo. Los efectos secundarios dificultan la comprensión del programa, ya que no siempre son evidentes en el punto donde se llama la función.\n"
    }
  },
  "signal": {
    "en": {
      "term": "signal (a condition)",
      "def": "A way of indicating that something has gone wrong in a program, or that some other unexpected event has occurred. [R](#r_language) prefers \"signalling a condition\" to \"raising an exception\". [Python](#python), on the other hand, encourages [raising](#raise_exception) and [catching exceptions](#catch_exception), and in some situations, requires it.\n"
    },
    "es": {
      "term": "señalizar (una condición)",
      "def": "Una forma de indicar que algo ha salido mal en un programa, o que ha ocurrido un evento inesperado. [R](#r_language) prefiere \"señalizar una condición\" en lugar de \"lanzar una excepción\". [Python](#python), por otro lado, fomenta [lanzar](#raise_exception) y [capturar excepciones](#catch_exception), y en algunas situaciones, lo requiere.\n"
    }
  },
  "single_square_brackets": {
    "en": {
      "term": "single square brackets",
      "def": "One set of square brackets `[ ]`, used to select a structure from another structure based on an index value, or range of values, inside the square brackets.\n"
    },
    "es": {
      "term": "corchetes simples",
      "def": "Un conjunto de corchetes `[ ]` utilizados para seleccionar una estructura dentro de otra estructura basada en un valor o rango de valores de índice dentro de los corchetes.\n"
    }
  },
  "single_threaded": {
    "en": {
      "term": "single-threaded",
      "def": "A model of program execution in which only one thing can happen at a time. Single-threaded execution is easier for people to understand, but less efficient than [multi-threaded](#multi_threaded) execution.\n"
    },
    "es": {
      "term": "monohilo",
      "def": "Un modelo de ejecución en el que solo puede ocurrir una cosa a la vez. La ejecución monohilo es más fácil de entender, pero menos eficiente que la ejecución [multihilo](#multi_threaded).\n"
    }
  },
  "singleton": {
    "en": {
      "term": "singleton",
      "def": "A set with only one element, or a [class](#class) with only one [instance](#instance).\n"
    },
    "es": {
      "term": "singleton",
      "def": "Un conjunto con un solo elemento, o una [clase](#class) con una sola [instancia](#instance).\n"
    }
  },
  "singleton_pattern": {
    "en": {
      "term": "Singleton pattern",
      "def": "A [design pattern](#design_pattern) that creates a [singleton](#singleton) [object](#object) to manage some resource or service, such as a database or [cache](#cache). In [object-oriented programming](#oop), the pattern is usually implemented by hiding the [constructor](#constructor) of the [class](#class) in some way so that it can only be called once.\n"
    },
    "es": {
      "term": "patrón Singleton",
      "def": "Un [patrón de diseño](#design_pattern) que crea un [objeto](#object) [singleton](#singleton) para gestionar algún recurso o servicio, como una base de datos o una [caché](#cache). En la [programación orientada a objetos](#oop), el patrón suele implementarse ocultando el [constructor](#constructor) de la [clase](#class) de forma que solo se pueda invocar una vez.\n"
    }
  },
  "slug": {
    "en": {
      "term": "slug",
      "def": "An abbreviated portion of a page's URL that uniquely identifies it. In the example `https://www.mysite.com/category/post-name`, the slug is `post-name`.\n"
    },
    "es": {
      "term": "slug",
      "def": "Una parte abreviada de la URL de una página que la identifica de manera única. En el ejemplo `https://www.mysite.com/category/post-name`, el slug es `post-name`.\n"
    }
  },
  "snake_case": {
    "en": {
      "term": "snake case",
      "def": "See [pothole case](#pothole_case).\n"
    },
    "es": {
      "term": "snake case",
      "def": "Ver [pothole case](#pothole_case).\n"
    }
  },
  "software_distribution": {
    "en": {
      "term": "software distribution",
      "def": "A set of programs that are built, tested, and distributed as a collection so that they can run together.\n"
    },
    "es": {
      "term": "distribución de software",
      "def": "Un conjunto de programas que se construyen, prueban y distribuyen como una colección para que puedan ejecutarse juntos.\n"
    }
  },
  "source_code": {
    "en": {
      "term": "source code",
      "def": "Source code or, simply, code, is the origin of executed code (either by means of an interpreter or compiler). It's the primarily human-produced series of commands that make up a program. (Note: Automatic code generators exist for some applications)\n"
    },
    "es": {
      "term": "código fuente",
      "def": "El código fuente o, simplemente, código, es el origen del código ejecutado (ya sea mediante un intérprete o compilador). Es la serie de comandos producida principalmente por humanos que conforma un programa. (Nota: existen generadores automáticos de código para algunas aplicaciones)\n"
    }
  },
  "source_distribution": {
    "en": {
      "term": "source distribution",
      "def": "A [software distribution](#software_distribution) that includes the source code, typically so that programs can be recompiled on the target computer when they are installed.\n"
    },
    "es": {
      "term": "distribución de código fuente",
      "def": "Una [distribución de software](#software_distribution) que incluye el código fuente, típicamente para que los programas puedan ser recompilados en el equipo de destino al instalarse.\n"
    }
  },
  "sprint": {
    "en": {
      "term": "sprint",
      "def": "A short, intense period of work on a project.\n"
    },
    "es": {
      "term": "sprint",
      "def": "Un período corto e intenso de trabajo en un proyecto.\n"
    }
  },
  "sql": {
    "en": {
      "term": "SQL",
      "def": "The language used for writing queries for a [relational database](#relational_database). The term is an acronym for Structured Query Language.\n"
    },
    "es": {
      "term": "SQL",
      "def": "Lenguaje utilizado para escribir consultas para una [base de datos relacional](#relational_database). El término está un acrónimo del inglés Structured Query Language (Lenguage Estructurado de Consulta).\n"
    }
  },
  "square_root": {
    "en": {
      "term": "Square root",
      "def": "A special case of the [n-th root](#root_math) for which n = 2, i.e. the 2-nd root has the special name \"square root\".\n"
    },
    "es": {
      "term": "raíz cuadrada",
      "def": "Un caso especial de la [n-ésima raíz](#root_math) para el cual n = 2, es decir, la raíz de segundo grado tiene el nombre especial de \"raíz cuadrada\".\n"
    }
  },
  "ssh": {
    "en": {
      "term": "Secure Shell",
      "acronym": "SSH",
      "def": "A protocol and the program that implements it which allows remote access to a server through a secure channel where all information is encrypted.\n"
    },
    "es": {
      "term": "Secure Shell",
      "acronym": "SSH",
      "def": "Un protocolo y el programa que lo implementa cuya principal función es el acceso remoto a un servidor por medio de un canal seguro en el que toda la información está cifrada.\n"
    }
  },
  "ssh_key": {
    "en": {
      "term": "SSH key",
      "def": "A string of random bits stored in a file that is used to identify a user for [SSH](#ssh). Each SSH key has separate public and private parts; the public part can safely be shared, but if the private part becomes known, the key is compromised.\n"
    },
    "es": {
      "term": "clave SSH",
      "def": "Una cadena de bits aleatorios almacenada en un archivo que se utiliza para identificar a un usuario en [SSH](#ssh). Cada clave SSH tiene una parte pública y otra privada; la parte pública puede compartirse de forma segura, pero si la parte privada se hace conocida, la clave queda comprometida.\n"
    }
  },
  "stack_frame": {
    "en": {
      "term": "stack frame",
      "def": "A section of the [call stack](#call_stack) that records details of a single call to a specific function.\n"
    },
    "es": {
      "term": "marco de pila",
      "def": "Una sección de la [pila de llamadas](#call_stack) que registra los detalles de una única llamada a una función específica.\n"
    }
  },
  "stack_overflow": {
    "en": {
      "term": "Stack Overflow",
      "def": "A question-and-answer site popular among programmers.\n"
    },
    "es": {
      "term": "Stack Overflow",
      "def": "Un sitio de preguntas y respuestas popular entre personas programadoras.\n"
    }
  },
  "standard_deviation": {
    "en": {
      "term": "standard deviation",
      "def": "How widely values in a dataset differ from the [mean](#mean). It is calculated as the square root of the [variance](#variance).\n"
    },
    "es": {
      "term": "desviación estándar",
      "def": "En qué medida los valores de un conjunto de datos difieren de la [media](#mean). Se calcula como la raíz cuadrada de la [varianza](#variance).\n"
    }
  },
  "standard_normal_distribution": {
    "en": {
      "term": "standard normal distribution",
      "def": "A [normal distribution](#normal_distribution) with a [mean](#mean) of 0 and a [standard deviation](#standard_deviation) of 1. Values from normal distributions with other [parameters](#parameter) can easily be rescaled to be on a standard normal distribution.\n"
    },
    "es": {
      "term": "distribución normal estándar",
      "def": "Una [distribución normal](#normal_distribution) con una [media](#mean) de 0 y una [desviación estándar](#standard_deviation) de 1. Valores de distribuciones normales con otros parámetros se puede reescalar fácilmente para obtener una distribución normal estándar.\n"
    }
  },
  "stderr": {
    "en": {
      "term": "standard error",
      "def": "A predefined communication channel for a [process](#process), typically used for error messages.\n"
    },
    "es": {
      "term": "error estándar",
      "def": "Un canal de comunicación predefinido para un [proceso](#process), típicamente utilizado para mensajes de error.\n"
    }
  },
  "stdin": {
    "en": {
      "term": "standard input",
      "def": "A predefined communication channel for a [process](#process), typically used to read input from the keyboard or from the previous process in a [pipe](#pipe_shell).\n"
    },
    "es": {
      "term": "entrada estándar",
      "def": "Un canal de comunicación predefinido para un [proceso](#process), comúnmente utilizado para leer datos desde el teclado o desde el proceso anterior en una [tubería](#pipe_shell).\n"
    }
  },
  "stdout": {
    "en": {
      "term": "standard output",
      "def": "A predefined communication channel for a [process](#process), typically used to send output to the screen or to the next process in a [pipe](#pipe_shell).\n"
    },
    "es": {
      "term": "salida estándar",
      "def": "Un canal de comunicación predefinido para un [proceso](#process), comúnmente utilizado para enviar salida a la pantalla o al siguiente proceso en una [tubería](#pipe_shell).\n"
    }
  },
  "stratified_sampling": {
    "en": {
      "term": "stratified sampling",
      "def": "Selecting values by dividing the overall population into [homogeneous](#homogeneous) groups and then taking a random sample from each group.\n"
    },
    "es": {
      "term": "muestreo estratificado",
      "def": "Selección de valores dividiendo la población total en grupos [homogéneos](#homogeneous) y luego tomando una muestra aleatoria de cada grupo.\n"
    }
  },
  "stream": {
    "en": {
      "term": "stream",
      "def": "A sequential flow of data, such as the [bits](#bit) arriving across a network connection or the bytes read from a file.\n"
    },
    "es": {
      "term": "flujo",
      "def": "Un flujo secuencial de datos, como los [bits](#bit) que llegan a través de una conexión de red o los bytes leídos de un archivo.\n"
    }
  },
  "string": {
    "en": {
      "term": "string",
      "def": "A block of text in a program. The term is short for \"character string\".\n"
    },
    "es": {
      "term": "secuencia de caracteres",
      "def": "Bloque de texto en un programa.\n"
    }
  },
  "string_interpolation": {
    "en": {
      "term": "string interpolation",
      "def": "The process of inserting text corresponding to specified values into a [string](#string), usually to make output human-readable.\n"
    },
    "es": {
      "term": "interpolación de cadenas",
      "def": "El proceso de insertar texto correspondiente a valores específicos dentro de una [cadena](#string), usualmente para hacer que la salida sea legible para humanos.\n"
    }
  },
  "students_t_distribution": {
    "en": {
      "term": "student's t-distribution",
      "def": "See [t-distribution](#t_distribution).\n"
    },
    "es": {
      "term": "distribución t de Student",
      "def": "Ver [distribución t](#t_distribution).\n"
    }
  },
  "subcommand": {
    "en": {
      "term": "subcommand",
      "def": "A command that is part of a larger family of commands. For example, `git commit` is a subcommand of [Git](#git).\n"
    },
    "es": {
      "term": "subcomando",
      "def": "Un comando que forma parte de una familia más grande de comandos. Por ejemplo, `git commit` es un subcomando de [Git](#git).\n"
    }
  },
  "subdirectory": {
    "en": {
      "term": "subdirectory",
      "def": "A directory that is below another directory.\n"
    },
    "es": {
      "term": "subdirectorio",
      "def": "Un directorio que se encuentra dentro de otro directorio.\n"
    }
  },
  "supervised_learning": {
    "en": {
      "term": "supervised learning",
      "def": "A [machine learning](#machine_learning) algorithm in which a system is taught to [classify](#classification) values given [training data](#training_data) containing previously-classified values.\n"
    },
    "es": {
      "term": "aprendizaje supervisado",
      "def": "Un algoritmo de [aprendizaje automático](#machine_learning) en el que se enseña a un sistema a [clasificar](#classification) valores a partir de [datos de entrenamiento](#training_data) que ya contienen valores clasificados previamente.\n"
    }
  },
  "svm": {
    "en": {
      "term": "support vector machine",
      "acronym": "SVM",
      "def": "A [supervised learning](#supervised_learning) algorithm that seeks to divide points in a dataset so that the empty space between the resultant sets is as wide as possible.\n"
    },
    "es": {
      "term": "máquina de vectores de soporte",
      "acronym": "SVM",
      "def": "Un algoritmo de [aprendizaje supervisado](#supervised_learning) que busca dividir puntos en un conjunto de datos de manera que el espacio vacío entre los conjuntos resultantes sea lo más amplio posible.\n"
    }
  },
  "synchronous": {
    "en": {
      "term": "synchronous",
      "def": "To happen at the same time. In programming, synchronous operations are ones that have to run simultaneously, or complete at the same time.\n"
    },
    "es": {
      "term": "sincrónico",
      "def": "Ocurre al mismo tiempo. En programación, las operaciones sincrónicas son aquellas que deben ejecutarse simultáneamente o completarse al mismo tiempo.\n"
    }
  },
  "systematic_error": {
    "en": {
      "term": "systematic error",
      "def": "See [bias](#bias).\n"
    },
    "es": {
      "term": "error sistemático",
      "def": "Ver [sesgo](#bias).\n"
    }
  },
  "t_distribution": {
    "en": {
      "term": "t-distribution",
      "def": "A variation on the [normal distribution](#normal_distribution) that is adjusted to account for estimating [variance](#variance) from the sample instead of knowing it in advance.\n"
    },
    "es": {
      "term": "distribución t",
      "def": "Una variación de la [distribución normal](#normal_distribution) ajustada para estimar la [varianza](#variance) a partir de la muestra en lugar de conocerla de antemano.\n"
    }
  },
  "tab_completion": {
    "en": {
      "term": "tab completion",
      "def": "A technique implemented by most [REPLs](#repl), [shells](#shell), and programming editors that completes a command, variable name, filename, or other text when the TAB key is pressed.\n"
    },
    "es": {
      "term": "autocompletado con tabulador",
      "def": "Una técnica implementada por la mayoría de los [REPLs](#repl), [shells](#shell), y editores de programación que completa un comando, nombre de variable, nombre de archivo u otro texto cuando se presiona la tecla TAB.\n"
    }
  },
  "table": {
    "en": {
      "term": "table",
      "def": "A set of [records](#record) in a [relational database](#relational_database) or [observations](#observation) in a [data frame](#data_frame). Tables are usually displayed as rows (each of which represents one record or observation) and columns (each of which represents a [field](#field) or [variable](#variable_data)).\n"
    },
    "es": {
      "term": "tabla",
      "def": "Un conjunto de [registros](#record) en una [base de datos relacional](#relational_database) o [observaciones](#observation) en un [data frame](#data_frame). Las tablas suelen mostrarse como filas (cada una representa un registro u observación) y columnas (cada una representa un [campo](#field) o [variable](#variable_data)).\n"
    }
  },
  "tag": {
    "en": {
      "term": "tag (in version control)",
      "def": "A readable label attached to a specific [commit](#commit) so that it can easily be referenced later.\n"
    },
    "es": {
      "term": "etiqueta (en control de versiones)",
      "def": "Una etiqueta legible adjunta a un [commit](#commit) específico para que pueda ser referenciado fácilmente más adelante.\n"
    }
  },
  "tdd": {
    "en": {
      "term": "test-driven development",
      "acronym": "TDD",
      "def": "A programming practice in which tests are written before a new feature is added or a [bug](#bug) is fixed in order to clarify the goal.\n"
    },
    "es": {
      "term": "desarrollo guiado por pruebas",
      "acronym": "TDD",
      "def": "Una práctica de programación en la que las pruebas se escriben antes de agregar una nueva función o corregir un [error](#bug), con el fin de aclarar el objetivo.\n"
    }
  },
  "template_method_pattern": {
    "en": {
      "term": "Template Method pattern",
      "def": "A [design pattern](#design_pattern) in which a [parent class](#parent_class) defines an overall sequence of operations by calling [abstract methods](#abstract_method) that [child classes](#child_class) must then implement. Each child class then behaves in the same general way, but implements the steps differently.\n"
    },
    "es": {
      "term": "patrón de método plantilla",
      "def": "Un [patrón de diseño](#design_pattern) en el cual una [clase padre](#parent_class) define una secuencia general de operaciones llamando a [métodos abstractos](#abstract_method) que las [clases hijas](#child_class) deben implementar. Cada clase hija sigue un comportamiento general similar, pero implementa los pasos de manera diferente.\n"
    }
  },
  "ternary_expression": {
    "en": {
      "term": "ternary expression",
      "def": "An expression that has three parts. [Conditional expressions](#conditional_expression) are the only ternary expressions in most languages.\n"
    },
    "es": {
      "term": "expresión ternaria",
      "def": "Una expresión que tiene tres partes. Las [expresiones condicionales](#conditional_expression) son las únicas expresiones ternarias en la mayoría de los lenguajes.\n"
    }
  },
  "test_data": {
    "en": {
      "term": "test data",
      "def": "Test data is a portion of a dataset used to evaluate the correctness of a [machine learning](#machine_learning) algorithm after it has been trained. It should always be separated from the [training data](#training_data) to ensure that the model is properly tested with unseen data.\n"
    },
    "es": {
      "term": "datos de prueba",
      "def": "Los datos de prueba son una parte de un conjunto de datos utilizada para evaluar la precisión de un algoritmo de [aprendizaje automático](#machine_learning) después de que ha sido entrenado. Siempre deben separarse de los [datos de entrenamiento](#training_data) para garantizar que el modelo se pruebe adecuadamente con datos no vistos.\n"
    }
  },
  "test_runner": {
    "en": {
      "term": "test runner",
      "def": "A program that finds and runs software tests and reports their results.\n"
    },
    "es": {
      "term": "ejecutor de pruebas",
      "def": "Un programa que encuentra y ejecuta pruebas de software y reporta sus resultados.\n"
    }
  },
  "three_vs": {
    "en": {
      "term": "three Vs",
      "def": "The volume, velocity, and variety that distinguish [big data](#big_data).\n"
    },
    "es": {
      "term": "tres V",
      "def": "El volumen, la velocidad y la variedad que distinguen a los [macrodatos](#big_data).\n"
    }
  },
  "throw_exception": {
    "en": {
      "term": "throw (exception)",
      "def": "Another term for [raising](#raise_exception) an exception.\n"
    },
    "es": {
      "term": "lanzar (una excepción)",
      "def": "Otro término para [lanzar](#raise_exception) una excepción.\n"
    }
  },
  "tibble": {
    "en": {
      "term": "tibble",
      "def": "A modern replacement for [R](#r_language)'s data frame, which stores tabular data in columns and rows, defined and used in the [tidyverse](#tidyverse).\n"
    },
    "es": {
      "term": "tibble",
      "def": "Un remplazo moderno para los data frames de [R](#r_language) que guarda datos tabulares en columnas y filas, definido y usado en el [tidyverse](#tidyverse).\n"
    }
  },
  "ticket": {
    "en": {
      "term": "ticket",
      "def": "See [issue](#issue).\n"
    },
    "es": {
      "term": "ticket",
      "def": "Ver [problema](#issue).\n"
    }
  },
  "ticketing_system": {
    "en": {
      "term": "ticketing system",
      "def": "See [issue tracking system](#issue_tracking_system).\n"
    },
    "es": {
      "term": "sistema de tickets",
      "def": "Ver [sistema de seguimiento de problemas](#issue_tracking_system).\n"
    }
  },
  "tidy_data": {
    "en": {
      "term": "tidy data",
      "def": "Tabular data that satisfies [three conditions](https://vita.had.co.nz/papers/tidy-data.pdf) that facilitate initial cleaning, and later exploration and analysis—(1) each variable forms a column, (2) each observation forms a row, and (3) each type of observation unit forms a table.\n"
    },
    "es": {
      "term": "datos ordenados",
      "def": "Datos tabulares que satisfacen [tres condiciones](https://vita.had.co.nz/papers/tidy-data.pdf) que facilitan su limpieza inicial y su posterior exploración y análisis—(1) cada variable conforma una columna, (2) cada observación conforma una fila y (3) cada tipo de unidad de observación conforma una tabla.\n"
    }
  },
  "tidymodels": {
    "en": {
      "term": "Tidymodels",
      "def": "A collection of [R](#r_language) [packages](#package) for modeling and statistical analysis designed with a [shared philosophy](https://tidymodels.github.io/model-implementation-principles/index.html).\n"
    },
    "es": {
      "term": "Tidymodels",
      "def": "Una colección de [paquetes](#package) de [R](#r_language) para modelado y análisis estadístico diseñada con una [filosofía compartida](https://tidymodels.github.io/model-implementation-principles/index.html).\n"
    }
  },
  "tidyverse": {
    "en": {
      "term": "Tidyverse",
      "def": "A collection of [R](#r_language) [packages](#package) for operating on tabular data in consistent ways.\n"
    },
    "es": {
      "term": "Tidyverse",
      "def": "Una colección de paquetes de [R](#r_language) para operar de maneras consistentes con datos tabulares.\n"
    }
  },
  "time_series": {
    "en": {
      "term": "time series",
      "def": "A set of measurements taken at different times, which may or may not be regular intervals.\n"
    },
    "es": {
      "term": "serie temporal",
      "def": "Un conjunto de mediciones tomadas en diferentes momentos, que pueden o no ser a intervalos regulares.\n"
    }
  },
  "timestamp": {
    "en": {
      "term": "timestamp",
      "def": "A digital identifier showing the time at which something was created or accessed. Timestamps should use [ISO date format](#iso_date_format) for portability.\n"
    },
    "es": {
      "term": "marca de tiempo",
      "def": "Un identificador digital que indica cuándo se creó o accedió a algo. Las marcas de tiempo deben usar el [formato de fecha ISO](#iso_date_format) para ser portátiles.\n"
    }
  },
  "tolerance": {
    "en": {
      "term": "tolerance",
      "def": "How closely the [actual result](#actual_result) of a test must agree with the [expected result](#expected_result) in order for the test to pass. Tolerances are usually expressed in terms of [relative error](#relative_error).\n"
    },
    "es": {
      "term": "tolerancia",
      "def": "Qué tan cerca debe estar el [resultado real](#actual_result) de una prueba del [resultado esperado](#expected_result) para que la prueba sea exitosa. Las tolerancias suelen expresarse en términos de [error relativo](#relative_error).\n"
    }
  },
  "training_data": {
    "en": {
      "term": "training data",
      "def": "Training data is a portion of a dataset used to train [machine learning](#machine_learning) algorithm to recognise similar data. It should always be separated from the [test data](#test_data) to ensure that the model is properly tested with data it has never seen before.\n"
    },
    "es": {
      "term": "datos de entrenamiento",
      "def": "Los datos de entrenamiento son una parte de un conjunto de datos utilizados para entrenar un algoritmo de [aprendizaje automático](#machine_learning) para reconocer datos similares. Siempre deben estar separados de los [datos de prueba](#test_data) para garantizar que el modelo se pruebe correctamente con datos que nunca ha visto antes.\n"
    }
  },
  "transitive_dependency": {
    "en": {
      "term": "transitive dependency",
      "def": "If A depends on B and B depends on C, C is a transitive dependency of A.\n"
    },
    "es": {
      "term": "dependencia transitiva",
      "def": "Si A depende de B y B depende de C, entonces C es una dependencia transitiva de A.\n"
    }
  },
  "tree": {
    "en": {
      "term": "tree",
      "def": "A [graph](#graph) in which every node except the [root](#root_tree) has exactly one [parent](#parent_tree).\n"
    },
    "es": {
      "term": "árbol",
      "def": "Un [grafo](#graph) en el que cada nodo, excepto la [raíz](#root_tree), tiene exactamente un [padre](#parent_tree).\n"
    }
  },
  "triage": {
    "en": {
      "term": "triage",
      "def": "To go through the [issues](#issue) associated with a project and decide which are currently priorities. Triage is one of the key responsibilities of a [project manager](#project_manager).\n"
    },
    "es": {
      "term": "triaje",
      "def": "Revisar los [problemas](#issue) asociados con un proyecto y decidir cuáles son prioridades actuales. El triaje es una de las responsabilidades clave de un [gerente de proyecto](#project_manager).\n"
    }
  },
  "true": {
    "en": {
      "term": "true",
      "def": "The logical ([Boolean](#boolean)) state opposite of \"[false](#false)\". Used in logic and programming to represent a [binary](#binary) state of something.\n"
    },
    "es": {
      "term": "verdadero",
      "def": "El estado lógico ([Booleano](#boolean)) opuesto a \"[falso](#false)\". Usado en lógica y programación para representar un estado [binario](#binary).\n"
    }
  },
  "truthy": {
    "en": {
      "term": "truthy",
      "def": "Evaluating to [true](#true) in a [Boolean](#boolean) context.\n"
    },
    "es": {
      "term": "verdadero implícito",
      "def": "Evalúa como [verdadero](#true) en un contexto [booleano](#boolean).\n"
    }
  },
  "tuple": {
    "en": {
      "term": "tuple",
      "def": "A data type that has a fixed number of parts, such as the three color components of a red-green-blue color specification. In \"[Python](#python)\", tuples are immutable (their values cannot be reset.)\n"
    },
    "es": {
      "term": "tupla",
      "def": "Un tipo de dato con un número fijo de partes, como los tres componentes de color rojo-verde-azul. En [Python](#python), las tuplas son inmutables (sus valores no pueden cambiarse).\n"
    }
  },
  "two_hard_problems": {
    "en": {
      "term": "two hard problems in computer science",
      "def": "Refers to a quote by Phil Karlton—\"There are only two hard problems in computer science—cache invalidation and naming things.\" Many variations add a third problem (most often \"[off-by-one errors](#off_by_one_error)\").\n"
    },
    "es": {
      "term": "dos problemas difíciles en informática",
      "def": "Hace referencia a una cita de Phil Karlton: \"Solo hay dos problemas difíciles en informática: la invalidación de caché y nombrar cosas.\" Muchas variaciones agregan un tercer problema (a menudo los \"[errores de desbordamiento de uno](#off_by_one_error)\").\n"
    }
  },
  "type_coercion": {
    "en": {
      "term": "type coercion",
      "def": "To convert data from one type to another, e.g., from the integer `4` to the equivalent floating point number `4.0`.\n"
    },
    "es": {
      "term": "coerción de tipo",
      "def": "Convertir datos de un tipo a otro, por ejemplo, del entero `4` al número de punto flotante equivalente `4.0`.\n"
    }
  },
  "unary_expression": {
    "en": {
      "term": "unary expression",
      "def": "An expression with one argument, such as `log 5`.\n"
    },
    "es": {
      "term": "expresión unaria",
      "def": "Una expresión con un solo argumento, como `log 5`.\n"
    }
  },
  "unicode": {
    "en": {
      "term": "Unicode",
      "def": "A standard that defines numeric codes for many thousands of characters and symbols. Unicode does not define how those numbers are stored; that is done by standards like [UTF-8](#utf_8).\n"
    },
    "es": {
      "term": "Unicode",
      "def": "Un estándar que define códigos numéricos para miles de caracteres y símbolos. Unicode no define cómo se almacenan esos números; eso lo hacen estándares como [UTF-8](#utf_8).\n"
    }
  },
  "unit_test": {
    "en": {
      "term": "unit test",
      "def": "A test that exercises one function or feature of a piece of software and produces [pass](#pass_test), [fail](#fail_test), or [error](#error_test).\n"
    },
    "es": {
      "term": "prueba unitaria",
      "def": "Una prueba que verifica una función o característica específica de un software y produce [éxito](#pass_test), [fallo](#fail_test) o [error](#error_test).\n"
    }
  },
  "unsupervised_learning": {
    "en": {
      "term": "unsupervised learning",
      "def": "Algorithms that [cluster](#clustering) data without knowing in advance what the groups will be.\n"
    },
    "es": {
      "term": "aprendizaje no supervisado",
      "def": "Algoritmos que [agrupan](#clustering) datos sin conocer de antemano qué grupos existen.\n"
    }
  },
  "up_vote": {
    "en": {
      "term": "up-vote",
      "def": "A vote in favor of something.\n"
    },
    "es": {
      "term": "voto positivo",
      "def": "Un voto a favor de algo.\n"
    }
  },
  "update_operator": {
    "en": {
      "term": "update operator",
      "def": "See [in-place operator](#in_place_operator).\n"
    },
    "es": {
      "term": "operador de actualización",
      "def": "Ver [operador en el lugar](#in_place_operator).\n"
    }
  },
  "upstream_repository": {
    "en": {
      "term": "upstream repository",
      "def": "The [remote repository](#remote_repository) from which this [repository](#repository) was derived. Programmers typically save changes in their own repository and then submit a [pull request](#pull_request) to the upstream repository where changes from other programmers are also collected.\n"
    },
    "es": {
      "term": "repositorio principal",
      "def": "El [repositorio remoto](#remote_repository) del cual se derivó este [repositorio](#repository). Los programadores suelen guardar los cambios en su propio repositorio y luego envían una [solicitud de extracción](#pull_request) al repositorio principal donde se recopilan los cambios de otros programadores.\n"
    }
  },
  "url": {
    "en": {
      "term": "Uniform Resource Locator",
      "acronym": "URL",
      "def": "A unique address on the World-Wide Web. URLs originally identified web pages, but may also represent datasets or database queries, particularly if they include a [query string](#query_string).\n"
    },
    "es": {
      "term": "Localizador Uniforme de Recursos",
      "acronym": "URL",
      "def": "Una dirección única en la World Wide Web. Originalmente las URLs identificaban páginas web, pero también pueden representar conjuntos de datos o consultas de bases de datos, especialmente si incluyen una [cadena de consulta](#query_string).\n"
    }
  },
  "utf_8": {
    "en": {
      "term": "UTF-8",
      "def": "A way to store the numeric codes representing [Unicode](#unicode) characters in memory that is [backward-compatible](#backward_compatible) with the older [ASCII](#ascii) standard.\n"
    },
    "es": {
      "term": "UTF-8",
      "def": "Una forma de almacenar en memoria los códigos numéricos que representan caracteres [Unicode](#unicode), compatible con versiones anteriores del estándar [ASCII](#ascii).\n"
    }
  },
  "variable_arguments": {
    "en": {
      "term": "variable arguments",
      "def": "In a function, the ability to take any number of arguments. [R](#r_language) uses `...` to capture the \"extra\" arguments. [Python](#python) uses `*args` and `**kwargs` to capture unnamed, and named, \"extra\" arguments, respectively.\n"
    },
    "es": {
      "term": "argumentos variables",
      "def": "En una función, la capacidad de tomar cualquier cantidad de argumentos. [R](#r_language) usa `...` para capturar los argumentos \"extra\". [Python](#python) usa `*args` y `**kwargs` para capturar argumentos \"extra\" sin nombre y con nombre, respectivamente.\n"
    }
  },
  "variable_data": {
    "en": {
      "term": "variable (data)",
      "def": "Some attribute of a population that can be measured or observed.\n"
    },
    "es": {
      "term": "variable (dato)",
      "def": "Algún atributo de una población que puede medirse u observarse.\n"
    }
  },
  "variable_program": {
    "en": {
      "term": "variable (program)",
      "def": "A name in a program that has some data associated with it. A variable's value can be changed after definition.\n"
    },
    "es": {
      "term": "variable (programa)",
      "def": "Un nombre en un programa que tiene algunos datos asociados. El valor de una variable se puede cambiar después de su definición.\n"
    }
  },
  "variance": {
    "en": {
      "term": "variance",
      "def": "How widely values in a dataset differ from the [mean](#mean). It is calculated as the average of the squared differences between the values and the mean. The [standard deviation](#standard_deviation) is often used instead, since it has the same units as the data, while the variance is expressed in units squared.\n"
    },
    "es": {
      "term": "varianza",
      "def": "En qué medida los valores de un conjunto de datos difieren de la [media](#mean). Se calcula como el promedio de las diferencias al cuadrado entre los valores y la media. La [desviación estándar](#standard_deviation) se usa a menudo en su lugar, ya que tiene las mismas unidades que los datos, mientras que la varianza se expresa en unidades al cuadrado.\n"
    }
  },
  "vector": {
    "en": {
      "term": "vector",
      "def": "A sequence of values, usually of [homogeneous](#homogeneous) type. Vectors are the fundamental data structure in [R](#r_language); a [scalar](#scalar) is just a vector with exactly one [element](#element).\n"
    },
    "es": {
      "term": "vector",
      "def": "Una secuencia de valores, normalmente de tipo [homogéneo](#homogeneous). Los vectores son la estructura de datos fundamental en [R](#r_language); un [escalar](#scalar) es solo un vector con exactamente un elemento.\n"
    }
  },
  "vectorize": {
    "en": {
      "term": "vectorize",
      "def": "To write code so that operations are performed on entire vectors, rather than element-by-element within loops.\n"
    },
    "es": {
      "term": "vectorizar",
      "def": "Escribir código de modo que las operaciones se ejecuten en vectores completos, más que elemento por elemento dentro de un bucle.\n"
    }
  },
  "version_control_system": {
    "en": {
      "term": "version control system",
      "def": "A system for managing changes made to software during its development.\n"
    },
    "es": {
      "term": "sistema de control de versión",
      "def": "Un sistema para manejar los cambios hechos durante el desarollo de software.\n"
    }
  },
  "vignette": {
    "en": {
      "term": "vignette",
      "def": "A long-form guide used to provide details of a [package](#package) beyond the README.md or function documentation.\n"
    },
    "es": {
      "term": "viñeta",
      "def": "Una guía detallada utilizada para proporcionar información de un [paquete](#package) más allá del archivo README.md o la documentación de funciones.\n"
    }
  },
  "vim": {
    "en": {
      "term": "Vim (editor)",
      "def": "The default text editor on Unix. Vim is a very powerful text editor, with a steeper learning curve than [nano](#nano_editor), but that allows the user to execute shell commands and use [regular expressions](#regular_expression) to alter files programmatically.\n"
    },
    "es": {
      "term": "Vim (editor)",
      "def": "El editor de texto predeterminado en Unix. Vim es un editor muy potente, con una curva de aprendizaje más pronunciada que [nano](#nano_editor), pero permite ejecutar comandos de shell y usar [expresiones regulares](#regular_expression) para modificar archivos de forma programada.\n"
    }
  },
  "virtual_environment": {
    "en": {
      "term": "virtual environment",
      "def": "In [Python](#python), the `virtualenv` [package](#package) allows you to create virtual, disposable, [Python](#python) software environments containing only the packages and versions of packages you want to use for a particular project or task, and to install new packages into the environment without affecting other virtual environments, or the system-wide default environment.\n"
    },
    "es": {
      "term": "entorno virtual",
      "def": "En [Python](#python), el [paquete](#package) `virtualenv` permite crear entornos de software virtuales y desechables que contienen solo los paquetes y versiones que deseas usar para un proyecto o tarea específicos, e instalar nuevos paquetes sin afectar otros entornos virtuales ni el entorno predeterminado del sistema.\n"
    }
  },
  "virtual_machine": {
    "en": {
      "term": "virtual machine",
      "def": "A program that pretends to be a computer. This may seem a bit redundant, but VMs are quick to create and start up, and changes made inside the virtual machine are contained within that VM so we can install new [packages](#package) or run a completely different operating system without affecting the underlying computer.\n"
    },
    "es": {
      "term": "máquina virtual",
      "def": "Un programa que pretende ser una computadora. Aunque puede parecer redundante, las máquinas virtuales (MV) se crean y se inician rápidamente, y los cambios hechos dentro de la máquina virtual quedan contenidos dentro de esa VM, esto permite que podamos instalar nuevos paquetes o ejecutar un sistema operativo diferente sin afectar la computadora subyacente.\n"
    }
  },
  "visitor_pattern": {
    "en": {
      "term": "Visitor pattern",
      "def": "A [design pattern](#design_pattern) in which the operation to be done is taken to each element of a data structure in turn. It is usually implemented by having a generator \"visitor\" that knows how to reach the structure's elements, which is given a function or method to call for each in turn, and that carries out the specific operation.\n"
    },
    "es": {
      "term": "patrón visitante",
      "def": "Un [patrón de diseño](#design_pattern) en el cual una operación se aplica a cada elemento de una estructura de datos. Normalmente se implementa con un generador \"visitante\" que sabe cómo recorrer los elementos, y recibe una función o método para ejecutar con cada uno.\n"
    }
  },
  "walk_tree": {
    "en": {
      "term": "walk (a tree)",
      "def": "To visit each [node](#node) in a [tree](#tree) in some order, typically [depth-first](#depth_first) or [breadth-first](#breadth_first).\n"
    },
    "es": {
      "term": "recorrer (un árbol)",
      "def": "Visitar cada [nodo](#node) en un [árbol](#tree) en algún orden, típicamente en orden [profundidad primero](#depth_first) o [anchura primero](#breadth_first).\n"
    }
  },
  "while_loop": {
    "en": {
      "term": "while loop",
      "def": "A statement in a program that repeats one or more other statements (the [loop body](#loop_body)) as long as a condition is [true](#true).\n"
    },
    "es": {
      "term": "bucle while",
      "def": "Una instrucción en un programa que repite una o más sentencias (el [cuerpo del bucle](#loop_body)) mientras una condición sea [verdadera](#true).\n"
    }
  },
  "whitespace": {
    "en": {
      "term": "whitespace",
      "def": "The space, newline, carriage return, and horizontal and vertical tab characters that take up space but do not create a visible mark. The name comes from their appearance on a printed page in the era of typewriters.\n"
    },
    "es": {
      "term": "espacio en blanco",
      "def": "Caracteres como espacio, salto de línea, retorno de carro y tabulaciones que ocupan espacio pero no crean una marca visible. El nombre proviene de su apariencia en una página impresa en la era de las máquinas de escribir.\n"
    }
  },
  "wildcard": {
    "en": {
      "term": "wildcard",
      "def": "A character expression that can match text, such as the `*` in `*.csv` (which matches any filename whose name ends with `.csv`).\n"
    },
    "es": {
      "term": "comodín",
      "def": "Una expresión de carácter que puede coincidir con texto, como el `*` en `*.csv` (que coincide con cualquier archivo cuyo nombre termine en `.csv`).\n"
    }
  },
  "xml": {
    "en": {
      "term": "XML",
      "def": "A set of rules for defining [HTML](#html)-like tags and using them to format documents (typically data). XML was popular in the early 2000s, but its complexity led many programmers to adopt [JSON](#json), instead.\n"
    },
    "es": {
      "term": "XML",
      "def": "Un conjunto de reglas para definir etiquetas similares a [HTML](#html) y usarlas para darle formato a documentos (normalmente datos). XML alcanzó popularidad a principios de la década de 2000, pero su complejidad llevó a muchos programadores a adoptar [JSON](#json) en su lugar.\n"
    }
  },
  "yaml": {
    "en": {
      "term": "YAML",
      "def": "Short for \"YAML Ain't Markup Language\", a way to represent nested data using indentation rather than the parentheses and commas of [JSON](#json). YAML is often used in configuration files and to define [parameters](#parameter) for various flavors of [Markdown](#markdown) documents.\n"
    },
    "es": {
      "term": "YAML",
      "def": "Acrónimo recursivo de \"YAML Ain't Markup Language\" (YAML no es un lenguaje de marcación), es una manera de representar datos anidados usando identación en lugar de paréntesis    y comillas usadas en [JSON](#json). YAML es usado frequentemente en     archivos de configuración y para definir [parámetros](#parameter) en varios estilos de documentos en [Markdown](#markdown).\n"
    }
  }
}
